[{"index": 0, "timeCode": "March 25, 2013, 01:29:30 PM", "reply": -1, "user": "88a51", "content": "The health care system should finance more money the people who are less healthy and ill or have some sort of disease and not as much to the people who are regularly healthy", "contentSimp": "health care system finance money people healthy sort disease people regularly healthy"}, {"index": 1, "timeCode": "March 25, 2013, 01:36:48 PM", "reply": 0, "user": "88a51", "content": "with the exception of the elderly and the youth", "contentSimp": "exception elderly youth"}, {"index": 2, "timeCode": "March 25, 2013, 01:39:45 PM", "reply": -1, "user": "88a51", "content": "Every health insurance in America should provide 2 to 3 free clinical check ups for a family of 3 or more, and 1 to 2 for single households.", "contentSimp": "health insurance america provide 2 3 free clinical check ups family 3 more, 1 2 single households."}, {"index": 3, "timeCode": "March 25, 2013, 01:51:51 PM", "reply": -1, "user": "88a51", "content": "medicare/medicaid should be equal people of all income but at the same time affordable", "contentSimp": "medicare/medicaid equal people income time affordable"}, {"index": 4, "timeCode": "March 25, 2013, 03:17:34 PM", "reply": -1, "user": "8a52", "content": "Insurance companies should make the co-payments based upon yearly household income.", "contentSimp": "insurance companies make co-payments based yearly household income."}, {"index": 5, "timeCode": "March 25, 2013, 03:18:26 PM", "reply": 3, "user": "8a52", "content": "This will help with people actually staying current on their health.", "contentSimp": "people staying current health."}, {"index": 6, "timeCode": "March 25, 2013, 03:19:32 PM", "reply": -1, "user": "8a52", "content": "Medicare/Medicaid should get a \"flex card\" with so much money on it yearly so that will be able to pay for at least their prescriptions.", "contentSimp": "medicare/medicaid \"flex card\" money yearly pay prescriptions."}, {"index": 7, "timeCode": "March 25, 2013, 03:21:47 PM", "reply": -1, "user": "8a52", "content": "When prescribed drugs the doctor should have a bar code to scan so you can get them refilled more conveniently when you want to get the prescription filled at the drug store. This way the pharmacist can monitor what drugs you are getting and how much.", "contentSimp": "prescribed drugs doctor bar code scan refilled conveniently prescription filled drug store. pharmacist monitor drugs much."}, {"index": 8, "timeCode": "March 25, 2013, 03:23:36 PM", "reply": -1, "user": "8a52", "content": "Physicians should evaluate and give tips to people who say they are having problems with certain issues before just automatically diagnose them with some disease that causes them to have to take medicine that they can become dependent on and start to abuse.", "contentSimp": "physicians evaluate give tips people problems issues automatically diagnose disease medicine dependent start abuse."}, {"index": 9, "timeCode": "March 25, 2013, 03:24:48 PM", "reply": -1, "user": "8a52", "content": "People with chronic illnesses should have specialists with reasonable prices so physicians can monitor their health more efficiently.", "contentSimp": "people chronic illnesses specialists reasonable prices physicians monitor health efficiently."}, {"index": 10, "timeCode": "March 25, 2013, 03:25:42 PM", "reply": -1, "user": "8a52", "content": "All doctors and physicians should have a small pharmacist that will be convenient for the patient to get their prescriptions refilled.", "contentSimp": "doctors physicians small pharmacist convenient patient prescriptions refilled."}, {"index": 11, "timeCode": "March 25, 2013, 03:26:55 PM", "reply": -1, "user": "8a52", "content": "Physicians need to go to seminars and small courses to stay current on new things in the health world and what type of diseases have been detected lately so that less misdiagnosing occurs.", "contentSimp": "physicians seminars small courses stay current things health world type diseases detected misdiagnosing occurs."}, {"index": 12, "timeCode": "March 25, 2013, 03:30:22 PM", "reply": -1, "user": "8a52", "content": "Emergency room visits should be less expensive. And pharmacies should have a small in and out clinics with reasonable prices for emergencies less severe than hospital attention for anyone with or without insurance.", "contentSimp": "emergency room visits expensive. pharmacies small clinics reasonable prices emergencies severe hospital attention insurance."}, {"index": 13, "timeCode": "March 25, 2013, 03:32:49 PM", "reply": -1, "user": "8a52", "content": "Nursing homes should be covered by Medicare since some elderly do not have family that can afford it but need their loved ones to be monitored.", "contentSimp": "nursing homes covered medicare elderly family afford loved monitored."}, {"index": 14, "timeCode": "March 25, 2013, 03:35:13 PM", "reply": -1, "user": "8a52", "content": "The government could pull out all money going into the healthcare system and the country would just have to build itself back up by people helping each other out.", "contentSimp": "government pull money healthcare system country build back people helping out."}, {"index": 15, "timeCode": "March 25, 2013, 03:36:11 PM", "reply": -1, "user": "8a52", "content": "People with chronic illnesses should seek the medical attention that they need no matter the financial situation.", "contentSimp": "people chronic illnesses seek medical attention matter financial situation."}, {"index": 16, "timeCode": "March 25, 2013, 03:38:27 PM", "reply": -1, "user": "8a52", "content": "All drugs should have a generic brand offered so people won't have to pay so much for the medicines that they need.", "contentSimp": "drugs generic brand offered people won't pay medicines need."}, {"index": 17, "timeCode": "March 25, 2013, 03:39:27 PM", "reply": -1, "user": "8a52", "content": "Birth control should be free so that pregnancies will decrease and Medicaid won't have to provide for that person and the unborn child as well. ", "contentSimp": "birth control free pregnancies decrease medicaid won't provide person unborn child well. "}, {"index": 18, "timeCode": "March 25, 2013, 03:45:51 PM", "reply": -1, "user": "8a52", "content": "Seeing a dietician or a nutritionist should be free at least once a year so maybe that will cut back on visiting the primary doctor so much because natural health is sufficient and they are less likely to get ill.", "contentSimp": "dietician nutritionist free year cut back visiting primary doctor natural health sufficient ill."}, {"index": 19, "timeCode": "March 26, 2013, 12:28:53 PM", "reply": -1, "user": "36a53", "content": "There should be a universal healthcare system. Insurance companies are a big problem today", "contentSimp": "universal healthcare system. insurance companies big problem today"}, {"index": 20, "timeCode": "March 26, 2013, 12:33:09 PM", "reply": -1, "user": "36a53", "content": "Physicians misdiagnosing patients is happening more often. The physicians should be evaluated regulary so it reduces the risk", "contentSimp": "physicians misdiagnosing patients happening often. physicians evaluated regulary reduces risk"}, {"index": 21, "timeCode": "March 26, 2013, 12:39:29 PM", "reply": 17, "user": "36a53", "content": "Women clinics should be readily available and more awareness to prevent diseases/cancers", "contentSimp": "women clinics readily awareness prevent diseases/cancers"}, {"index": 22, "timeCode": "March 26, 2013, 12:48:03 PM", "reply": 9, "user": "36a53", "content": "Being able to visit specialists with reasonable prices will also help in the long run--illness could improve or caught early before worsens, and less trips to a physician who could possibly not know what is wrong", "contentSimp": "visit specialists reasonable prices long run--illness improve caught early worsens, trips physician possibly wrong"}, {"index": 23, "timeCode": "March 26, 2013, 12:51:37 PM", "reply": -1, "user": "36a53", "content": "Physicians should pay attention more to figuring out the cause of a particular problem rather than prescribing drugs to alleviate symptoms--more money gone to drugs and illness not cured", "contentSimp": "physicians pay attention figuring problem prescribing drugs alleviate symptoms--more money drugs illness cured"}, {"index": 24, "timeCode": "March 26, 2013, 01:21:29 PM", "reply": -1, "user": "80a54", "content": "I think that people who have mental illnesses should be able to see a doctor or specialist at a reasonable cost", "contentSimp": "people mental illnesses doctor specialist reasonable cost"}, {"index": 25, "timeCode": "March 26, 2013, 01:22:24 PM", "reply": 23, "user": "80a54", "content": "True, because sometimes money for drugs could result in substance abuse for certain cases.", "contentSimp": "true, money drugs result substance abuse cases."}, {"index": 26, "timeCode": "March 26, 2013, 01:23:30 PM", "reply": 22, "user": "80a54", "content": "Exactly. Saving both time and money without wasting the resources that the government has supplied.", "contentSimp": "exactly. saving time money wasting resources government supplied."}, {"index": 27, "timeCode": "March 26, 2013, 01:25:10 PM", "reply": 21, "user": "80a54", "content": "I agree because it is ultimately up to the woman to decide for herself whether or not to have the baby and the risks that go along with it.", "contentSimp": "agree ultimately woman decide baby risks it."}, {"index": 28, "timeCode": "March 26, 2013, 01:26:51 PM", "reply": -1, "user": "80a54", "content": "Seeing a dietician/nutritionist would also give the person a better picture as to where their health is, and how to improve it, to avoid going to the doctor at all.", "contentSimp": "dietician/nutritionist give person picture health is, improve it, avoid doctor all."}, {"index": 29, "timeCode": "March 26, 2013, 01:28:07 PM", "reply": 3, "user": "80a54", "content": "I agree, but I feel that for those unemployed or have no intention of getting a job may have an issue paying it.", "contentSimp": "agree, feel unemployed intention job issue paying it."}, {"index": 30, "timeCode": "March 26, 2013, 01:30:45 PM", "reply": -1, "user": "80a54", "content": "I think that emergency room visits should be free, if the emergency is one of actual concern. Not an \"emergency\" involving a headache or stomach problems that could be solved with over the counter medication, but rather emergencies involving deep cuts or severe infections.", "contentSimp": "emergency room visits free, emergency actual concern. \"emergency\" involving headache stomach problems solved counter medication, emergencies involving deep cuts severe infections."}, {"index": 31, "timeCode": "March 26, 2013, 01:34:39 PM", "reply": 7, "user": "80a54", "content": "I agree, because doing so would make the system more efficient without sending people away who actually need it. Also, you could get a better tab on how much of the substance is being used, and the doctor can tell if the patient is abusing the substance or not.", "contentSimp": "agree, make system efficient sending people it. also, tab substance used, doctor patient abusing substance not."}, {"index": 32, "timeCode": "March 26, 2013, 01:37:08 PM", "reply": -1, "user": "80a54", "content": "I think that every hospital or clinic should offer health care because people can't always get to the specific provider they have listed in their insurance. They could also need serious medical attention and not be able to get it at an affordable price.", "contentSimp": "hospital clinic offer health care people can't specific provider listed insurance. medical attention affordable price."}, {"index": 33, "timeCode": "March 26, 2013, 01:40:17 PM", "reply": 0, "user": "80a54", "content": "Also, the mentally ill/disabled", "contentSimp": "also, mentally ill/disabled"}, {"index": 34, "timeCode": "March 26, 2013, 01:41:54 PM", "reply": -1, "user": "80a54", "content": "Maybe they could also get coupons or cards allowing them to get a discounted visit to the doctor, or see a specialist.", "contentSimp": "coupons cards allowing discounted visit doctor, specialist."}, {"index": 35, "timeCode": "March 26, 2013, 01:44:29 PM", "reply": -1, "user": "80a54", "content": "True, so they won't be wasting money on false diagnoses. This would also make the system more reliable to the public, knowing that doctors have to stay current with the diseases and their symptoms.", "contentSimp": "true, won't wasting money false diagnoses. make system reliable public, knowing doctors stay current diseases symptoms."}, {"index": 36, "timeCode": "March 28, 2013, 11:47:58 AM", "reply": -1, "user": "56a55", "content": "The healthcare system must be changed in some features: The healthcare cost must be reduced as much as it is to help the low income or unemployed people or family to afford. OBAMA Care should be forced to bring the best health care services to everybody regardless their ability to pay for the Hospital bill In the education system, the doctors, specialists, or practitioners should be deep educated and good trained as well to give the best service to the patient and their family and I think this part is Okay. In order to save time and money, medical technology should be given and improve to give the best health care service for patients. For example, like we can use the robots instead of doctors to do an surgery, or using new invented radiology scanner to reduce the radio way, UV ray, ultrasound wave, etc. Everybody should be given the equal health care services as the cost should be low like in Canada, or Australia. Insurance, as in Obama Care that all people must obtain it regardless they never get sick. Although it may affect to the health service, but people will have more option in taking care their health more efficiency. Moreover, the education should teach all the doctors, physicians, specialist, nurses, or any people who work in the healthcare that the patient health is the most important than anything else, instead of taking their insurance or making a fast diagnostic. And I am looking for this aspect because as I see, there is not many doctors, physician, specialists, or nurses pay attention to this particular topic. Medicine should be lowered in price as in the generic medication that everybody can afford to buy though they have insurance or not. And this may help people more taking care for their health. Lastly, maintaining a good health is the best way to make we live better and we don't need to get the healthcare services every time we get sick unless we are getting old and need people to take care.", "contentSimp": "healthcare system changed features: healthcare cost reduced low income unemployed people family afford. obama care forced bring health care services ability pay hospital bill education system, doctors, specialists, practitioners deep educated good trained give service patient family part okay. order save time money, medical technology improve give health care service patients. example, robots doctors surgery, invented radiology scanner reduce radio way, uv ray, ultrasound wave, etc. equal health care services cost low canada, australia. insurance, obama care people obtain sick. affect health service, people option taking care health efficiency. moreover, education teach doctors, physicians, specialist, nurses, people work healthcare patient health important else, taking insurance making fast diagnostic. aspect see, doctors, physician, specialists, nurses pay attention topic. medicine lowered price generic medication afford buy insurance not. people taking care health. lastly, maintaining good health make live don't healthcare services time sick people care."}, {"index": 37, "timeCode": "March 28, 2013, 11:52:09 AM", "reply": -1, "user": "56a55", "content": "i agree because the women needs to be treated fairly as men and other aspects like age, gender, sexuality, education, family background, etc.", "contentSimp": "agree women treated fairly men aspects age, gender, sexuality, education, family background, etc."}, {"index": 38, "timeCode": "March 28, 2013, 11:53:34 AM", "reply": 16, "user": "56a55", "content": "I think the generic should be get off to let the main one reduce in cost", "contentSimp": "generic main reduce cost"}, {"index": 39, "timeCode": "April 01, 2013, 03:09:22 PM", "reply": -1, "user": "8a52", "content": "This would reduce the cost of the prescribed drug then people would be able to afford it as well as have the oppurtunity to actually buy the medication that they need to take on a regular basis.", "contentSimp": "reduce cost prescribed drug people afford oppurtunity buy medication regular basis."}, {"index": 40, "timeCode": "April 01, 2013, 03:11:00 PM", "reply": -1, "user": "8a52", "content": "More clinics similar to Care-Now should be open but they should have family medicine doctors there so that misdiagnosing will be less likely to occur and the prescribing of drugs will be less likely to happen", "contentSimp": "clinics similar care-now open family medicine doctors misdiagnosing occur prescribing drugs happen"}, {"index": 41, "timeCode": "April 01, 2013, 03:13:52 PM", "reply": -1, "user": "8a52", "content": "Physicians should be monitored on what and how much they are prescribing to their patients because this may crack down on them getting certain drugs for promotional purposes and receiving things from the drug companies that they would normally not get if they were not prescribing these drugs. It is all about the money in these cases so some doctors really are not considered with their patients health.", "contentSimp": "physicians monitored prescribing patients crack drugs promotional purposes receiving things drug companies prescribing drugs. money cases doctors considered patients health."}, {"index": 42, "timeCode": "April 01, 2013, 03:16:46 PM", "reply": -1, "user": "8a52", "content": "Less immunizations might help people to actually be able to fight off some of these diseases that they are trying to prevent from coming back since new ones are introduced all the time.", "contentSimp": "immunizations people fight diseases prevent coming back introduced time."}, {"index": 43, "timeCode": "April 01, 2013, 03:17:41 PM", "reply": -1, "user": "8a52", "content": "More studies should go into looking at the patterns and trends of certain outbreaks globally and try to figure out a way to prevent them from continuously spreading.", "contentSimp": "studies patterns trends outbreaks globally figure prevent continuously spreading."}, {"index": 44, "timeCode": "April 01, 2013, 03:20:07 PM", "reply": -1, "user": "8a52", "content": "HIV/AIDS patients should get coupons on their medications and also have an affordable specialized doctor to visit for regular check-ups. Also, they can be used for the process of trying to find a cure for the disease.", "contentSimp": "hiv/aids patients coupons medications affordable specialized doctor visit regular check-ups. also, process find cure disease."}, {"index": 45, "timeCode": "April 01, 2013, 03:21:33 PM", "reply": -1, "user": "8a52", "content": "More restrictions should be placed on receiving Medicaid so that people who are lazy and really just want to rely on the government for help will be less likely to get it.", "contentSimp": "restrictions receiving medicaid people lazy rely government it."}, {"index": 46, "timeCode": "April 01, 2013, 03:25:04 PM", "reply": -1, "user": "88a51", "content": "There should be more pharmacy with a local doctor or physician to conveniently get your medication and check-up at the same time", "contentSimp": "pharmacy local doctor physician conveniently medication check-up time"}, {"index": 47, "timeCode": "April 02, 2013, 11:20:30 AM", "reply": -1, "user": "56a55", "content": "Another thing, I would like to mention from the previous post, they are: To the Disable people, HIV/AIDS patients, etc. serious diseases, they must to be treated fairly and appropriate to the normal people, or may be better than those because they are even weaker and depress for along time may be the whole life even with mental, physical, or social health. To the LGBT community, they also needs to be treated equally to other people regardless race, age, background, etc. And this is the task of the health care providers who are responsible in providing them the best quality health service. People who is in the Nursing home would be suffered so many problems and can't get away from aging, so they need to have a good care even about mental, physical, and social health treatment to make them enjoy the rest of life. It should be more health care show or programs as many health issue commercials to everyone to make an announcement or warning about any thing related to health like overdosing, street drug, eating habitat, passive life style, unhealthy behaviors,smoking, drinking, STDs, HIV thread, etc. There are now many and many case of rape related in the healthcare system, so it needs to pass a law or some restriction rules to reduce this issue as guaranteed the good working environment to all healthcare employees.", "contentSimp": "thing, mention previous post, are: disable people, hiv/aids patients, etc. diseases, treated fairly normal people, weaker depress time life mental, physical, social health. lgbt community, treated equally people race, age, background, etc. task health care providers responsible providing quality health service. people nursing home suffered problems can't aging, good care mental, physical, social health treatment make enjoy rest life. health care show programs health issue commercials make announcement warning thing related health overdosing, street drug, eating habitat, passive life style, unhealthy behaviors,smoking, drinking, stds, hiv thread, etc. case rape related healthcare system, pass law restriction rules reduce issue guaranteed good working environment healthcare employees."}, {"index": 48, "timeCode": "April 02, 2013, 11:25:30 AM", "reply": -1, "user": "56a55", "content": "Yes, but not all people are like what you say. As I know there are so many people who are very lazy and dependence, but there are also people who get really sick and serious illness that they can not afford by themselves to pay for the medication as well as other health issues", "contentSimp": "yes, people say. people lazy dependence, people sick illness afford pay medication health issues"}, {"index": 49, "timeCode": "April 02, 2013, 11:26:32 AM", "reply": 46, "user": "56a55", "content": "I agree with you, it needs to have more to get the better health service and even though saving time and money.", "contentSimp": "agree you, health service saving time money."}, {"index": 50, "timeCode": "April 02, 2013, 12:37:52 PM", "reply": 47, "user": "80a54", "content": "I agree. Although healthcare covers most things, these specialized areas shouldn't be neglected, and should also recieve the same ammount of care, if not more, than the amount given in general healthcare.", "contentSimp": "agree. healthcare covers things, specialized areas shouldn't neglected, recieve ammount care, more, amount general healthcare."}, {"index": 51, "timeCode": "April 02, 2013, 12:50:35 PM", "reply": -1, "user": "80a54", "content": " ", "contentSimp": " "}, {"index": 52, "timeCode": "April 08, 2013, 01:10:56 PM", "reply": -1, "user": "8a52", "content": "Regular check ups on physicians should be required to make sure that they still have morals and values and really do care about the patients rather than they're paychecks.", "contentSimp": "regular check ups physicians required make morals values care patients they're paychecks."}, {"index": 53, "timeCode": "April 08, 2013, 01:13:21 PM", "reply": -1, "user": "8a52", "content": "The new technology would also reduce the amount of time that surgery would or regular everyday visits would take. Also with new things coming out there should be seminars for them to be displayed so that the doctors have a chance of purchasing them.", "contentSimp": "technology reduce amount time surgery regular everyday visits take. things coming seminars displayed doctors chance purchasing them."}, {"index": 54, "timeCode": "April 08, 2013, 01:16:37 PM", "reply": -1, "user": "8a52", "content": "Support groups for people that are chronically ill should be provided by the government so that they have a better chance of thriving in life and not just to know that other people suffer but that they can help each other live a healthier lifestyle to try and relieve some pain and maybe even live longer.", "contentSimp": "support groups people chronically provided government chance thriving life people suffer live healthier lifestyle relieve pain live longer."}, {"index": 55, "timeCode": "April 08, 2013, 01:18:18 PM", "reply": -1, "user": "8a52", "content": "If Medicare/Medicaid would crack down on the system and actually administer to the people who need it then taxes would probably go down because the government would not have to put so much money towards the healthcare system.", "contentSimp": "medicare/medicaid crack system administer people taxes government put money healthcare system."}, {"index": 56, "timeCode": "April 08, 2013, 01:20:24 PM", "reply": -1, "user": "8a52", "content": "Assistant living for the elderly should be more affordable so that the nursing homes will not be so crowded, because some elderly people resort to the nursing home since that is all they're insurance will cover.", "contentSimp": "assistant living elderly affordable nursing homes crowded, elderly people resort nursing home they're insurance cover."}, {"index": 57, "timeCode": "April 08, 2013, 01:22:57 PM", "reply": -1, "user": "8a52", "content": "Maintaining a good healthcare system is the key reason so maybe the government should really evaluate this area more than all the other ones.", "contentSimp": "maintaining good healthcare system key reason government evaluate area ones."}, {"index": 58, "timeCode": "April 09, 2013, 11:19:46 AM", "reply": -1, "user": "56a55", "content": "The budget for the healthcare services is reducing. So it needs to be considered to increase that amount of money. If the citizens are healthy, that means the country is also \"healthy\" too. Some new researches in Health science should be encouraged and granted by the governments or other foundations help the young new scientists to find the new methods and better cures for the patients or even a whole healthcare systems. Working hard will Many people are complaining about the healthcare insurance, not Medicare or Medicaid, so, there has to be some social benefits to qualify for those who are not getting enough financial supports for it. There must be some new hospitals build to server enough for the increasing patients where the old one is insufficient and does not well-qualified for the whole service. Any specialists or nurses who violate the policy or rules must be charged based on the scale of what errors they make during the healthcare services as will be a good model for others to obey and minimize the errors from little to zero.", "contentSimp": "budget healthcare services reducing. considered increase amount money. citizens healthy, means country \"healthy\" too. researches health science encouraged granted governments foundations young scientists find methods cures patients healthcare systems. working hard people complaining healthcare insurance, medicare medicaid, so, social benefits qualify financial supports it. hospitals build server increasing patients insufficient well-qualified service. specialists nurses violate policy rules charged based scale errors make healthcare services good model obey minimize errors zero."}, {"index": 59, "timeCode": "April 09, 2013, 11:21:24 AM", "reply": -1, "user": "56a55", "content": "I agree with you. even there are some people who cheat on this to get the free benefits for them.", "contentSimp": "agree you. people cheat free benefits them."}, {"index": 60, "timeCode": "April 09, 2013, 11:23:18 AM", "reply": 56, "user": "56a55", "content": "Healthcare services is such a business where people who are insured will get the best service as they pay for what they receive.", "contentSimp": "healthcare services business people insured service pay receive."}, {"index": 61, "timeCode": "April 09, 2013, 11:25:31 AM", "reply": -1, "user": "56a55", "content": "That would be great! But people are in the way of busy working life so it needs the quick and fast service to serve as many people as it is and done well!", "contentSimp": "great! people busy working life quick fast service serve people well!"}, {"index": 62, "timeCode": "April 09, 2013, 12:08:15 PM", "reply": -1, "user": "80a54", "content": "Yes I agree. In doing so, it would also reduce the funds required for those who don't care as much, for funding should only go to those who actually care.", "contentSimp": "agree. so, reduce funds required don't care much, funding care."}, {"index": 63, "timeCode": "April 09, 2013, 12:11:22 PM", "reply": -1, "user": "80a54", "content": "This method sounds pretty solid in my opinion. The only problem is that sometimes there are more sick people than anticipated, and there isn't enough healthcare to deal with the amount of sickness that is presented.", "contentSimp": "method sounds pretty solid opinion. problem sick people anticipated, isn't healthcare deal amount sickness presented."}, {"index": 64, "timeCode": "April 09, 2013, 12:18:41 PM", "reply": -1, "user": "80a54", "content": "As technology grows more advanced day after day, at some point there is going to be a way to monitor all of those who truly need healthcare. Hopefully people can do all of the necessary things to get the help they need, and get on track to becoming healthier. At this time, there should also be enough medication and staff to deal with those that need healthcare, for without the staff and supplies, healthcare will decrease, and more people will remain sick and die. At the rate technology is evolving, there should already be a system, unfortunately not everyone can be trusted with medication and the help that the staff provides.", "contentSimp": "technology grows advanced day day, point monitor healthcare. people things need, track healthier. time, medication staff deal healthcare, staff supplies, healthcare decrease, people remain sick die. rate technology evolving, system, trusted medication staff provides."}, {"index": 65, "timeCode": "April 09, 2013, 01:37:06 PM", "reply": 30, "user": "36a53", "content": "But it will be very difficult to draw the line of what will fit under \"emergency\" if those visits are free completely. It should probably be at a more reasonable cost instead.", "contentSimp": "difficult draw line fit \"emergency\" visits free completely. reasonable cost instead."}, {"index": 66, "timeCode": "April 09, 2013, 01:45:11 PM", "reply": -1, "user": "36a53", "content": "I think medical research is a big factor in providing adequate healthcare. More funding should be available to researchers to find cures for diseases, new techniques for procedures, new drugs, and ways to prevent illnesses.", "contentSimp": "medical research big factor providing adequate healthcare. funding researchers find cures diseases, techniques procedures, drugs, ways prevent illnesses."}, {"index": 67, "timeCode": "April 09, 2013, 01:53:35 PM", "reply": 46, "user": "36a53", "content": "I don't think that having a pharmacy and physician together will really make that much of a difference. there are more important things than making it \"convenient\" for the patient so they don't have to drive to a pharmacy. I'd rather have a more fit physician and pharmacist instead.", "contentSimp": "don't pharmacy physician make difference. important things making \"convenient\" patient don't drive pharmacy. i'd fit physician pharmacist instead."}, {"index": 68, "timeCode": "April 10, 2013, 01:40:37 PM", "reply": -1, "user": "88a51", "content": "I agree and the more technology advances the more job opportunities for people without jobs leading to less dependent people on healthcare.", "contentSimp": "agree technology advances job opportunities people jobs leading dependent people healthcare."}, {"index": 69, "timeCode": "April 10, 2013, 01:51:34 PM", "reply": 67, "user": "88a51", "content": "I agree on more research towards diseases which is one of the main sources of healthcare because if a cure is discovered then it gives the people who are ill to live healthy lives and get back on their feet.", "contentSimp": "agree research diseases main sources healthcare cure discovered people live healthy lives back feet."}, {"index": 0, "timeCode": "March 29, 2013, 10:27:16 AM", "reply": -1, "user": "22b21", "content": "I think the education of healthcare needs to be improved.", "contentSimp": "education healthcare improved."}, {"index": 1, "timeCode": "March 29, 2013, 10:33:16 AM", "reply": -1, "user": "22b21", "content": "Finance is a zsticky situation. I think the cost of healthcare should equally represent the benefits received, so in some ways the cost should be lowered.", "contentSimp": "finance sticky situation. cost healthcare equally represent benefits received, ways cost lowered."}, {"index": 2, "timeCode": "March 29, 2013, 10:35:12 AM", "reply": -1, "user": "22b21", "content": "Emergency room services need to improve. The hours to wait and the services provided are horrible.", "contentSimp": "emergency room services improve. hours wait services provided horrible."}, {"index": 3, "timeCode": "March 29, 2013, 10:37:13 AM", "reply": 2, "user": "22b21", "content": "Money could be a reason why for both. There should be a better investment for healthcare. No money means no pay which makes for a poor satisfaction and poor care to patients, and not enough people to operate the emergency rooms.", "contentSimp": "money reason both. investment healthcare. money means pay makes poor satisfaction poor care patients, people operate emergency rooms."}, {"index": 4, "timeCode": "March 29, 2013, 10:42:00 AM", "reply": -1, "user": "22b21", "content": "I don't want to see the healthcare system go away. The healthcare system itself is good, but the providers in charge of it need to be changed. I think if you take a group of people who are on the lower economy scale, dependent on healthcare, and have them either advise or run healthcare then maybe it would be in better standing.", "contentSimp": "don't healthcare system away. healthcare system good, providers charge changed. group people lower economy scale, dependent healthcare, advise run healthcare standing."}, {"index": 5, "timeCode": "March 29, 2013, 10:46:47 AM", "reply": -1, "user": "22b21", "content": "In a touchy subject, healthcare has become too political. It's main focus should be the well being of sick, disabled and retired people. But now it's revolved around budget cuts, and as long as money is flowing around it doesn't matter if a veteran is lying on his deathbed because he doesn't have insurance to help him.", "contentSimp": "touchy subject, healthcare political. it's main focus sick, disabled retired people. it's revolved budget cuts, long money flowing doesn't matter veteran lying deathbed doesn't insurance him."}, {"index": 6, "timeCode": "March 29, 2013, 10:53:25 AM", "reply": -1, "user": "22b21", "content": "What if there was healthcare for a range of income? Or is there already? If there isn't then why not have higher income families pay a portion towards healthcare that they can afford, and then lower income families pay a portion that they can afford. It would be healthcare for all in a sense, but all of us would pay a different amount. A reasonable amount. ? :)", "contentSimp": "healthcare range income? already? isn't higher income families pay portion healthcare afford, lower income families pay portion afford. healthcare sense, pay amount. reasonable amount. ? :)"}, {"index": 7, "timeCode": "March 29, 2013, 11:26:12 AM", "reply": -1, "user": "69b22", "content": "I personally believe that healthcare in this country is too expensive and frankly people on a budget do not see it necessary to obtain one. I believe that minor health problems should be free.", "contentSimp": "personally healthcare country expensive frankly people budget obtain one. minor health problems free."}, {"index": 8, "timeCode": "March 29, 2013, 11:29:03 AM", "reply": -1, "user": "69b22", "content": "I have no problem with health insurance, however, I find that people pay unnecessarily for services that they do not need. Meanwhile those who need it cannot afford to pay for health care.", "contentSimp": "problem health insurance, however, find people pay unnecessarily services need. afford pay health care."}, {"index": 9, "timeCode": "March 29, 2013, 11:31:32 AM", "reply": -1, "user": "69b22", "content": "I find that health insurance only covers very little health concerns. Good health is not a guarantee so there should be others ways that people pay for health services.", "contentSimp": "find health insurance covers health concerns. good health guarantee ways people pay health services."}, {"index": 10, "timeCode": "March 29, 2013, 11:34:18 AM", "reply": 0, "user": "69b22", "content": "I don't necessarily think that lack of health care education is a problem I think people who are uninformed remain that way because they cannot afford it.", "contentSimp": "don't necessarily lack health care education problem people uninformed remain afford it."}, {"index": 11, "timeCode": "March 29, 2013, 11:38:05 AM", "reply": -1, "user": "69b22", "content": "There should be a clear distinction between providing healthcare to make a profit and healthcare for the less fortunate", "contentSimp": "clear distinction providing healthcare make profit healthcare fortunate"}, {"index": 12, "timeCode": "March 29, 2013, 11:49:22 AM", "reply": -1, "user": "69b22", "content": "i do not have much knowledge on the health care procedures, i believe that every employer should provide health care for their employees and families. Anyone who is not willing to work should buy health insurance independently and people who are disabled or old should be either on medicare or medicaid.", "contentSimp": "knowledge health care procedures, employer provide health care employees families. work buy health insurance independently people disabled medicare medicaid."}, {"index": 13, "timeCode": "March 29, 2013, 11:53:03 AM", "reply": 11, "user": "69b22", "content": "American people should not be responsible to pay for services that they do not require", "contentSimp": "american people responsible pay services require"}, {"index": 14, "timeCode": "March 29, 2013, 12:20:06 PM", "reply": 10, "user": "49b23", "content": "I agree that the education about the health care system should be improved. I don't think it's a problem because people remain that way because they can't afford it. Yes, some people may choose not to learn more about it, but that's cause they might not feel the need to and that's why they feel less informed when asked about changes/improvements to the healthcare system. For example, young adults who are covered for healthcare by their parent's employers don't feel the need to learn about health care because they don't have to pay for it and it's not a concern for them.", "contentSimp": "agree education health care system improved. don't it's problem people remain can't afford it. yes, people choose learn it, that's feel that's feel informed asked changes/improvements healthcare system. example, young adults covered healthcare parent's employers don't feel learn health care don't pay it's concern them."}, {"index": 15, "timeCode": "March 29, 2013, 12:23:05 PM", "reply": 1, "user": "49b23", "content": "I don't have much knowledge on healthcare or the financing, but this idea seems fair.", "contentSimp": "don't knowledge healthcare financing, idea fair."}, {"index": 16, "timeCode": "March 29, 2013, 12:25:45 PM", "reply": -1, "user": "49b23", "content": "What are the problems with healthcare in America?", "contentSimp": "problems healthcare america?"}, {"index": 17, "timeCode": "March 29, 2013, 12:32:42 PM", "reply": -1, "user": "49b23", "content": "We can look at what other countries are doing and how they are doing it. And while this isn't specifically healthcare-related, we could put more focus on national happiness.", "contentSimp": "countries it. isn't specifically healthcare-related, put focus national happiness."}, {"index": 18, "timeCode": "March 29, 2013, 01:18:43 PM", "reply": 3, "user": "92b24", "content": "emergency rooms are for \"emergencies.\"  a lot of times people go to them because they don't have a pcp, don't have the money for said pcp...so going to the emergency with a minor problem causes backups and long waits for people with more serious emergencies...so we could make pcps more accessible to everyone on all types of income", "contentSimp": "emergency rooms \"emergencies.\"  lot times people don't pcp, don't money pcp...so emergency minor problem backups long waits people emergencies...so make pcps accessible types income"}, {"index": 19, "timeCode": "March 29, 2013, 01:21:35 PM", "reply": 14, "user": "92b24", "content": "maybe educating the \"youth\" about healthcare or healthy habits will get them interested and start wanting to learn more...or at the least, make them aware of how to live \"healthy\" so that they'll be less likely to be obese, reckless, etc.", "contentSimp": "educating \"youth\" healthcare healthy habits interested start wanting learn more...or least, make aware live \"healthy\" they'll obese, reckless, etc."}, {"index": 20, "timeCode": "March 29, 2013, 01:26:32 PM", "reply": -1, "user": "92b24", "content": "i think that most health care professionals try to focus on the sick, disabled, and retired people, but because many people don't have insurances or enough insurance, when they use medical services, those services aren't paid for.  Since they aren't paid for then the drs' nurses' medical profs. have to be mindful of money and services.  ideally money would have no part of receiving medical aide/help, but in reality, someone has to pay for services.  if no one pays, then services are less \"good\" or non-existent", "contentSimp": "health care professionals focus sick, disabled, retired people, people don't insurances insurance, medical services, services aren't paid for.  aren't paid drs' nurses' medical profs. mindful money services.  ideally money part receiving medical aide/help, reality, pay services.  pays, services \"good\" non-existent"}, {"index": 21, "timeCode": "March 29, 2013, 01:33:34 PM", "reply": -1, "user": "92b24", "content": "i dont think that a different outlook or perspective will change health care that much if any.  someone who has less of an income than one who is overly wealthy are still both logical thinking people.  what it comes down to is that healthcare profs. have budgets.  users of health care services have bills.  if bills are paid, then budgets stay the same or increase.  if bills aren't paid, then budgets are lowered.  when budgets are lowered then so are services, treatment quality, staff...it's all connected and eventually plummets because hospitals/healthcare has to pay to people to work. if they can't pay because \"users\" dont pay their bills, then everything goes to crap....make people pay their bills, (either hold them personally reliable if no insurance, hold the insurance if they have it or make people HAVE insurance so that somewhere, someone can get paid and continue to work.  ", "contentSimp": "outlook perspective change health care any.  income overly wealthy logical thinking people.  healthcare profs. budgets.  users health care services bills.  bills paid, budgets stay increase.  bills aren't paid, budgets lowered.  budgets lowered services, treatment quality, staff...it's connected eventually plummets hospitals/healthcare pay people work. can't pay \"users\" pay bills, crap....make people pay bills, (either hold personally reliable insurance, hold insurance make people insurance somewhere, paid continue work.  "}, {"index": 22, "timeCode": "March 29, 2013, 01:41:38 PM", "reply": 13, "user": "92b24", "content": "i dont think that when you insurance that you are paying for services that you wont use.  just like car insur. you buy it because if ever you need it, it will be there.  you are paying for reassurance/stability/future help; not for something you wont need or ever use.  same with healthcare and insurance.  every should PAY SOMETHING just to be prepared.  make a separate item/deduction/tax on our paychecks so that we pay a little more to be safe.  and for people who can't afford to pay/dont work because sick/old/disabled, then either put into place more restrictions/people to monitor EFFECTIVELY there status for not working by way of sick/old/disabled to make sure that if anything changes, i.e. they become able-bodied, then the get to work to help out the others/pay it forward..", "contentSimp": "insurance paying services use.  car insur. buy it, there.  paying reassurance/stability/future help; use.  healthcare insurance.  pay prepared.  make separate item/deduction/tax paychecks pay safe.  people can't afford pay/dont work sick/old/disabled, put place restrictions/people monitor effectively status working sick/old/disabled make changes, i.e. able-bodied, work others/pay forward.."}, {"index": 23, "timeCode": "March 29, 2013, 01:44:18 PM", "reply": -1, "user": "92b24", "content": "i dont think that another country's plan will necessarily work for the U.S.  every country is different; maybe they start their youlth/middle aged/elderly off on different tracks/have different ideologies that are DIFFERENT from the U.S.;  find what works here then do it.  and if that means trying out a dozen different things before we get that lucky 13th, then thats what we should do. ", "contentSimp": "country's plan necessarily work u.s.  country different; start youlth/middle aged/elderly tracks/have ideologies u.s.;  find works it.  means dozen things lucky 13th, do. "}, {"index": 24, "timeCode": "March 29, 2013, 01:46:15 PM", "reply": -1, "user": "92b24", "content": "take out health care altogether and only have independent drs.  then let people use \"private pay\" to do what they need to.  if some can't afford it, then they can't afford it..", "contentSimp": "health care altogether independent drs.  people \"private pay\" to.  can't afford it, can't afford it.."}, {"index": 25, "timeCode": "March 29, 2013, 02:33:08 PM", "reply": -1, "user": "2b25", "content": "A lot of you are concerned with cost, which yes I agree is a problem a lot of people who need medical care cannot afford it and may go into debt after seeking medical treatment. Sometimes it's hard to understand that medial care cost as much as it does because the equipment and medicines are very expensive. Medical technology is hard to keep up with and most facilities can't afford to get the things they need. If we did more research on finding cheaper more efficient ways to develop medical technology there would be a trickle down affect with cost.   ", "contentSimp": "lot concerned cost, agree problem lot people medical care afford debt seeking medical treatment. it's hard understand medial care cost equipment medicines expensive. medical technology hard facilities can't afford things need. research finding cheaper efficient ways develop medical technology trickle affect cost.   "}, {"index": 26, "timeCode": "March 29, 2013, 02:39:52 PM", "reply": 0, "user": "2b25", "content": "By law most people (ages 5-18) are required to go to school a certain number of days a year. We could have more programs in schools that inform students on healthcare and other health related issues. It is required to take an American government course to graduate most high schools and colleges, why not a course on the American healthcare system?", "contentSimp": "law people (ages 5-18) required school number days year. programs schools inform students healthcare health related issues. required american government graduate high schools colleges, american healthcare system?"}, {"index": 27, "timeCode": "March 29, 2013, 02:45:47 PM", "reply": 24, "user": "2b25", "content": "This isn't really fair, and most doctors aren't able to run practice independently without governmental assistance. What if the doctors were more in charge of their own practice and were able to work out payment plans and negotiate without governmental interference. A good majority of the decisions doctors make are influenced by insurance companies and the government.  ", "contentSimp": "isn't fair, doctors aren't run practice independently governmental assistance. doctors charge practice work payment plans negotiate governmental interference. good majority decisions doctors make influenced insurance companies government.  "}, {"index": 28, "timeCode": "March 29, 2013, 02:52:43 PM", "reply": -1, "user": "2b25", "content": "Denmark is happiest country in the world; meaning Denmark has the happiest citizens. They have free healthcare, absolutely free regardless of who you are no questions asked. They also have a 15% tax rate meaning 15% of their money goes to the government. Is the trade off worth it and will people be willing to make that sacrifice?", "contentSimp": "denmark happiest country world; meaning denmark happiest citizens. free healthcare, absolutely free questions asked. 15% tax rate meaning 15% money government. trade worth people make sacrifice?"}, {"index": 29, "timeCode": "April 05, 2013, 10:10:20 AM", "reply": -1, "user": "22b21", "content": "I agree! Even I don't know everything about the healthcare system, and my family lives off of it. Eventually the youth is going to be in charge, so we need to know about how to run it.", "contentSimp": "agree! don't healthcare system, family lives it. eventually youth charge, run it."}, {"index": 30, "timeCode": "April 05, 2013, 10:16:03 AM", "reply": 21, "user": "22b21", "content": "okay I see where you are coming from, but how do we get people to pay? Some people are just skimming the ice making what they can for their families, so they feel the need that some bills don't need to be paid. We can't just force them, or can we??", "contentSimp": "coming from, people pay? people skimming ice making families, feel bills don't paid. can't force them, we??"}, {"index": 31, "timeCode": "April 05, 2013, 10:22:06 AM", "reply": -1, "user": "22b21", "content": "I honestly don't know anymore. My ideas now are coming from a futuristic book I've read once where everyone was split into districts and they produced what they could in that area. Maybe we could do the same, but instead we'd be split based on income and needs. We pay for what we can afford, and we receive what we put effort into...I know it's sketchy though because some of us deserve more than what we work now based on previous efforts, so maybe we can accommodate that too...???", "contentSimp": "honestly don't anymore. ideas coming futuristic book i've read split districts produced area. same, we'd split based income needs. pay afford, receive put effort into...i it's sketchy deserve work based previous efforts, accommodate too...???"}, {"index": 32, "timeCode": "April 05, 2013, 10:25:46 AM", "reply": -1, "user": "22b21", "content": "I agree, but we need to be cautious about how many systems we adopt because eventually we might burn out and people won't be happy if we continue to constantly change our system...?", "contentSimp": "agree, cautious systems adopt eventually burn people won't happy continue constantly change system...?"}, {"index": 33, "timeCode": "April 05, 2013, 12:06:48 PM", "reply": -1, "user": "69b22", "content": "mental health care should be easily accessible because it is one of the main causes of destruction and violence in America. I mean, a number of people cannot afford to obtain this kind of health care and as such they are forced to suffer in silence.", "contentSimp": "mental health care easily accessible main destruction violence america. mean, number people afford obtain kind health care forced suffer silence."}, {"index": 34, "timeCode": "April 05, 2013, 12:09:03 PM", "reply": -1, "user": "69b22", "content": "there is a definite need for more doctors, i believe this is a problem because a lot of dedicated doctors took a heavy loan and spend a long time paying off their dept that it is not encouraging for high school students to even consider that path, its just too much dept and too long", "contentSimp": "definite doctors, problem lot dedicated doctors heavy loan spend long time paying dept encouraging high school students path, dept long"}, {"index": 35, "timeCode": "April 05, 2013, 12:11:58 PM", "reply": 30, "user": "92b24", "content": "\"Force\" is a harsh word, but yes, I think that people who don't have healthcare or don't pay/have the means to pay their bills should be forced.  Single/divorced parents ask the courts to have the other parent pay; the other parent's wages are garnished; the petitioner get his/her owed child support.  The same could/should be done with society and medical bills.  A family may just be skimming by with their most/more important bills, but $5 or $10 a month will, eventually, get their bills paid and will help cover the costs that they use.  Over time, the health profs., drs., nurses, etc. will have more funding available and so we can stop the decline in health care and begin with an incline. ", "contentSimp": "\"force\" harsh word, yes, people don't healthcare don't pay/have means pay bills forced.  single/divorced parents courts parent pay; parent's wages garnished; petitioner his/her owed child support.  could/should society medical bills.  family skimming most/more important bills, $5 $10 month will, eventually, bills paid cover costs use.  time, health profs., drs., nurses, etc. funding stop decline health care begin incline. "}, {"index": 36, "timeCode": "April 05, 2013, 12:12:31 PM", "reply": -1, "user": "69b22", "content": "I have never actually been to an emergency room, but I have been told that it just is not worth it. Apparently, the queue is too long and forms take too long to fill but, most importantly it just cost way too much.", "contentSimp": "emergency room, told worth it. apparently, queue long forms long fill but, importantly cost much."}, {"index": 37, "timeCode": "April 05, 2013, 12:13:48 PM", "reply": 28, "user": "49b23", "content": "That's a good question- will people of the US be willing to pay the tax rate that will enormously help provide free healthcare for all citizens?", "contentSimp": "that's good question- people pay tax rate enormously provide free healthcare citizens?"}, {"index": 38, "timeCode": "April 05, 2013, 12:16:44 PM", "reply": 32, "user": "92b24", "content": "I agree with being cautious.  But, as a whole/as a country, with one change in how health care works, we've seen society go crazy.  With any change, there will be people who get mad, but I think that if we work, regardless of people burnout/get angry, towards a \"good\" system that benefits all Americans to some sort of extent, then we as a whole will be able to over look the trouble it took us to get there.  Other countries didn't just invent/put into place a \"good\" working health care system overnight; it took time to develop and implement it.   ", "contentSimp": "agree cautious.  but, whole/as country, change health care works, we've society crazy.  change, people mad, work, people burnout/get angry, \"good\" system benefits americans sort extent, trouble there.  countries didn't invent/put place \"good\" working health care system overnight; time develop implement it.   "}, {"index": 39, "timeCode": "April 05, 2013, 12:19:04 PM", "reply": 38, "user": "69b22", "content": "there is too much of a conflict in this country about healthcare in as much as it would be a fantastic thing to have a free healthcare system in this country i still believe that this would not solve the problem...there would still be some very unhappy chaps in America", "contentSimp": "conflict country healthcare fantastic thing free healthcare system country solve problem...there unhappy chaps america"}, {"index": 40, "timeCode": "April 05, 2013, 12:22:39 PM", "reply": -1, "user": "69b22", "content": "forcing them is not the issue, i believe it is the role of the government to make them understand that healthcare bills are the ones worth paying", "contentSimp": "forcing issue, role government make understand healthcare bills worth paying"}, {"index": 41, "timeCode": "April 05, 2013, 12:22:44 PM", "reply": 37, "user": "92b24", "content": "  To be honest, 15% is probably the median when it comes to healthcare costs at the moment.  We pay about $200/month for our family's insurance and that is about the same percentage in how much my wife brings in/month.  If everyone has to pay a higher tax rate, I would be somewhat upset because then I would be paying more a month.  But if we really think about it, with the amount that we pay in taxes and insurance /month, if you have insurance or work, will most likely be the same amount.  For some cheaper (if you have a low paying job), and for some more expensive (if you have a high paying job or multiple incomes).  Yes we would be paying \"more,\" but the quality of health care would go up because they have their money/the funds to adequately treat and prevent and wouldn't have to worry about money. ", "contentSimp": "  honest, 15% median healthcare costs moment.  pay $200/month family's insurance percentage wife brings in/month.  pay higher tax rate, upset paying month.  it, amount pay taxes insurance /month, insurance work, amount.  cheaper (if low paying job), expensive (if high paying job multiple incomes).  paying \"more,\" quality health care money/the funds adequately treat prevent wouldn't worry money. "}, {"index": 42, "timeCode": "April 05, 2013, 12:23:01 PM", "reply": -1, "user": "49b23", "content": "This is a good idea. It's like how students are required to take classes about the American economy and government. Although many are only required to take it for a semester, and I think these two are very important classes. Many students don't learn a lot or retain a lot from these courses, yet the information is vital. It could either be a separate course or integrated into another course mandatory for students, but it's very important for students to learn about the health care system as well as the American economy and government.", "contentSimp": "good idea. it's students required classes american economy government. required semester, important classes. students don't learn lot retain lot courses, information vital. separate integrated mandatory students, it's important students learn health care system american economy government."}, {"index": 43, "timeCode": "April 05, 2013, 12:24:40 PM", "reply": 39, "user": "92b24", "content": "  some would be unhappy, but with time they will get over it, (most of them anyway). ", "contentSimp": "  unhappy, time it, (most anyway). "}, {"index": 44, "timeCode": "April 05, 2013, 12:26:18 PM", "reply": 42, "user": "92b24", "content": "I think that this is a great idea.  Maybe even start it earlier like in elementary.  Have this incorporated into recess or P.E./health class/social studies so that the students grow up with it.", "contentSimp": "great idea.  start earlier elementary.  incorporated recess p.e./health class/social studies students grow it."}, {"index": 45, "timeCode": "April 05, 2013, 12:28:00 PM", "reply": 43, "user": "49b23", "content": "Of course a free healthcare system won't solve everyone's happiness. It would take care of everyone's health, but inevitably there will be people who are unhappy for whatever reason.", "contentSimp": "free healthcare system won't solve everyone's happiness. care everyone's health, inevitably people unhappy reason."}, {"index": 46, "timeCode": "April 05, 2013, 02:19:31 PM", "reply": -1, "user": "2b25", "content": "Why don't people have more control over their health care? People complain about insurance companies, cost of medical care, treatment, everything a person could complain about! If people had more of a say they would feel like they get what they pay for and be more satisfied with the health care system. People like to have control, give patients more rights to decide on what they want. Don't allow insurance companies to make our decisions for us, but then here comes the problem of education... most people don't even know their options... How can we give people more control?", "contentSimp": "don't people control health care? people complain insurance companies, cost medical care, treatment, person complain about! people feel pay satisfied health care system. people control, give patients rights decide want. don't insurance companies make decisions us, problem education... people don't options... give people control?"}, {"index": 47, "timeCode": "April 05, 2013, 02:27:44 PM", "reply": -1, "user": "2b25", "content": "So let's talk about free health care. It sounds fantastic! I would absolutely love to have free health care in the US, but we have never had free health care. Does anyone realize how many jobs would be lost? There would be no more medical insurance companies... Do you realize how many people are employed there? Also the quality of medical care would go down, the general attitude of medical staff would be \"well I'm getting paid anyway.\"", "contentSimp": "let's talk free health care. sounds fantastic! absolutely love free health care us, free health care. realize jobs lost? medical insurance companies... realize people employed there? quality medical care down, general attitude medical staff \"well i'm paid anyway.\""}, {"index": 48, "timeCode": "April 12, 2013, 01:17:00 PM", "reply": -1, "user": "69b22", "content": "The way free health care works in other countries is that people still have insurance in case of very serious cases, however, free healthcare is administered to people to educate them on how to take very good care of their bodies and not attain very contagious diseases. for example the general check-ups and the occasional flu will be treated under the free health care system. But, emergencies will require a valid health insurance. by doing this the price of prescription drugs will be elevated and insurance might be able to cover this; so it will still be necessary to have insurance.", "contentSimp": "free health care works countries people insurance case cases, however, free healthcare administered people educate good care bodies attain contagious diseases. general check-ups occasional flu treated free health care system. but, emergencies require valid health insurance. price prescription drugs elevated insurance cover this; insurance."}, {"index": 49, "timeCode": "April 12, 2013, 01:24:54 PM", "reply": 47, "user": "69b22", "content": "The attitudes of medical healthcare professional is not very different now, a number of doctors and medical practitioners are only interested in the salary, that is why medicare and medicaid fraud are on their highest ever right now. I understand that doctors deserve the pay that they get mainly because they spend so much healthcare plan might work. ", "contentSimp": "attitudes medical healthcare professional now, number doctors medical practitioners interested salary, medicare medicaid fraud highest now. understand doctors deserve pay spend healthcare plan work. "}, {"index": 50, "timeCode": "April 12, 2013, 02:14:21 PM", "reply": 38, "user": "22b21", "content": "So we should most likely take surveys of the opinion of people and what they want to see come of healthcare and then compare it to systems in different nations and then see which system works best. It gives the people what they want (maybe not all) and a chance to change our system.", "contentSimp": "surveys opinion people healthcare compare systems nations system works best. people (maybe all) chance change system."}, {"index": 51, "timeCode": "April 12, 2013, 02:22:52 PM", "reply": -1, "user": "22b21", "content": "It sounds okay, but let's take the flu example. The cost/demand of vaccines will take a toll on payment. We can't cover everyone. However unless you're talking about visits being free then I see a possible idea, but providers won't be happy and will see it pointless to continue their practice if they aren't be paid.", "contentSimp": "sounds okay, let's flu example. cost/demand vaccines toll payment. can't cover everyone. you're talking visits free idea, providers won't happy pointless continue practice aren't paid."}, {"index": 52, "timeCode": "April 12, 2013, 02:28:13 PM", "reply": 33, "user": "22b21", "content": "I agree wholeheartedly, but providers won't see it that way. Mental health is another way for them suck money out of people who need the help and then they want to add medication to the patient adding more costs thus benefiting their own pockets.", "contentSimp": "agree wholeheartedly, providers won't way. mental health suck money people add medication patient adding costs benefiting pockets."}, {"index": 53, "timeCode": "April 12, 2013, 03:37:28 PM", "reply": 44, "user": "49b23", "content": "Yeah, perhaps integrate it into one of the elementary classes, but really focusing on it in high school since this is when students are more likely to understand how the health care system affects them and their lives. I think it's a worthy idea for anyone involved in education to implement.", "contentSimp": "yeah, integrate elementary classes, focusing high school students understand health care system affects lives. it's worthy idea involved education implement."}, {"index": 54, "timeCode": "April 12, 2013, 03:46:15 PM", "reply": 50, "user": "49b23", "content": "I definitely agree that it's something happens overtime, and it'll be a lot of time, but the objective is to work towards a better system for America. It's unfortunate that the problem is largely due to many people involved in health care wanting more money.", "contentSimp": "agree it's overtime, it'll lot time, objective work system america. it's unfortunate problem largely due people involved health care wanting money."}, {"index": 56, "timeCode": "April 15, 2013, 12:25:02 PM", "reply": 54, "user": "92b24", "content": "I agree that part of \"the problem\" is many people want money; the other part is people wanting to be paid for services rendered.  There needs to be a system in place that allows for med. staff to receive payment, and to force the \"patients\" to pay for their usage...", "contentSimp": "agree part \"the problem\" people money; part people wanting paid services rendered.  system place med. staff receive payment, force \"patients\" pay usage..."}, {"index": 57, "timeCode": "April 15, 2013, 12:29:08 PM", "reply": 52, "user": "92b24", "content": "The majority of these posts on here are concerned with how the Drs are money hungry or uncaring about patient; self-centered.  Yes, that is a problem but it also the patients.  I think that drs are honestly concerned and want to help each patient with all they can.  Nowadays, it seems that the patients are misusing the healthcare system, too.  I see so many students in the library using addy or sharing it without any real need of it...my point is that the problem isn't just with those working in the medical industry, but with everyone involved, on both sides. ", "contentSimp": "majority posts concerned drs money hungry uncaring patient; self-centered.  yes, problem patients.  drs honestly concerned patient can.  nowadays, patients misusing healthcare system, too.  students library addy sharing real it...my point problem isn't working medical industry, involved, sides. "}, {"index": 58, "timeCode": "April 15, 2013, 12:32:45 PM", "reply": 47, "user": "92b24", "content": "I disagree.  There will still be med. insurance companies because \"free healthcare\" equates to free checkups, minor things, shots, and education.  It doesn't mean that the government will foot the bill for everything; people will still need insurance or private pay for those costly treatments that aren't \"basic.\"  Also, I think that better health for our 375+million citizens is/will be more of a top priority that the 25+million people who work in insurance...", "contentSimp": "disagree.  med. insurance companies \"free healthcare\" equates free checkups, minor things, shots, education.  doesn't government foot bill everything; people insurance private pay costly treatments aren't \"basic.\"  also, health 375+million citizens is/will top priority 25+million people work insurance..."}, {"index": 59, "timeCode": "April 15, 2013, 02:25:11 PM", "reply": -1, "user": "2b25", "content": "We would be taxed that taxed money goes to the government to distribute to medical facilities. Doctors ALWAYS get paid regardless of what it cost the patient. For example My co-pay is $10 per doctor visit... but the doctor gets $150 per visit. Even if it's free like at community clinics they get paid by the government. This is excluding volunteers of course.", "contentSimp": "taxed taxed money government distribute medical facilities. doctors paid cost patient. co-pay $10 doctor visit... doctor $150 visit. it's free community clinics paid government. excluding volunteers course."}, {"index": 60, "timeCode": "April 15, 2013, 02:32:37 PM", "reply": -1, "user": "2b25", "content": " Yes some doctors may be \"money hungry\" but you have to remember they have to have some kind of compassion to do their job. Even if they don't medical school is hard, and they managed to get through it. There seems to be the misconception that Doctors get paid by treatment... It doesn't work that way. It's not like the more test they order the more they get paid. They get paid based on how much revenue they bring in. The price of a lot those tests and treatments is fairly high. So they don't bring in even half the cost of the treatment.", "contentSimp": " yes doctors \"money hungry\" remember kind compassion job. don't medical school hard, managed it. misconception doctors paid treatment... doesn't work way. it's test order paid. paid based revenue bring in. price lot tests treatments fairly high. don't bring half cost treatment."}]