[
    {
        "index": 0,
        "timeCode": "April 03, 2013, 09:23:30 AM",
        "reply": -1,
        "user": "2hj61",
        "content": "Our health care system must provide coverage to all people. It currently lacks the ability to do so.",
        "contentSimp": "health care system provide coverage people. lacks ability so."
    },
    {
        "index": 1,
        "timeCode": "April 03, 2013, 09:25:37 AM",
        "reply": -1,
        "user": "2hj61",
        "content": "The health care system must be affordable to all its users.",
        "contentSimp": "health care system affordable users."
    },
    {
        "index": 2,
        "timeCode": "April 03, 2013, 09:34:03 AM",
        "reply": -1,
        "user": "2hj61",
        "content": "Emergency rooms should have the ability to attend all of its patients in a fast and productive way. It has been from experience that I have seen people wait hours before they are attended.",
        "contentSimp": "emergency rooms ability attend patients fast productive way. experience people wait hours attended."
    },
    {
        "index": 3,
        "timeCode": "April 03, 2013, 09:42:07 AM",
        "reply": 1,
        "user": "2hj61",
        "content": "A possible way to make insurance more affordable is by having regulation over private insurance companies. Prices and coverage should be fair and regulated. This way it can prevent companies putting profits before their people.",
        "contentSimp": "make insurance affordable regulation private insurance companies. prices coverage fair regulated. prevent companies putting profits people."
    },
    {
        "index": 4,
        "timeCode": "April 03, 2013, 09:45:42 AM",
        "reply": -1,
        "user": "2hj61",
        "content": "Health insurance to our elderly should be guaranteed.",
        "contentSimp": "health insurance elderly guaranteed."
    },
    {
        "index": 5,
        "timeCode": "April 03, 2013, 09:50:55 AM",
        "reply": 4,
        "user": "2hj61",
        "content": "Their has been many cases where elderly have been miss treated our abused by their care keepers or even relatives. The people taking care of the elderly should be completely trained. Not only that, but the elderly should have an easy way of reporting these kinds of abuses. ",
        "contentSimp": "cases elderly miss treated abused care keepers relatives. people taking care elderly completely trained. that, elderly easy reporting kinds abuses. "
    },
    {
        "index": 6,
        "timeCode": "April 03, 2013, 10:26:14 AM",
        "reply": -1,
        "user": "8hj62",
        "content": "Emergency room visit it took 3 hours before being seen. They need to have faster service. It is called an emergency room for a reason.",
        "contentSimp": "emergency room visit 3 hours seen. faster service. called emergency room reason."
    },
    {
        "index": 7,
        "timeCode": "April 03, 2013, 10:28:29 AM",
        "reply": -1,
        "user": "8hj62",
        "content": "Technology needs to be updated as quickly as possible it also needs to be ready at hand. Maybe each nurse can have a handheld device with the the notes instead of a chart that can be misplaced.",
        "contentSimp": "technology updated quickly ready hand. nurse handheld device notes chart misplaced."
    },
    {
        "index": 8,
        "timeCode": "April 03, 2013, 10:30:34 AM",
        "reply": -1,
        "user": "8hj62",
        "content": "high schools should have like a life prep class about the things you encounter including life insurance. Kids come out of high school not knowing how to handle these situations",
        "contentSimp": "high schools life prep class things encounter including life insurance. kids high school knowing handle situations"
    },
    {
        "index": 9,
        "timeCode": "April 03, 2013, 10:34:24 AM",
        "reply": -1,
        "user": "8hj62",
        "content": "Certain labs and tests are too expensive for some people there need to be fairly equivalent alternatives for those who can't afford those labs and tests",
        "contentSimp": "labs tests expensive people fairly equivalent alternatives can't afford labs tests"
    },
    {
        "index": 10,
        "timeCode": "April 03, 2013, 10:37:54 AM",
        "reply": -1,
        "user": "8hj62",
        "content": "I think long-term care such as nursing homes for the elderly is a good thing is most cases. As long as the health care providers take caution and know how to care for them. Being in a social environment is a good thing for those people in them.",
        "contentSimp": "long-term care nursing homes elderly good thing cases. long health care providers caution care them. social environment good thing people them."
    },
    {
        "index": 11,
        "timeCode": "April 03, 2013, 10:39:02 AM",
        "reply": -1,
        "user": "8hj62",
        "content": "Doctors should advise you which daily vitamins you should be taking to go along with the preventive care",
        "contentSimp": "doctors advise daily vitamins taking preventive care"
    },
    {
        "index": 12,
        "timeCode": "April 03, 2013, 10:43:27 AM",
        "reply": -1,
        "user": "8hj62",
        "content": "In the emergency room there are too many people that come in and ask the same initial questions over and over when they could have spent less time asking those multiple times and looked at your chart or handheld device that could be updated efficiently it would take less time",
        "contentSimp": "emergency room people initial questions spent time multiple times looked chart handheld device updated efficiently time"
    },
    {
        "index": 13,
        "timeCode": "April 03, 2013, 10:47:32 AM",
        "reply": -1,
        "user": "8hj62",
        "content": "The front desk staff could communicate for effectively with the patients on wait times and things like that so that they wouldn't get so frustrated with how long they have been sitting there. Maybe keep a screen with the waiting line if there is a more important case then it jumps. Have certain colors that identify which is more serious and needs attention sooner rather than later. I think the main issue about waiting is people want to be in the know about what is going on",
        "contentSimp": "front desk staff communicate effectively patients wait times things wouldn't frustrated long sitting there. screen waiting line important case jumps. colors identify attention sooner later. main issue waiting people"
    },
    {
        "index": 14,
        "timeCode": "April 03, 2013, 10:50:15 AM",
        "reply": -1,
        "user": "8hj62",
        "content": "Hospitals or late night clinics should have a pharmacy that is accessible to the patients so you can get the medicine while you are there for the visit and not have to go the pharmacy after waiting, getting examined, and then waiting to be released.",
        "contentSimp": "hospitals late night clinics pharmacy accessible patients medicine visit pharmacy waiting, examined, waiting released."
    },
    {
        "index": 15,
        "timeCode": "April 03, 2013, 10:55:03 AM",
        "reply": -1,
        "user": "8hj62",
        "content": "Maybe doctors that have a private practice should be required to spend one night a month in a hospital if we are short on doctors",
        "contentSimp": "doctors private practice required spend night month hospital short doctors"
    },
    {
        "index": 16,
        "timeCode": "April 03, 2013, 11:30:42 AM",
        "reply": -1,
        "user": "96h63",
        "content": "There should be better payment plans in place to encourage people to pay their medical bills.",
        "contentSimp": "payment plans place encourage people pay medical bills."
    },
    {
        "index": 17,
        "timeCode": "April 03, 2013, 11:31:09 AM",
        "reply": -1,
        "user": "96h63",
        "content": "Before being allowed on Medicare or Medicaid, a class on the healthcare system should be required",
        "contentSimp": "allowed medicare medicaid, class healthcare system required"
    },
    {
        "index": 18,
        "timeCode": "April 03, 2013, 11:33:28 AM",
        "reply": -1,
        "user": "96h63",
        "content": "This should be an option towards their accreditation and license approval",
        "contentSimp": "option accreditation license approval"
    },
    {
        "index": 19,
        "timeCode": "April 03, 2013, 11:33:49 AM",
        "reply": -1,
        "user": "96h63",
        "content": "There should be more volunteer opportunities and internship.",
        "contentSimp": "volunteer opportunities internship."
    },
    {
        "index": 20,
        "timeCode": "April 03, 2013, 11:34:54 AM",
        "reply": -1,
        "user": "96h63",
        "content": "Insurance companies should work with individuals better on knowing what their plans provide",
        "contentSimp": "insurance companies work individuals knowing plans provide"
    },
    {
        "index": 21,
        "timeCode": "April 03, 2013, 11:35:46 AM",
        "reply": -1,
        "user": "96h63",
        "content": "Urgent care facilities should not have a general starting visit rate above $100",
        "contentSimp": "urgent care facilities general starting visit rate $100"
    },
    {
        "index": 22,
        "timeCode": "April 03, 2013, 11:36:20 AM",
        "reply": -1,
        "user": "96h63",
        "content": "Medical education should be more affordable for all ages.",
        "contentSimp": "medical education affordable ages."
    },
    {
        "index": 23,
        "timeCode": "April 03, 2013, 11:37:46 AM",
        "reply": -1,
        "user": "96h63",
        "content": "There shouldn't be such a difference in earned income between hospital physicians and private practice physicians",
        "contentSimp": "shouldn't difference earned income hospital physicians private practice physicians"
    },
    {
        "index": 24,
        "timeCode": "April 03, 2013, 11:38:26 AM",
        "reply": -1,
        "user": "96h63",
        "content": "Maybe better access to health care for those who don't have or can't afford medical insurance",
        "contentSimp": "access health care don't can't afford medical insurance"
    },
    {
        "index": 25,
        "timeCode": "April 03, 2013, 11:38:59 AM",
        "reply": -1,
        "user": "96h63",
        "content": "Insurance companies should require a health care class and not just a yearly physical",
        "contentSimp": "insurance companies require health care class yearly physical"
    },
    {
        "index": 26,
        "timeCode": "April 03, 2013, 11:39:39 AM",
        "reply": -1,
        "user": "96h63",
        "content": "If Medicaid or Medicare is going to be denied to someone, other options should be suggested or offered",
        "contentSimp": "medicaid medicare denied someone, options suggested offered"
    },
    {
        "index": 27,
        "timeCode": "April 03, 2013, 11:40:08 AM",
        "reply": -1,
        "user": "96h63",
        "content": "There should be a development of better health care programs for low to middle income families",
        "contentSimp": "development health care programs low middle income families"
    },
    {
        "index": 28,
        "timeCode": "April 03, 2013, 11:41:19 AM",
        "reply": -1,
        "user": "96h63",
        "content": "People with higher education should have better consideration for health care than denial off their income.",
        "contentSimp": "people higher education consideration health care denial income."
    },
    {
        "index": 29,
        "timeCode": "April 03, 2013, 11:42:21 AM",
        "reply": 2,
        "user": "96h63",
        "content": "There should be two groups of nurses on staff, one for life threatening and another for minor injuries",
        "contentSimp": "groups nurses staff, life threatening minor injuries"
    },
    {
        "index": 30,
        "timeCode": "April 03, 2013, 11:43:07 AM",
        "reply": 4,
        "user": "96h63",
        "content": "And should not be limited to an exam or treatment but their prescriptions as well",
        "contentSimp": "limited exam treatment prescriptions"
    },
    {
        "index": 31,
        "timeCode": "April 03, 2013, 11:45:08 AM",
        "reply": 7,
        "user": "96h63",
        "content": "There needs to be better budgets in place and money raising ideas for funding of the technology, rather than denial because funding for technology is not available.",
        "contentSimp": "budgets place money raising ideas funding technology, denial funding technology available."
    },
    {
        "index": 32,
        "timeCode": "April 03, 2013, 11:46:21 AM",
        "reply": -1,
        "user": "96h63",
        "content": "Would have to be HIPPA approved to avoid leaking personal information",
        "contentSimp": "hippa approved avoid leaking personal information"
    },
    {
        "index": 33,
        "timeCode": "April 03, 2013, 11:48:32 AM",
        "reply": -1,
        "user": "96h63",
        "content": "Pharmacies should notify the patient before using an alternative to their prescription. ie using a generic instead of the original",
        "contentSimp": "pharmacies notify patient alternative prescription. generic original"
    },
    {
        "index": 34,
        "timeCode": "April 03, 2013, 11:48:52 AM",
        "reply": -1,
        "user": "96h63",
        "content": "There should be better follow up care instructions and guidelines",
        "contentSimp": "follow care instructions guidelines"
    },
    {
        "index": 35,
        "timeCode": "April 03, 2013, 11:49:56 AM",
        "reply": -1,
        "user": "96h63",
        "content": "long term care facilities should be better accommodated to feel like a home and not a temporary hospital",
        "contentSimp": "long term care facilities accommodated feel home temporary hospital"
    },
    {
        "index": 36,
        "timeCode": "April 03, 2013, 11:50:39 AM",
        "reply": -1,
        "user": "96h63",
        "content": "Hospitals should have more health care information days.",
        "contentSimp": "hospitals health care information days."
    },
    {
        "index": 37,
        "timeCode": "April 03, 2013, 11:51:28 AM",
        "reply": -1,
        "user": "96h63",
        "content": "Hospitals should be required by a federal law program to have up to date check in, check out, and on going care technology.",
        "contentSimp": "hospitals required federal law program date check in, check out, care technology."
    },
    {
        "index": 38,
        "timeCode": "April 03, 2013, 11:52:04 AM",
        "reply": -1,
        "user": "96h63",
        "content": "There should be better identification programs in place there is the ability to differentiate between adult twin medical records.",
        "contentSimp": "identification programs place ability differentiate adult twin medical records."
    },
    {
        "index": 39,
        "timeCode": "April 03, 2013, 11:52:24 AM",
        "reply": -1,
        "user": "96h63",
        "content": "people should have better access to their own medical records.",
        "contentSimp": "people access medical records."
    },
    {
        "index": 40,
        "timeCode": "April 03, 2013, 11:53:04 AM",
        "reply": -1,
        "user": "96h63",
        "content": "Health care providers should be more open minded to patients questions and more prepared to answer.",
        "contentSimp": "health care providers open minded patients questions prepared answer."
    },
    {
        "index": 41,
        "timeCode": "April 03, 2013, 11:54:57 AM",
        "reply": 6,
        "user": "96h63",
        "content": "This would mean there is better rotation programs and more understanding of human ability. A nurse who has 5 patients or more at once is only one person trying to assist one doctor who may be seeing 15 patients at that time.",
        "contentSimp": "rotation programs understanding human ability. nurse 5 patients person assist doctor 15 patients time."
    },
    {
        "index": 42,
        "timeCode": "April 03, 2013, 11:55:25 AM",
        "reply": -1,
        "user": "96h63",
        "content": "Education programs should more state linked than diverse from state to state.",
        "contentSimp": "education programs state linked diverse state state."
    },
    {
        "index": 43,
        "timeCode": "April 03, 2013, 11:57:28 AM",
        "reply": 8,
        "user": "96h63",
        "content": "This is a class that should teach about all aspects of the healthcare system. From insurance, to not qualifying for insurance and other options, preventative care for long term, health care programs to help for any situation",
        "contentSimp": "class teach aspects healthcare system. insurance, qualifying insurance options, preventative care long term, health care programs situation"
    },
    {
        "index": 44,
        "timeCode": "April 03, 2013, 11:59:20 AM",
        "reply": -1,
        "user": "96h63",
        "content": "there should be less restriction on income requirements for state provided healthcare",
        "contentSimp": "restriction income requirements state provided healthcare"
    },
    {
        "index": 45,
        "timeCode": "April 03, 2013, 12:00:07 PM",
        "reply": -1,
        "user": "96h63",
        "content": "A universal health care system should be on back up so when a person checks into a hospital while on vacation, there isn't a stack of paperwork to fill out every time.",
        "contentSimp": "universal health care system back person checks hospital vacation, isn't stack paperwork fill time."
    },
    {
        "index": 46,
        "timeCode": "April 03, 2013, 12:00:42 PM",
        "reply": 38,
        "user": "96h63",
        "content": "the same is for people with the same names",
        "contentSimp": "people names"
    },
    {
        "index": 47,
        "timeCode": "April 03, 2013, 12:24:33 PM",
        "reply": 4,
        "user": "67h64",
        "content": "It must also be affordable to our elders",
        "contentSimp": "affordable elders"
    },
    {
        "index": 48,
        "timeCode": "April 03, 2013, 12:26:03 PM",
        "reply": -1,
        "user": "67h64",
        "content": "There should be more doctors and nurses on duty so the ER functions quicker",
        "contentSimp": "doctors nurses duty er functions quicker"
    },
    {
        "index": 49,
        "timeCode": "April 03, 2013, 12:26:33 PM",
        "reply": -1,
        "user": "67h64",
        "content": "Make more generic brands for medications that are too expensive",
        "contentSimp": "make generic brands medications expensive"
    },
    {
        "index": 50,
        "timeCode": "April 03, 2013, 12:36:03 PM",
        "reply": -1,
        "user": "67h64",
        "content": "Medical schools should offer more scholarships. Most students don't further their career in the medical field due to the fact that it costs too much money",
        "contentSimp": "medical schools offer scholarships. students don't career medical field due fact costs money"
    },
    {
        "index": 51,
        "timeCode": "April 03, 2013, 12:45:38 PM",
        "reply": -1,
        "user": "67h64",
        "content": "Doctors should spend a little more time and advise their patients on preventative care",
        "contentSimp": "doctors spend time advise patients preventative care"
    },
    {
        "index": 52,
        "timeCode": "April 03, 2013, 01:25:24 PM",
        "reply": -1,
        "user": "52h65",
        "content": "price gouging has become a problem with healthcare",
        "contentSimp": "price gouging problem healthcare"
    },
    {
        "index": 53,
        "timeCode": "April 03, 2013, 01:26:16 PM",
        "reply": -1,
        "user": "52h65",
        "content": "doctors only care about the money and not the patients",
        "contentSimp": "doctors care money patients"
    },
    {
        "index": 54,
        "timeCode": "April 03, 2013, 01:26:52 PM",
        "reply": -1,
        "user": "52h65",
        "content": "medications are too expensive",
        "contentSimp": "medications expensive"
    },
    {
        "index": 55,
        "timeCode": "April 03, 2013, 01:31:59 PM",
        "reply": 26,
        "user": "52h65",
        "content": "I agree everyone is not fortunate enough to buy their own insurance",
        "contentSimp": "agree fortunate buy insurance"
    },
    {
        "index": 56,
        "timeCode": "April 03, 2013, 01:39:32 PM",
        "reply": -1,
        "user": "52h65",
        "content": "everyone gets sick the same and  bleed the same therefore healthcare should be affordable for everyone not just the people who can afford it at the time",
        "contentSimp": "sick and  bleed healthcare affordable people afford time"
    },
    {
        "index": 57,
        "timeCode": "April 03, 2013, 01:43:59 PM",
        "reply": -1,
        "user": "52h65",
        "content": "more research needs to happen before  the healthcare system can change",
        "contentSimp": "research happen before  healthcare system change"
    },
    {
        "index": 58,
        "timeCode": "April 03, 2013, 01:48:29 PM",
        "reply": -1,
        "user": "52h65",
        "content": "there should be a time limit on waiting in the Emergency rooms",
        "contentSimp": "time limit waiting emergency rooms"
    },
    {
        "index": 59,
        "timeCode": "April 03, 2013, 01:54:31 PM",
        "reply": -1,
        "user": "52h65",
        "content": "keeping accurate medical records should be mandatory",
        "contentSimp": "keeping accurate medical records mandatory"
    },
    {
        "index": 60,
        "timeCode": "April 10, 2013, 09:12:22 AM",
        "reply": -1,
        "user": "2hj61",
        "content": "It will also help if emergency rooms were completely staffed, some hospitals only have the minimal amount of doctors working during certain times in order to reduce cost.",
        "contentSimp": "emergency rooms completely staffed, hospitals minimal amount doctors working times order reduce cost."
    },
    {
        "index": 61,
        "timeCode": "April 10, 2013, 09:15:37 AM",
        "reply": 16,
        "user": "2hj61",
        "content": "What if people are cant afford to pay? For example a low income family that has a member suffering from cancer, while you could help by providing smaller payments, but the costs are still going to be the same and the family is still going to be in debt.",
        "contentSimp": "people afford pay? low income family member suffering cancer, providing smaller payments, costs family debt."
    },
    {
        "index": 62,
        "timeCode": "April 10, 2013, 09:16:12 AM",
        "reply": 59,
        "user": "8hj62",
        "content": "Anyone can go to a new hospital where they don't have your previous medical records. There needs to be a program that all medical physicians use so that your medical records are accessible no matter where you go",
        "contentSimp": "hospital don't previous medical records. program medical physicians medical records accessible matter"
    },
    {
        "index": 63,
        "timeCode": "April 10, 2013, 09:19:48 AM",
        "reply": 33,
        "user": "8hj62",
        "content": "Having them notify you would just delay the process that much longer",
        "contentSimp": "notify delay process longer"
    },
    {
        "index": 64,
        "timeCode": "April 10, 2013, 09:20:12 AM",
        "reply": 18,
        "user": "2hj61",
        "content": "We could also just better staff the hospital, it`ll be more expensive for the hospital and overwhelming for the doctor if we keep them overnight.",
        "contentSimp": "staff hospital, it`ll expensive hospital overwhelming doctor overnight."
    },
    {
        "index": 65,
        "timeCode": "April 10, 2013, 09:22:39 AM",
        "reply": 32,
        "user": "8hj62",
        "content": "That's why you would have colors to identify which case is more serious and you would use a number system to identify each patient. It would be the same as when they call out your name to take you back to your room",
        "contentSimp": "that's colors identify case number system identify patient. call back room"
    },
    {
        "index": 66,
        "timeCode": "April 10, 2013, 09:23:29 AM",
        "reply": 62,
        "user": "2hj61",
        "content": "This is true, i have probably received 3 of the same shoots because the new hospitals I visited did not have my records. Patients are supposed to keep their own record, but these can be easily lost or misplaced.",
        "contentSimp": "true, received 3 shoots hospitals visited records. patients supposed record, easily lost misplaced."
    },
    {
        "index": 67,
        "timeCode": "April 10, 2013, 09:26:09 AM",
        "reply": -1,
        "user": "8hj62",
        "content": "I think they need to stop cutting back on staff for budget cuts and saving costs but take phone out of offices or go paperless. They need to cut the small things before they cut the major things",
        "contentSimp": "stop cutting back staff budget cuts saving costs phone offices paperless. cut small things cut major things"
    },
    {
        "index": 68,
        "timeCode": "April 10, 2013, 12:02:50 PM",
        "reply": -1,
        "user": "67h64",
        "content": "Hospitals should have more staffs",
        "contentSimp": "hospitals staffs"
    },
    {
        "index": 69,
        "timeCode": "April 10, 2013, 12:03:27 PM",
        "reply": -1,
        "user": "67h64",
        "content": "They also shouldn't assign 10 patients to one nurse",
        "contentSimp": "shouldn't assign 10 patients nurse"
    },
    {
        "index": 70,
        "timeCode": "April 10, 2013, 12:06:15 PM",
        "reply": -1,
        "user": "67h64",
        "content": "there should be alternatives of payment to patients who come from low income families",
        "contentSimp": "alternatives payment patients low income families"
    },
    {
        "index": 71,
        "timeCode": "April 10, 2013, 12:06:37 PM",
        "reply": -1,
        "user": "67h64",
        "content": "improve their installment plans",
        "contentSimp": "improve installment plans"
    },
    {
        "index": 72,
        "timeCode": "April 10, 2013, 12:07:40 PM",
        "reply": -1,
        "user": "67h64",
        "content": "A hospital should have more doctors in the floor so the waiting time isn't as long",
        "contentSimp": "hospital doctors floor waiting time isn't long"
    },
    {
        "index": 73,
        "timeCode": "April 10, 2013, 12:10:08 PM",
        "reply": -1,
        "user": "67h64",
        "content": "Make some generics more affordable. I've had to pay $200 for a generic medication once ",
        "contentSimp": "make generics affordable. i've pay $200 generic medication once "
    },
    {
        "index": 74,
        "timeCode": "April 10, 2013, 12:15:14 PM",
        "reply": -1,
        "user": "67h64",
        "content": "The elderly should have well trained certified care givers in order to be sure that they are not mistreated or abused",
        "contentSimp": "elderly trained certified care givers order mistreated abused"
    },
    {
        "index": 75,
        "timeCode": "April 10, 2013, 12:19:55 PM",
        "reply": -1,
        "user": "67h64",
        "content": "There should be a sharing type system that allows your new doctor to view your medical records from your old doctor",
        "contentSimp": "sharing type system doctor view medical records doctor"
    },
    {
        "index": 76,
        "timeCode": "April 10, 2013, 01:04:37 PM",
        "reply": -1,
        "user": "52h65",
        "content": "they could create a program to train hospital staff like every 3-6 months to make sure they know what they're doing",
        "contentSimp": "create program train hospital staff 3-6 months make they're"
    },
    {
        "index": 77,
        "timeCode": "April 10, 2013, 01:07:13 PM",
        "reply": -1,
        "user": "52h65",
        "content": "we actually have one of the worst healthcare systems but we can improve if everyone can come together to focus on more effective ways to make the system better",
        "contentSimp": "worst healthcare systems improve focus effective ways make system"
    },
    {
        "index": 78,
        "timeCode": "April 10, 2013, 01:08:19 PM",
        "reply": -1,
        "user": "52h65",
        "content": "the health of the patients should be the top priority and not how much money one can make off the pateint",
        "contentSimp": "health patients top priority money make pateint"
    },
    {
        "index": 79,
        "timeCode": "April 10, 2013, 01:10:12 PM",
        "reply": -1,
        "user": "52h65",
        "content": "some people may feel not having insurance is better than actually having insurance these days because of the high cost",
        "contentSimp": "people feel insurance insurance days high cost"
    },
    {
        "index": 80,
        "timeCode": "April 10, 2013, 01:17:33 PM",
        "reply": -1,
        "user": "52h65",
        "content": "all birth control should be free. $50 dollars a month for a college-student or non college student is alot",
        "contentSimp": "birth control free. $50 dollars month college-student college student alot"
    },
    {
        "index": 81,
        "timeCode": "April 10, 2013, 01:19:27 PM",
        "reply": -1,
        "user": "52h65",
        "content": "there should be health classes offered on how to eat right and exercise",
        "contentSimp": "health classes offered eat exercise"
    },
    {
        "index": 82,
        "timeCode": "April 12, 2013, 02:09:31 PM",
        "reply": 50,
        "user": "96h63",
        "content": "Or make better payment options through hospitals to help pay off their schooling.",
        "contentSimp": "make payment options hospitals pay schooling."
    },
    {
        "index": 83,
        "timeCode": "April 12, 2013, 02:11:01 PM",
        "reply": 79,
        "user": "96h63",
        "content": "This is also a problem because not having insurance also means people aren't paying for medical bills that can't be avoided. This creates higher premiums thru the hospitals and insurance companies.",
        "contentSimp": "problem insurance means people aren't paying medical bills can't avoided. creates higher premiums hospitals insurance companies."
    },
    {
        "index": 84,
        "timeCode": "April 12, 2013, 02:11:52 PM",
        "reply": -1,
        "user": "96h63",
        "content": "People who don't have insurance should be able to claim their medical in a more itemized way on their taxes.",
        "contentSimp": "people don't insurance claim medical itemized taxes."
    },
    {
        "index": 85,
        "timeCode": "April 12, 2013, 02:15:39 PM",
        "reply": -1,
        "user": "96h63",
        "content": "Most hospitals and physicians offices are more technologically advanced in being paperless but in order to be fully paperless would mean a reduction in hackers for identity theft and fraud purposes. A lot of hospitals don't cut the small cost because these costs don't add up the way the large budget cuts do. ",
        "contentSimp": "hospitals physicians offices technologically advanced paperless order fully paperless reduction hackers identity theft fraud purposes. lot hospitals don't cut small cost costs don't add large budget cuts do. "
    },
    {
        "index": 86,
        "timeCode": "April 12, 2013, 02:17:17 PM",
        "reply": 68,
        "user": "96h63",
        "content": "That is not always possible with single parents, special needs families, other personal conflicts, and also just lack of properly trained personnel to hire to fill the positions.",
        "contentSimp": "single parents, special families, personal conflicts, lack properly trained personnel hire fill positions."
    },
    {
        "index": 87,
        "timeCode": "April 12, 2013, 02:19:17 PM",
        "reply": 53,
        "user": "96h63",
        "content": "This is not entirely true due to the universal health care system that Obama is putting into place a lot of doctors were forced to enter that program because they do not make enough for their private services to survive.",
        "contentSimp": "true due universal health care system obama putting place lot doctors forced enter program make private services survive."
    },
    {
        "index": 88,
        "timeCode": "April 12, 2013, 02:20:35 PM",
        "reply": -1,
        "user": "96h63",
        "content": "When a patient makes an appointment and then must wait for an hour or more for service that then should reduce their cost for medical expenses. They have other things going on besides sitting in a doctor's office all day. Its wasting their opportunity to earn money while the doctor is taking money.",
        "contentSimp": "patient makes appointment wait hour service reduce cost medical expenses. things sitting doctor's office day. wasting opportunity earn money doctor taking money."
    },
    {
        "index": 89,
        "timeCode": "April 12, 2013, 02:24:55 PM",
        "reply": -1,
        "user": "96h63",
        "content": "There needs to be more focus on teaching about preventative care and motivation for preventative care before problems arise rather than after an incident.",
        "contentSimp": "focus teaching preventative care motivation preventative care problems arise incident."
    },
    {
        "index": 90,
        "timeCode": "April 12, 2013, 02:27:31 PM",
        "reply": -1,
        "user": "96h63",
        "content": "There needs to be more education on testing and cost of testing sexually transmitted infections and diseases.Or even where it can be done if a person doesn't have insurance for testing.",
        "contentSimp": "education testing cost testing sexually transmitted infections diseases.or person doesn't insurance testing."
    },
    {
        "index": 91,
        "timeCode": "April 12, 2013, 02:28:50 PM",
        "reply": -1,
        "user": "96h63",
        "content": "There should be more motivational incentives to help keep people eating healthy and working out regularly to stay in good shape.",
        "contentSimp": "motivational incentives people eating healthy working regularly stay good shape."
    },
    {
        "index": 92,
        "timeCode": "April 17, 2013, 09:52:56 AM",
        "reply": -1,
        "user": "2hj61",
        "content": "maybe a good one would be having a universal system for every hospital where all of the patient`s information is stored and use only that one system or program.",
        "contentSimp": "good universal system hospital patient`s information stored system program."
    },
    {
        "index": 93,
        "timeCode": "April 17, 2013, 09:57:25 AM",
        "reply": -1,
        "user": "2hj61",
        "content": "I don`t believe taking phones out of hospitals or clinics would be a good idea. There is still a considerable amount of people that don`t have access to computers. But i do agree their is small things that should be cut.",
        "contentSimp": "don`t taking phones hospitals clinics good idea. considerable amount people don`t access computers. agree small things cut."
    },
    {
        "index": 94,
        "timeCode": "April 17, 2013, 10:36:00 AM",
        "reply": 76,
        "user": "8hj62",
        "content": "I'm pretty positive they have to do continuing education to keep their license up to date which would be almost the same thing",
        "contentSimp": "i'm pretty positive continuing education license date thing"
    },
    {
        "index": 95,
        "timeCode": "April 17, 2013, 10:36:48 AM",
        "reply": 80,
        "user": "8hj62",
        "content": "Kroger offers two different types of Birth Control that are $9",
        "contentSimp": "kroger offers types birth control $9"
    },
    {
        "index": 96,
        "timeCode": "April 17, 2013, 10:42:06 AM",
        "reply": -1,
        "user": "8hj62",
        "content": "As far a medicine is concerned there is always a different and cheaper option most people just don't take the time nor do they want to spend the effort to figure it out. Most medicine that is more expensive takes less time to take effect and kills whatever you have faster. People can't be so lazy when it comes to stuff like that",
        "contentSimp": "medicine concerned cheaper option people don't time spend effort figure out. medicine expensive takes time effect kills faster. people can't lazy stuff"
    },
    {
        "index": 97,
        "timeCode": "April 17, 2013, 10:44:17 AM",
        "reply": 91,
        "user": "8hj62",
        "content": "How could they keep up with this? And where would the budget come from to be able to pay for those incentives?",
        "contentSimp": "this? budget pay incentives?"
    },
    {
        "index": 98,
        "timeCode": "April 17, 2013, 10:46:11 AM",
        "reply": -1,
        "user": "8hj62",
        "content": "I agree with this 100% but when would we start teaching these types of things to people? I think the younger they are the better because then they don't start making bad habits. Habits are hard to break especially bad ones and if you are waiting till college to start them then it would be next to impossible to do anything about it.",
        "contentSimp": "agree 100% start teaching types things people? younger don't start making bad habits. habits hard break bad waiting till college start impossible it."
    },
    {
        "index": 99,
        "timeCode": "April 17, 2013, 10:48:02 AM",
        "reply": -1,
        "user": "8hj62",
        "content": "I think the main problem with a lot of things is that we don't teach the kids at a younger age. We don't teach them about insurance, medical bills, health preventative care and more and we need to or it may not ever get any better.",
        "contentSimp": "main problem lot things don't teach kids younger age. don't teach insurance, medical bills, health preventative care better."
    },
    {
        "index": 100,
        "timeCode": "April 17, 2013, 10:50:58 AM",
        "reply": 70,
        "user": "8hj62",
        "content": "From personal experience you can just the bare minimum on a medical bill. If you die before the medical bill is taken care of it goes to the next person in the family line. My grandmother paid $5 every month for years before it was passed down to my mom.",
        "contentSimp": "personal experience bare minimum medical bill. die medical bill care person family line. grandmother paid $5 month years passed mom."
    },
    {
        "index": 101,
        "timeCode": "April 17, 2013, 10:53:43 AM",
        "reply": -1,
        "user": "8hj62",
        "content": "Personally I think that people think the rest of the world is out to get them. Just like with the whole not being able to pay your monthly medical bill. You don't have to pay a ton of money on it each month as long as you are paying something.  The world isn't out to get everyone they just need to educate themselves a little better and figure out what all of their options are. Not only do they need educate themselves but the health care system needs to offer better ways for people to educate themselves.",
        "contentSimp": "personally people rest world them. pay monthly medical bill. don't pay ton money month long paying something.  world isn't educate figure options are. educate health care system offer ways people educate themselves."
    },
    {
        "index": 102,
        "timeCode": "April 17, 2013, 10:54:44 AM",
        "reply": -1,
        "user": "8hj62",
        "content": "Not only should nurses and doctors have to pass all of their nursing exams I think they should have to pass a personality test to see what types of patients they should be allowed to work with",
        "contentSimp": "nurses doctors pass nursing exams pass personality test types patients allowed work"
    },
    {
        "index": 103,
        "timeCode": "April 17, 2013, 11:15:32 AM",
        "reply": -1,
        "user": "67h64",
        "content": "kids should be informed and taught about insurance",
        "contentSimp": "kids informed taught insurance"
    },
    {
        "index": 104,
        "timeCode": "April 17, 2013, 11:16:59 AM",
        "reply": -1,
        "user": "67h64",
        "content": "We should take measures on how to lower the percentage of teen pregnancy",
        "contentSimp": "measures lower percentage teen pregnancy"
    },
    {
        "index": 105,
        "timeCode": "April 17, 2013, 11:17:38 AM",
        "reply": -1,
        "user": "67h64",
        "content": "lower the cost of birth control",
        "contentSimp": "lower cost birth control"
    },
    {
        "index": 106,
        "timeCode": "April 17, 2013, 11:19:00 AM",
        "reply": -1,
        "user": "67h64",
        "content": "Everyone should have access to Plan B. Maybe this can reduce the amount of teen pregnancy",
        "contentSimp": "access plan b. reduce amount teen pregnancy"
    },
    {
        "index": 107,
        "timeCode": "April 17, 2013, 11:23:47 AM",
        "reply": -1,
        "user": "67h64",
        "content": "Children should be educated more about health and diets. If they practice a healthy diet at a young age, childhood obesity can be prevented.",
        "contentSimp": "children educated health diets. practice healthy diet young age, childhood obesity prevented."
    },
    {
        "index": 108,
        "timeCode": "April 17, 2013, 11:26:38 AM",
        "reply": -1,
        "user": "67h64",
        "content": "doctors should spend more time with their patients",
        "contentSimp": "doctors spend time patients"
    },
    {
        "index": 109,
        "timeCode": "April 17, 2013, 01:16:49 PM",
        "reply": 107,
        "user": "52h65",
        "content": "I agree this is a great idea",
        "contentSimp": "agree great idea"
    },
    {
        "index": 110,
        "timeCode": "April 17, 2013, 01:18:02 PM",
        "reply": 105,
        "user": "52h65",
        "content": "I also agree with this statement, and it can also be free",
        "contentSimp": "agree statement, free"
    },
    {
        "index": 111,
        "timeCode": "April 17, 2013, 01:19:48 PM",
        "reply": 106,
        "user": "52h65",
        "content": "I agree, kids are engaging in sexual activity alot younger these days",
        "contentSimp": "agree, kids engaging sexual activity alot younger days"
    },
    {
        "index": 112,
        "timeCode": "April 17, 2013, 01:25:57 PM",
        "reply": -1,
        "user": "52h65",
        "content": "I agree, there should be more facilities that provide that option for STI's and etc.",
        "contentSimp": "agree, facilities provide option sti's etc."
    },
    {
        "index": 113,
        "timeCode": "April 17, 2013, 01:32:54 PM",
        "reply": -1,
        "user": "52h65",
        "content": "there should also be some type of over the counter yeast infections pills in case the items on the shelf do not cure the problem",
        "contentSimp": "type counter yeast infections pills case items shelf cure problem"
    },
    {
        "index": 114,
        "timeCode": "April 19, 2013, 02:16:09 PM",
        "reply": -1,
        "user": "96h63",
        "content": "This would be great if you could get the teenagers more involved who are at more risk of it.",
        "contentSimp": "great teenagers involved risk it."
    },
    {
        "index": 115,
        "timeCode": "April 19, 2013, 02:17:23 PM",
        "reply": 111,
        "user": "96h63",
        "content": "That may actually promote more teens to have sex because they know there is a back up in case a pregnancy may happen.",
        "contentSimp": "promote teens sex back case pregnancy happen."
    },
    {
        "index": 116,
        "timeCode": "April 19, 2013, 02:18:27 PM",
        "reply": 109,
        "user": "96h63",
        "content": "This would also be a great way to get more professional athletes involved to help kids understand that the healthy eating isn't a bad thing rather something to go along with the sports.",
        "contentSimp": "great professional athletes involved kids understand healthy eating isn't bad thing sports."
    },
    {
        "index": 117,
        "timeCode": "April 19, 2013, 02:20:10 PM",
        "reply": -1,
        "user": "96h63",
        "content": "Pharmacies should have payments plans in place for those who can't afford medication because they have no insurance.",
        "contentSimp": "pharmacies payments plans place can't afford medication insurance."
    },
    {
        "index": 118,
        "timeCode": "April 19, 2013, 02:21:18 PM",
        "reply": -1,
        "user": "96h63",
        "content": "The community should come together more and rally for more rural clinics to help those who don't live within city limits.",
        "contentSimp": "community rally rural clinics don't live city limits."
    },
    {
        "index": 119,
        "timeCode": "April 19, 2013, 02:21:57 PM",
        "reply": -1,
        "user": "96h63",
        "content": "Medical care such as Care Flight and ambulance care should not be as expensive as the actually hospital visit itself.",
        "contentSimp": "medical care care flight ambulance care expensive hospital visit itself."
    },
    {
        "index": 120,
        "timeCode": "April 19, 2013, 02:23:31 PM",
        "reply": -1,
        "user": "96h63",
        "content": "Bigger cities should have more health fairs, as in maybe 1 every 6 months, in order to help the lower income and or homeless to receive any medical attention they may be denied to income.",
        "contentSimp": "bigger cities health fairs, 1 6 months, order lower income homeless receive medical attention denied income."
    },
    {
        "index": 121,
        "timeCode": "April 19, 2013, 02:27:58 PM",
        "reply": 97,
        "user": "96h63",
        "content": "This is where some of tax dollars need to be going to, not only that but get the students more old school games. Also, get families involved in doing sports together such as family soccer games against other families. Do things that used to go on in the 80's and 90's where schools, churches, and communities came together to do sports and activities together for the bettering of the children.",
        "contentSimp": "tax dollars to, students school games. also, families involved sports family soccer games families. things 80's 90's schools, churches, communities sports activities bettering children."
    },
    {
        "index": 122,
        "timeCode": "April 19, 2013, 02:30:12 PM",
        "reply": 99,
        "user": "96h63",
        "content": "This though may promote more stress on a child. Why do children need to understand at 9 and under about bills? I think this would possibly create more mental health problems for those children though it could also be a good way to keep them on the right path of working hard so they do not struggle like their parents do.",
        "contentSimp": "promote stress child. children understand 9 bills? possibly create mental health problems children good path working hard struggle parents do."
    },
    {
        "index": 123,
        "timeCode": "April 19, 2013, 02:31:22 PM",
        "reply": -1,
        "user": "96h63",
        "content": "The only thing with this is some medical bills show a minimum payment and some months that minimum payment may be money they just don't have.",
        "contentSimp": "thing medical bills show minimum payment months minimum payment money don't have."
    },
    {
        "index": 124,
        "timeCode": "April 19, 2013, 02:32:46 PM",
        "reply": 102,
        "user": "96h63",
        "content": "Unfortunately, a lot of times there are personality tests given to nurses and doctors but in time of crisis how can you say no you can't work with that patient because your personality will clash with theirs when you don't even have the time to evaluate the patient?",
        "contentSimp": "unfortunately, lot times personality tests nurses doctors time crisis can't work patient personality clash don't time evaluate patient?"
    },
    {
        "index": 125,
        "timeCode": "April 19, 2013, 02:35:05 PM",
        "reply": -1,
        "user": "96h63",
        "content": "Hospital waiting rooms and information desk should offer monthly newsletters for the people of the hospital to see more of what is going on with in their hospital, such as new technology, new doctors, and or modification to hospitals policies or areas of the hospital",
        "contentSimp": "hospital waiting rooms information desk offer monthly newsletters people hospital hospital, technology, doctors, modification hospitals policies areas hospital"
    }
]