[
    {
        "index": 0,
        "timeCode": "March 29, 2013, 10:27:26 AM",
        "reply": -1,
        "user": "93c31",
        "content": "Have more research done on mental health",
        "contentSimp": "research mental health"
    },
    {
        "index": 1,
        "timeCode": "March 29, 2013, 10:33:08 AM",
        "reply": -1,
        "user": "93c31",
        "content": "Long term health care should be easily accessible after your senior age",
        "contentSimp": "long term health care easily accessible senior age"
    },
    {
        "index": 2,
        "timeCode": "March 29, 2013, 10:34:31 AM",
        "reply": -1,
        "user": "93c31",
        "content": "Financial support for shelters that deal with the aftermath of domestic violence, those in poverty, etc.",
        "contentSimp": "financial support shelters deal aftermath domestic violence, poverty, etc."
    },
    {
        "index": 3,
        "timeCode": "March 29, 2013, 10:38:39 AM",
        "reply": -1,
        "user": "93c31",
        "content": "All in one insurance",
        "contentSimp": "insurance"
    },
    {
        "index": 4,
        "timeCode": "March 29, 2013, 10:40:38 AM",
        "reply": -1,
        "user": "93c31",
        "content": "What more can we do to help those affected with a mental health disorder",
        "contentSimp": "affected mental health disorder"
    },
    {
        "index": 5,
        "timeCode": "March 29, 2013, 10:42:47 AM",
        "reply": -1,
        "user": "93c31",
        "content": "Pharmaceuticals that can be used for something illegal should be carefully distributed.",
        "contentSimp": "pharmaceuticals illegal carefully distributed."
    },
    {
        "index": 6,
        "timeCode": "March 29, 2013, 10:46:38 AM",
        "reply": -1,
        "user": "93c31",
        "content": "Emergency Room waiting area can make room for a doctor on floor, in case something happens.",
        "contentSimp": "emergency room waiting area make room doctor floor, case happens."
    },
    {
        "index": 7,
        "timeCode": "March 29, 2013, 10:48:37 AM",
        "reply": -1,
        "user": "93c31",
        "content": "Better technology provided in smaller clinics",
        "contentSimp": "technology provided smaller clinics"
    },
    {
        "index": 8,
        "timeCode": "March 29, 2013, 10:52:39 AM",
        "reply": -1,
        "user": "93c31",
        "content": "Start educating children from a younger age then just having a one semester health class in high school.",
        "contentSimp": "start educating children younger age semester health class high school."
    },
    {
        "index": 9,
        "timeCode": "March 29, 2013, 11:25:50 AM",
        "reply": 8,
        "user": "36c32",
        "content": "Maybe starting when kids are in middle school and having not just a powerpoint lesson but instead a discussion on what could be done and how to prevent health risk and becoming pregnant at a young age",
        "contentSimp": "starting kids middle school powerpoint lesson discussion prevent health risk pregnant young age"
    },
    {
        "index": 10,
        "timeCode": "March 29, 2013, 11:28:52 AM",
        "reply": -1,
        "user": "36c32",
        "content": "Instead of having doctors volunteer at the facilities and clinics that except no insurance why not pay doctors for there services still so maybe they will care more about the people they see that can not get insurance",
        "contentSimp": "doctors volunteer facilities clinics insurance pay doctors services care people insurance"
    },
    {
        "index": 11,
        "timeCode": "March 29, 2013, 11:33:09 AM",
        "reply": -1,
        "user": "36c32",
        "content": "Offering people with no insurance more places to go if an emergency occurred",
        "contentSimp": "offering people insurance places emergency occurred"
    },
    {
        "index": 12,
        "timeCode": "March 29, 2013, 11:34:29 AM",
        "reply": -1,
        "user": "36c32",
        "content": "Stop letting health care providers reject you just because you might be in bad health before getting a health care provider",
        "contentSimp": "stop letting health care providers reject bad health health care provider"
    },
    {
        "index": 13,
        "timeCode": "March 29, 2013, 11:34:58 AM",
        "reply": -1,
        "user": "36c32",
        "content": "Educate people on the different types of insurance",
        "contentSimp": "educate people types insurance"
    },
    {
        "index": 14,
        "timeCode": "March 29, 2013, 11:36:45 AM",
        "reply": -1,
        "user": "36c32",
        "content": "The government can set aside funding for research for incurable diseases",
        "contentSimp": "government set funding research incurable diseases"
    },
    {
        "index": 15,
        "timeCode": "March 29, 2013, 11:37:34 AM",
        "reply": -1,
        "user": "36c32",
        "content": "Stop making the wait so long for emergency room patients",
        "contentSimp": "stop making wait long emergency room patients"
    },
    {
        "index": 16,
        "timeCode": "March 29, 2013, 11:39:58 AM",
        "reply": -1,
        "user": "36c32",
        "content": "Having people who have dealt with family members or children with mental health problems educate parents who might have just found out about it",
        "contentSimp": "people dealt family members children mental health problems educate parents found"
    },
    {
        "index": 17,
        "timeCode": "March 29, 2013, 11:41:48 AM",
        "reply": 7,
        "user": "36c32",
        "content": "Having more smaller clinics be able to provide the same technology like bigger clinics",
        "contentSimp": "smaller clinics provide technology bigger clinics"
    },
    {
        "index": 18,
        "timeCode": "March 29, 2013, 11:43:58 AM",
        "reply": -1,
        "user": "36c32",
        "content": "Maybe making medicine cheaper for people who have no insurance",
        "contentSimp": "making medicine cheaper people insurance"
    },
    {
        "index": 19,
        "timeCode": "March 29, 2013, 11:45:11 AM",
        "reply": -1,
        "user": "36c32",
        "content": "Make it to were everybody can afford insurance",
        "contentSimp": "make afford insurance"
    },
    {
        "index": 20,
        "timeCode": "March 29, 2013, 11:48:32 AM",
        "reply": 7,
        "user": "36c32",
        "content": "Have the doctor look at the patients in the emergency room to see if the patient needs to be treated faster than others",
        "contentSimp": "doctor patients emergency room patient treated faster"
    },
    {
        "index": 21,
        "timeCode": "March 29, 2013, 11:50:46 AM",
        "reply": -1,
        "user": "36c32",
        "content": "Get educators for health to go around schools and teach kids and educate kids more if needed ",
        "contentSimp": "educators health schools teach kids educate kids needed "
    },
    {
        "index": 22,
        "timeCode": "March 29, 2013, 11:54:11 AM",
        "reply": -1,
        "user": "36c32",
        "content": "Do not just let the schools offer one aspect on safe sex make them talk about all the options",
        "contentSimp": "schools offer aspect safe sex make talk options"
    },
    {
        "index": 23,
        "timeCode": "March 29, 2013, 12:17:34 PM",
        "reply": -1,
        "user": "31c33",
        "content": "Increase taxes and use that money to provide universal healthcare",
        "contentSimp": "increase taxes money provide universal healthcare"
    },
    {
        "index": 24,
        "timeCode": "March 29, 2013, 12:21:20 PM",
        "reply": 4,
        "user": "31c33",
        "content": "Research ways in detecting people who have a mental disorder early in the stage and treat them right away. This could prevent a lot of tragedies from happening.",
        "contentSimp": "research ways detecting people mental disorder early stage treat away. prevent lot tragedies happening."
    },
    {
        "index": 25,
        "timeCode": "March 29, 2013, 12:26:19 PM",
        "reply": 5,
        "user": "31c33",
        "content": "Strict policies need to be enforced on doctors who prescribe highly addictive drugs to patients. They should have routine check on those patients and make sure they are not using the drugs out of context.",
        "contentSimp": "strict policies enforced doctors prescribe highly addictive drugs patients. routine check patients make drugs context."
    },
    {
        "index": 26,
        "timeCode": "March 29, 2013, 12:30:36 PM",
        "reply": -1,
        "user": "31c33",
        "content": "Develop diagnostic technologies that can detect a patient's illness precisely because a lot of the times doctors do multiple tests on patients that costs thousands of dollars. These tests can sometimes be deemed useless because they don't provide an answer to the problem.",
        "contentSimp": "develop diagnostic technologies detect patient's illness precisely lot times doctors multiple tests patients costs thousands dollars. tests deemed useless don't provide answer problem."
    },
    {
        "index": 27,
        "timeCode": "March 29, 2013, 12:37:26 PM",
        "reply": 23,
        "user": "31c33",
        "content": "Universal healthcare should be provided to only those who pay their taxes. As for the people who don't, there should be cheap alternatives that may not provide the same quality of care but get the job done.",
        "contentSimp": "universal healthcare provided pay taxes. people don't, cheap alternatives provide quality care job done."
    },
    {
        "index": 28,
        "timeCode": "March 29, 2013, 12:46:01 PM",
        "reply": -1,
        "user": "31c33",
        "content": "A lot of the times, guidance counselors are not in touch with the girls at school about anything. Students need someone who will talk to them openly about safe sex, birth control, etc. Make the topic an open discussion and a not a taboo subject that is discussed only after the girl gets pregnant.",
        "contentSimp": "lot times, guidance counselors touch girls school anything. students talk openly safe sex, birth control, etc. make topic open discussion taboo subject discussed girl pregnant."
    },
    {
        "index": 29,
        "timeCode": "March 29, 2013, 01:21:41 PM",
        "reply": 5,
        "user": "93c34",
        "content": "Adderol abuse in colleges is becoming a serious problem. Not to mention certain pharmaceuticals are the root of most illegal drugs being made in America today. Doctor's usually only get to see their patient once in situations where they diagnose, therefore they pass out prescriptions as a precautionary measure instead of actually reasoning if the patient truly needs the prescription. There needs to be discrete testing (i.e. personality tests or motor skills testing) that could be done in the waiting room or online before an appointment so the doctor can assess the results and have a better understanding of the patients true psychological, mental, or physical well-being before they're forced to diagnose the patient in one sitting.",
        "contentSimp": "adderol abuse colleges problem. mention pharmaceuticals root illegal drugs made america today. doctor's patient situations diagnose, pass prescriptions precautionary measure reasoning patient prescription. discrete testing (i.e. personality tests motor skills testing) waiting room online appointment doctor assess results understanding patients true psychological, mental, physical well-being they're forced diagnose patient sitting."
    },
    {
        "index": 30,
        "timeCode": "March 29, 2013, 01:28:37 PM",
        "reply": 18,
        "user": "93c34",
        "content": "Unless the person has a rare, or very severe problem, local Wal-marts, CVS pharmacy, or Walgreen's stores already provide very inexpensive generic medicines (both on the shelf and over the counter) with no insurance needed. However the biggest issue I see when it comes to medicine, is the big companies who patent their medicine when it's the only quality cure for a particular health problem. I'm usually not a person for government stepping into a business' business, but when that one company can charge ridiculous prices just because they're the only seller, there is a problem.",
        "contentSimp": "person rare, severe problem, local wal-marts, cvs pharmacy, walgreen's stores provide inexpensive generic medicines (both shelf counter) insurance needed. biggest issue medicine, big companies patent medicine it's quality cure health problem. i'm person government stepping business' business, company charge ridiculous prices they're seller, problem."
    },
    {
        "index": 31,
        "timeCode": "March 29, 2013, 01:35:19 PM",
        "reply": 12,
        "user": "93c34",
        "content": "That sounds fine, however you cant tell an insurance company that they're \"not allowed\" to turn down anyone for any reason because the business would crash, and even if they're not allowed to turn down a customer because of health reasons, they'll just claim that the reason they turned them down was because of financial background, career, etc. If the government wants to have insurance company that doesn't turn people down because of health conditions, then they might as well set it up themselves. However, that federal dollar funded organization will probably suffer a significant loss in $$ similar to the US Postal Service.",
        "contentSimp": "sounds fine, insurance company they're \"not allowed\" turn reason business crash, they're allowed turn customer health reasons, they'll claim reason turned financial background, career, etc. government insurance company doesn't turn people health conditions, set themselves. however, federal dollar funded organization suffer significant loss $$ similar postal service."
    },
    {
        "index": 32,
        "timeCode": "March 29, 2013, 01:40:46 PM",
        "reply": -1,
        "user": "93c34",
        "content": "The Health Care System right now is forcing too much upon the people and businesses as well. The main concern shouldn't be making every single person in American pay for every service that most will not use just so that a few can take advantage of it. The main concern should focus on helping the lower class who needs the services, obtain the standard of living that can provide them. Instead of throwing billions of tax dollars into food stamps and welfare checks, focus that money into creating the mass amounts of jobs that encourage the poor to get back on their feet, rather than giving to them handouts that encourage laying down.",
        "contentSimp": "health care system forcing people businesses well. main concern shouldn't making single person american pay service advantage it. main concern focus helping lower class services, obtain standard living provide them. throwing billions tax dollars food stamps welfare checks, focus money creating mass amounts jobs encourage poor back feet, giving handouts encourage laying down."
    },
    {
        "index": 33,
        "timeCode": "March 29, 2013, 01:46:33 PM",
        "reply": -1,
        "user": "93c34",
        "content": "Educating the young in middle and high school with actual programs to expand upon the potential risks of smoking, sex, and other health concerns could be very beneficial if funding went to having a good program set forth.",
        "contentSimp": "educating young middle high school actual programs expand potential risks smoking, sex, health concerns beneficial funding good program set forth."
    },
    {
        "index": 34,
        "timeCode": "March 29, 2013, 02:55:57 PM",
        "reply": -1,
        "user": "64c35",
        "content": "The health care system was built around helping your neighbor in a sense. In a group of ten people, one person might get six so the other 9 people would pay for a safety net if you will. One of the major problems is that our system doesn't account for a population boom, i.e. \"Baby-Boomers\". There are ways we can band aid the situation or make a temporary fix as in increasing the restrictions. This would restrict the health care given though, but it would give quality care to the ones that really need it. There are a lot of possibilities to \"band-aid\" the situation. However, to major fix the system we would have to get me details about the cost expenditures of the Healthcare system and it's sub-section. The current place we are at now is exhausting resources thus we are already restricting the health care system by this. The long term fix is going to come from preventative care i.e. technology and education. If we restrict the current health care system for awhile, there is no easy fix. Then we could make grants for study for colleges or firms to research the diseases, recovery rate, etc... This would give the incentive to invent new techniques to pre-screen patients for ailments then categories the patients in there system which could reduce the emergency room wait time. Another way is to spread out the load on the system thus you would need other places for the traffic to go. However this can be more costly because of upkeep cost and it would take time to build, but the long term effect is having clinics that can serve for the minor emergencies or non life threatening emergencies. The problem with this though is the people would have to know what the two are and how they are different. An example if your getting robbed you call 911, if you hear shots fired you call 911, but if you lose your wallet do you call 911? Thus, you would need education. Education would help reduce the work load through people going to where they are suppose to go for a given emergency, not to mention them themselves eating healthier, treating themselves better, etc...",
        "contentSimp": "health care system built helping neighbor sense. group ten people, person 9 people pay safety net will. major problems system doesn't account population boom, i.e. \"baby-boomers\". ways band aid situation make temporary fix increasing restrictions. restrict health care though, give quality care it. lot possibilities \"band-aid\" situation. however, major fix system details cost expenditures healthcare system it's sub-section. current place exhausting resources restricting health care system this. long term fix preventative care i.e. technology education. restrict current health care system awhile, easy fix. make grants study colleges firms research diseases, recovery rate, etc... give incentive invent techniques pre-screen patients ailments categories patients system reduce emergency room wait time. spread load system places traffic go. costly upkeep cost time build, long term effect clinics serve minor emergencies life threatening emergencies. problem people different. robbed call 911, hear shots fired call 911, lose wallet call 911? thus, education. education reduce work load people suppose emergency, mention eating healthier, treating better, etc..."
    },
    {
        "index": 35,
        "timeCode": "April 05, 2013, 10:11:52 AM",
        "reply": 16,
        "user": "93c31",
        "content": "Maybe provide therapy or counseling for parents or family members help deal with a loved one with mental illness so they are aware of what they can do to provide everything they need for their loved one.",
        "contentSimp": "provide therapy counseling parents family members deal loved mental illness aware provide loved one."
    },
    {
        "index": 36,
        "timeCode": "April 05, 2013, 10:14:52 AM",
        "reply": -1,
        "user": "93c31",
        "content": "Educate about the differences in mental illness and what types of mental illness there is. Many people assume that while schizophrenia is a mental illness but not ADHD (Attention Deficit Hyperactivity Disorder) is not.",
        "contentSimp": "educate differences mental illness types mental illness is. people assume schizophrenia mental illness adhd (attention deficit hyperactivity disorder) not."
    },
    {
        "index": 37,
        "timeCode": "April 05, 2013, 10:16:22 AM",
        "reply": 19,
        "user": "93c31",
        "content": "Provide more options for the lower class, middle class, and upper class to balance out what they can make out of what they have.",
        "contentSimp": "provide options lower class, middle class, upper class balance make have."
    },
    {
        "index": 38,
        "timeCode": "April 05, 2013, 10:20:32 AM",
        "reply": -1,
        "user": "93c31",
        "content": "Educate children from middle school and forward about teen pregnancy and the challenges of having a child at such a young age means.",
        "contentSimp": "educate children middle school forward teen pregnancy challenges child young age means."
    },
    {
        "index": 39,
        "timeCode": "April 05, 2013, 10:21:29 AM",
        "reply": -1,
        "user": "93c31",
        "content": "Provide a day care in more high schools now that there are higher risks of teen pregnancies.",
        "contentSimp": "provide day care high schools higher risks teen pregnancies."
    },
    {
        "index": 40,
        "timeCode": "April 05, 2013, 11:12:49 AM",
        "reply": 39,
        "user": "36c32",
        "content": "Maybe in each school district have a school that provides daycare and while the teen is still in school.",
        "contentSimp": "school district school daycare teen school."
    },
    {
        "index": 41,
        "timeCode": "April 05, 2013, 11:16:10 AM",
        "reply": 28,
        "user": "36c32",
        "content": "Also have a guidance counselors for boys so they will know how to practice safe sex if chooses and let them be aware that sleeping with multiple partners could lead to risk of STDs and other things",
        "contentSimp": "guidance counselors boys practice safe sex chooses aware sleeping multiple partners lead risk stds things"
    },
    {
        "index": 42,
        "timeCode": "April 05, 2013, 11:21:28 AM",
        "reply": -1,
        "user": "36c32",
        "content": "Maybe if we start with educating the kids in schools then getting the parents involved that do not know the difference, so by the time the kids are adults they will hopefully be able to teach their kids the difference between the two",
        "contentSimp": "start educating kids schools parents involved difference, time kids adults teach kids difference"
    },
    {
        "index": 43,
        "timeCode": "April 05, 2013, 11:23:01 AM",
        "reply": -1,
        "user": "36c32",
        "content": "Also maybe put healthcare as a requirement for schools to teach the kids so kids could get an understanding on all aspects on how the healthcare works",
        "contentSimp": "put healthcare requirement schools teach kids kids understanding aspects healthcare works"
    },
    {
        "index": 44,
        "timeCode": "April 05, 2013, 12:20:23 PM",
        "reply": -1,
        "user": "31c33",
        "content": "The government has so many ways for people to freeload off of the benefits they provide. For instance, welfare checks for the unemployed and food stamps for people who don't make enough money to feed their family. Yes, these projects are important but we spend too much of our tax dollars funding them. The focus should be on healthcare because it is ridiculous, especially now, how much money people have to spend to receive treatment. Universal healthcare is definitely something that the government should look into and invest money in.",
        "contentSimp": "government ways people freeload benefits provide. instance, welfare checks unemployed food stamps people don't make money feed family. yes, projects important spend tax dollars funding them. focus healthcare ridiculous, now, money people spend receive treatment. universal healthcare government invest money in."
    },
    {
        "index": 45,
        "timeCode": "April 09, 2013, 12:45:09 PM",
        "reply": -1,
        "user": "64c35",
        "content": "Spend research money on a cure all drug that is cheap and effective.",
        "contentSimp": "spend research money cure drug cheap effective."
    },
    {
        "index": 46,
        "timeCode": "April 09, 2013, 12:47:50 PM",
        "reply": -1,
        "user": "64c35",
        "content": "Limiting the covered operations of a given program.",
        "contentSimp": "limiting covered operations program."
    },
    {
        "index": 47,
        "timeCode": "April 09, 2013, 12:51:58 PM",
        "reply": -1,
        "user": "64c35",
        "content": "True story, a man that couldn't afford an operation that was life threatening decided to do a crime(i think rob), he got arrested pleaded guilty and upon entering the criminal system was able to get his life saving operation. Also, I don't think universal healthcare would work in any way shape or form. It's good in a sense but if you put into practice, let's say Canada... Good luck not waiting for 8 months. (overreacting of course.)",
        "contentSimp": "true story, man couldn't afford operation life threatening decided crime(i rob), arrested pleaded guilty entering criminal system life saving operation. also, don't universal healthcare work shape form. it's good sense put practice, let's canada... good luck waiting 8 months. (overreacting course.)"
    },
    {
        "index": 48,
        "timeCode": "April 09, 2013, 12:59:18 PM",
        "reply": -1,
        "user": "64c35",
        "content": "We could ask the stars and hope aliens hear us. Then we could ask them for health care and not to mention the technology upgrade we would get because of it.",
        "contentSimp": "stars hope aliens hear us. health care mention technology upgrade it."
    },
    {
        "index": 49,
        "timeCode": "April 12, 2013, 02:15:38 PM",
        "reply": -1,
        "user": "93c31",
        "content": "The benefits or welfare checks are supposed to be in effect for the person receiving it for certain amount of years, I think that's a max of 5 years to be in the program. I do think it should be harder for it to gain those benefits or put more guidelines and rules to keep getting welfare.",
        "contentSimp": "benefits welfare checks supposed effect person receiving amount years, that's max 5 years program. harder gain benefits put guidelines rules welfare."
    },
    {
        "index": 50,
        "timeCode": "April 12, 2013, 02:19:03 PM",
        "reply": -1,
        "user": "93c31",
        "content": "Putting more money into providing technology for hospitals and smaller clinics that help diagnosis patients faster.",
        "contentSimp": "putting money providing technology hospitals smaller clinics diagnosis patients faster."
    },
    {
        "index": 51,
        "timeCode": "April 12, 2013, 02:20:10 PM",
        "reply": -1,
        "user": "93c31",
        "content": "But even if more money is put into technology, more money is wanted for everything else. It is as if we can't get one thing without losing another.",
        "contentSimp": "money put technology, money wanted else. can't thing losing another."
    },
    {
        "index": 52,
        "timeCode": "April 12, 2013, 02:24:55 PM",
        "reply": -1,
        "user": "93c31",
        "content": "I think putting psychology or the study of the mind that is not biology be put into a required study in high school. During your high school years is when children decide they want to grow up, they start learning more about the outside life and what can happen. During the high school years, we face more problems with bullying of others because they are different. Why not provide a class and teach students about mental illness, because there are minor and major ones to talk about. And let the students be aware that the things they do can trigger something in someone, or you can help someone.",
        "contentSimp": "putting psychology study mind biology put required study high school. high school years children decide grow up, start learning life happen. high school years, face problems bullying different. provide class teach students mental illness, minor major talk about. students aware things trigger someone, someone."
    },
    {
        "index": 53,
        "timeCode": "April 15, 2013, 10:07:43 AM",
        "reply": 1,
        "user": "31c33",
        "content": "I think it should be easily accessible at any age. Especially to young children who have serious or even menial health problems.",
        "contentSimp": "easily accessible age. young children menial health problems."
    },
    {
        "index": 54,
        "timeCode": "April 15, 2013, 10:12:39 AM",
        "reply": -1,
        "user": "31c33",
        "content": "I believe the gist of Obamacare is to utilize preventative care in the U.S. so that people won't be at risk for diseases they could have avoided simply by changing some aspects of their lifestyle. This should definitely be enforced in young students because the earlier you start teaching them about healthy diets and exercise, the more inclined they will be to practice them in reality.",
        "contentSimp": "gist obamacare utilize preventative care u.s. people won't risk diseases avoided simply changing aspects lifestyle. enforced young students earlier start teaching healthy diets exercise, inclined practice reality."
    },
    {
        "index": 55,
        "timeCode": "April 15, 2013, 11:01:41 AM",
        "reply": -1,
        "user": "36c32",
        "content": "Instead of having more schools eliminate recess hour maybe have teachers actually exercise with the kids and do organized games with the kids for 30min.",
        "contentSimp": "schools eliminate recess hour teachers exercise kids organized games kids 30min."
    },
    {
        "index": 56,
        "timeCode": "April 15, 2013, 11:04:00 AM",
        "reply": -1,
        "user": "36c32",
        "content": "Instead of having the nasty stuff cafeteria serve have healthy pre-made lunches that are tasty",
        "contentSimp": "nasty stuff cafeteria serve healthy pre-made lunches tasty"
    },
    {
        "index": 57,
        "timeCode": "April 15, 2013, 11:06:37 AM",
        "reply": -1,
        "user": "36c32",
        "content": "Have PE teachers teach about healthy food alternatives and have them show them fun ways they can exercise at home",
        "contentSimp": "pe teachers teach healthy food alternatives show fun ways exercise home"
    },
    {
        "index": 58,
        "timeCode": "April 15, 2013, 11:08:29 AM",
        "reply": -1,
        "user": "36c32",
        "content": "When having the Holiday parties at school instead of the kids bring a lot of junk food have them bring healthy foods and a couple things that are junk food",
        "contentSimp": "holiday parties school kids bring lot junk food bring healthy foods couple things junk food"
    },
    {
        "index": 59,
        "timeCode": "April 15, 2013, 11:11:06 AM",
        "reply": -1,
        "user": "36c32",
        "content": "Have workshops in the school that can help kids be active and think about the healthy alternatives while they are at home or even at school",
        "contentSimp": "workshops school kids active healthy alternatives home school"
    },
    {
        "index": 60,
        "timeCode": "April 15, 2013, 11:14:06 AM",
        "reply": -1,
        "user": "36c32",
        "content": "Schools try to get the parents involved with healthy eating habits so when they get home they could do what they learned with there kids",
        "contentSimp": "schools parents involved healthy eating habits home learned kids"
    },
    {
        "index": 61,
        "timeCode": "April 15, 2013, 11:15:41 AM",
        "reply": -1,
        "user": "36c32",
        "content": "When the kids have field day make it a healthy choice day too, so it shows that kids are having fun being active and making healthy choices",
        "contentSimp": "kids field day make healthy choice day too, shows kids fun active making healthy choices"
    },
    {
        "index": 62,
        "timeCode": "April 15, 2013, 11:19:32 AM",
        "reply": -1,
        "user": "36c32",
        "content": "Making healthy foods more accessible instead of having one aisle in a grocery store or driving to whole foods that's too far away for some people",
        "contentSimp": "making healthy foods accessible aisle grocery store driving foods that's people"
    },
    {
        "index": 63,
        "timeCode": "April 15, 2013, 11:20:32 AM",
        "reply": -1,
        "user": "36c32",
        "content": "In grocery store have them show the healthy alternatives of the items they buy",
        "contentSimp": "grocery store show healthy alternatives items buy"
    },
    {
        "index": 64,
        "timeCode": "April 15, 2013, 12:12:01 PM",
        "reply": -1,
        "user": "64c35",
        "content": "An advertise program that has celebrities\/professional sport players eating\/drinking health food\/drinks. Everyone takes in to consideration be it negative or positive about the ad and when they are shopping.",
        "contentSimp": "advertise program celebrities\/professional sport players eating\/drinking health food\/drinks. takes consideration negative positive ad shopping."
    },
    {
        "index": 65,
        "timeCode": "April 15, 2013, 12:16:41 PM",
        "reply": -1,
        "user": "64c35",
        "content": "Have a TV show for kids and teach them how being healthy can be or then maybe a reverse image.",
        "contentSimp": "tv show kids teach healthy reverse image."
    },
    {
        "index": 66,
        "timeCode": "April 15, 2013, 12:25:11 PM",
        "reply": 55,
        "user": "64c35",
        "content": "This is a good idea but it would be hard on some teachers. Maybe have like sections of classes\/a hallway go to outside and play(out side of recess\/lunch). Also some kids love recess, and some hate it...",
        "contentSimp": "good idea hard teachers. sections classes\/a hallway play(out side recess\/lunch). kids love recess, hate it..."
    },
    {
        "index": 67,
        "timeCode": "April 15, 2013, 12:28:30 PM",
        "reply": -1,
        "user": "64c35",
        "content": "Maybe having state ladders for healthy families and where they rank for life style\/food choices etc... I know I'm naturally competitive and it could spark some to take another step onto a healthy path. The question would be how to make it competitive without the effect of feeling bullied if your at the lower end or behind someone.",
        "contentSimp": "state ladders healthy families rank life style\/food choices etc... i'm naturally competitive spark step healthy path. question make competitive effect feeling bullied lower end someone."
    }
]