[
  {
    "index": 0,
    "timeCode": "April 06, 2013, 10:29:02 AM",
    "reply": -1,
    "user": "43n78",
    "content": "One of my biggest concerns is the number of people who cannot access healthcare because of an inability to afford insurance. This could be resolved if the healthcare system were subsidized by the government. I believe that the government could do well do channel more funds towards the healthcare system. The funds do not need to be generated via tax hikes; they can be allocated by reducing spending in other aspects such as the military.",
    "contentSimp": "biggest concerns number people access healthcare inability afford insurance. resolved healthcare system subsidized government. government channel funds healthcare system. funds generated tax hikes; allocated reducing spending aspects military."
  },
  {
    "index": 1,
    "timeCode": "April 06, 2013, 10:35:12 AM",
    "reply": -1,
    "user": "43n78",
    "content": "I believe that a Universal Healthcare program such as the one in effect in Canada, or other Western European nations such as the UK, Germany, France, or Australia, is the way to the greater good. All of those nations have healthcare, and sterling economies. Treatment for certain conditions like cancer, for example, are difficult to overcome even with large paychecks. The manner in which banks monitor credit means that most people are forced to choose between ignoring treatment, or ruining their credit history, which would make taking out loans, mortgages, financial assistance, extremely difficult. No one in the 21st century, living in the world's most affluent nation, should be denied access to healthcare. Tax rates may increase slightly, but it will be for the overall betterment of society.",
    "contentSimp": "universal healthcare program effect canada, western european nations uk, germany, france, australia, greater good. nations healthcare, sterling economies. treatment conditions cancer, example, difficult overcome large paychecks. manner banks monitor credit means people forced choose ignoring treatment, ruining credit history, make taking loans, mortgages, financial assistance, extremely difficult. 21st century, living world's affluent nation, denied access healthcare. tax rates increase slightly, betterment society."
  },
  {
    "index": 2,
    "timeCode": "April 06, 2013, 10:43:18 AM",
    "reply": -1,
    "user": "43n78",
    "content": "I believe that pharmaceuticals should be made available to patients, at minimal costs; provided they have a prescription for it of course. The cost of medicine piles on to already burgeoning hospital bills. The government should look into subsidizing pharmaceutical companies as much as possible to enable them to lower prices for the more expensive pharmaceutical products, which are in high demand i.e. expensive medicines which are sought by a large number of patients because the disease \/ ailment it is used for is somewhat widespread.",
    "contentSimp": "pharmaceuticals made patients, minimal costs; provided prescription course. cost medicine piles burgeoning hospital bills. government subsidizing pharmaceutical companies enable lower prices expensive pharmaceutical products, high demand i.e. expensive medicines sought large number patients disease \/ ailment widespread."
  },
  {
    "index": 3,
    "timeCode": "April 06, 2013, 10:54:25 AM",
    "reply": -1,
    "user": "43n78",
    "content": "Subsidizing companies can only go so far. Doctor's will be reluctant as this might reduce their earnings. This problem can be circumvented if the government comes up with new laws to assist doctors in other ways. For example, doctors can be made eligible for lower interest rates when taking out mortgages or perhaps their children can be provided with reduced fiscal costs. The idea is that reduced expenses will negate their somewhat reduced earnings which would occur from lowered healthcare bills.",
    "contentSimp": "subsidizing companies far. doctor's reluctant reduce earnings. problem circumvented government laws assist doctors ways. example, doctors made eligible lower interest rates taking mortgages children provided reduced fiscal costs. idea reduced expenses negate reduced earnings occur lowered healthcare bills."
  },
  {
    "index": 4,
    "timeCode": "April 06, 2013, 10:56:36 AM",
    "reply": -1,
    "user": "43n78",
    "content": "The overall standard of Emergency room services must be raised. It is not uncommon for patients to be waiting for hours before they can be treated. This issue needs to be addressed better.",
    "contentSimp": "standard emergency room services raised. uncommon patients waiting hours treated. issue addressed better."
  },
  {
    "index": 5,
    "timeCode": "April 06, 2013, 12:36:23 PM",
    "reply": -1,
    "user": "99n32",
    "content": "A good way to improve the healthcare system is   to let specialized computers help doctors diagnose patients. This will save the time and money for the patient as well as receiving better treatment.",
    "contentSimp": "good improve healthcare system is   to specialized computers doctors diagnose patients. save time money patient receiving treatment."
  },
  {
    "index": 6,
    "timeCode": "April 06, 2013, 12:40:23 PM",
    "reply": -1,
    "user": "99n32",
    "content": "Educating the public about most common diseases and explain how they can lower their risk may help reduced the amount of people that will need to be treated for certain diseases.",
    "contentSimp": "educating public common diseases explain lower risk reduced amount people treated diseases."
  },
  {
    "index": 7,
    "timeCode": "April 06, 2013, 12:45:44 PM",
    "reply": -1,
    "user": "99n32",
    "content": "It is known that soda is the highest contributor to the rise of obesity. We can cut down the consumption of soda in the same way we reduced smoking, by taxing it.  If we are able to reduce the obesity rate we can also lower the risk of heart disease and diabetes. If we can reduced that the amount of people needing to be treated will be lowered as well.",
    "contentSimp": "soda highest contributor rise obesity. cut consumption soda reduced smoking, taxing it.  reduce obesity rate lower risk heart disease diabetes. reduced amount people needing treated lowered well."
  },
  {
    "index": 8,
    "timeCode": "April 06, 2013, 01:29:22 PM",
    "reply": -1,
    "user": "74n39",
    "content": "I believe that education is the fundamental root of every possible changes in the country. By supporting education, specially in healthcare profession, we can produce more doctors, nurses, and others related healthcare career. The term of supporting education I mean is, for example provide more scholarships for students, provide more opportunity and more campaign to level up the interested of student in Healthcare profession careers. Also, provide more opportunity to international student so they will be able to work in the US, provide more funds and affordable education to low-income student. Tuition needs to be flat rate, rather than keep going up every year. No one would be able to continue their education in a higher level of education if they know they will be broke after graduating.",
    "contentSimp": "education fundamental root country. supporting education, specially healthcare profession, produce doctors, nurses, related healthcare career. term supporting education is, provide scholarships students, provide opportunity campaign level interested student healthcare profession careers. also, provide opportunity international student work us, provide funds affordable education low-income student. tuition flat rate, year. continue education higher level education broke graduating."
  },
  {
    "index": 9,
    "timeCode": "April 06, 2013, 01:32:30 PM",
    "reply": 4,
    "user": "74n39",
    "content": "I agree that emergency room's standard must be raised, and I think more facilities, not just emergency room, also must be built so it is easier and quicker to get to doctor's hand.",
    "contentSimp": "agree emergency room's standard raised, facilities, emergency room, built easier quicker doctor's hand."
  },
  {
    "index": 10,
    "timeCode": "April 06, 2013, 02:32:48 PM",
    "reply": 0,
    "user": "18n33",
    "content": "the military is an important part of keeping this country strong. yes i agree the government could help more. but i think it should be more on the employers hands on whether the empoyees are covered with well enough health coverage",
    "contentSimp": "military important part keeping country strong. agree government more. employers hands empoyees covered health coverage"
  },
  {
    "index": 11,
    "timeCode": "April 06, 2013, 02:35:02 PM",
    "reply": -1,
    "user": "18n33",
    "content": "health care should not be in the governments hands completely. one of my biggest issues with government having to much control of our health care is that the quality will be greatly reduced. when the government is involved, they are cheap and will try and find shortcuts to making such a system without paying much for it.",
    "contentSimp": "health care governments hands completely. biggest issues government control health care quality greatly reduced. government involved, cheap find shortcuts making system paying it."
  },
  {
    "index": 12,
    "timeCode": "April 06, 2013, 02:38:33 PM",
    "reply": 11,
    "user": "18n33",
    "content": "honestly i think it should be in the hands of the employers. the company a person works for should be the main \"manager\" so to speak of the health care of their employees. for those who can not work due to disabilities, then a private investor should be held responsible. donations and community service can help to make that a possibility. and more people would rather donate to help those that need it, rather than have it forcibly be taken out of their paychecks. for the homeless, they should get a time limit on how long they are allowed to be insured without a job. if they continue to live on the streets without any attempts of applying and searching for a job, then they should be cut off. free loaders are what is draining from others of this free country.",
    "contentSimp": "honestly hands employers. company person works main \"manager\" speak health care employees. work due disabilities, private investor held responsible. donations community service make possibility. people donate it, forcibly paychecks. homeless, time limit long allowed insured job. continue live streets attempts applying searching job, cut off. free loaders draining free country."
  },
  {
    "index": 13,
    "timeCode": "April 06, 2013, 02:39:50 PM",
    "reply": -1,
    "user": "18n33",
    "content": "technology should also be updated. some hospitals are more advanced than others and that is leaving both the patients and the staff at a disadvantage",
    "contentSimp": "technology updated. hospitals advanced leaving patients staff disadvantage"
  },
  {
    "index": 14,
    "timeCode": "April 06, 2013, 02:42:21 PM",
    "reply": -1,
    "user": "18n33",
    "content": "emergency services in bigger cities are at a disadvantage because anyone can go there with or without insurance. therefore the wait can be substantially longer because a kid without insurance has the flu. that's why i think there should be separate hospitals for people without insurance to go without a real emergency, leaving the ER to do what it was intended to do and allow shorter wait times for the patients with an actual emergency",
    "contentSimp": "emergency services bigger cities disadvantage insurance. wait substantially longer kid insurance flu. that's separate hospitals people insurance real emergency, leaving er intended shorter wait times patients actual emergency"
  },
  {
    "index": 15,
    "timeCode": "April 06, 2013, 02:44:18 PM",
    "reply": -1,
    "user": "18n33",
    "content": "i think that medicine should be automatically paid for by all insurances if it is for [pain, emergencies, \"must-haves to survive\"] but others should be paid for depending on the level of insurance you have. kind of like car insurance",
    "contentSimp": "medicine automatically paid insurances [pain, emergencies, \"must-haves survive\"] paid depending level insurance have. kind car insurance"
  },
  {
    "index": 16,
    "timeCode": "April 06, 2013, 02:46:26 PM",
    "reply": -1,
    "user": "18n33",
    "content": "preventive care should be increased. programs such as sex-education to minors in schools,  soaps and signs to keep safe, etc should be higher quality and more abundant than they are now. with the increasingly high number of teen pregnancies, flu deaths, etc. it is more important now than ever to make aware of how to prevent such occurances",
    "contentSimp": "preventive care increased. programs sex-education minors schools,  soaps signs safe, higher quality abundant now. increasingly high number teen pregnancies, flu deaths, etc. important make aware prevent occurances"
  },
  {
    "index": 17,
    "timeCode": "April 06, 2013, 02:48:09 PM",
    "reply": -1,
    "user": "18n33",
    "content": "i think that for doctors and nurses with more than just a BSN that after you have graduated with a bachelor, the college taken following should be paid for by the state. too many smart people do not become doctors or nurse practitioners because the cost of such an education is drowning.",
    "contentSimp": "doctors nurses bsn graduated bachelor, college paid state. smart people doctors nurse practitioners cost education drowning."
  },
  {
    "index": 18,
    "timeCode": "April 06, 2013, 02:49:44 PM",
    "reply": 5,
    "user": "18n33",
    "content": "i agree. it will also help decrease the number of misinterpretations and mistakes as well.",
    "contentSimp": "agree. decrease number misinterpretations mistakes well."
  },
  {
    "index": 19,
    "timeCode": "April 06, 2013, 02:51:59 PM",
    "reply": 7,
    "user": "18n33",
    "content": "i completely agree with you here. foods that are leading causes [and drinks] of obesity should be taxed at a higher rate than foods that are good for you. it is amazing how much more expensive it is to get something that is good for you an it is to get something that is slowly killing the inside of your body. if the government were to intervene in anyway, this should be how.",
    "contentSimp": "completely agree here. foods leading [and drinks] obesity taxed higher rate foods good you. amazing expensive good slowly killing inside body. government intervene anyway, how."
  },
  {
    "index": 20,
    "timeCode": "April 08, 2013, 03:27:44 PM",
    "reply": -1,
    "user": "32n49",
    "content": "I watched this film Sicko and it displayed the healthcare in the UK, Germany, and other foreign places.  Everybody had healthcare but I wondered if they had to pay more for taxes.  I believe we should have the right to decide if we want healthcare.  If the governments insists everybody has it then isn't it taking our right to decide.  It would be nice if everybody had healthcare but our economy is already low.  We could make budget cuts to the military but then what happens to our defense system.  Usually when we make budget cuts its money for education.  If the government decides our healthcare then they might decide what we need is too much and take a shortcut that wouldn't benefit us just to save a dollar.",
    "contentSimp": "watched film sicko displayed healthcare uk, germany, foreign places.  healthcare wondered pay taxes.  decide healthcare.  governments insists isn't taking decide.  nice healthcare economy low.  make budget cuts military defense system.  make budget cuts money education.  government decides healthcare decide shortcut wouldn't benefit save dollar."
  },
  {
    "index": 21,
    "timeCode": "April 08, 2013, 03:28:29 PM",
    "reply": -1,
    "user": "32n49",
    "content": "*them",
    "contentSimp": "*them"
  },
  {
    "index": 23,
    "timeCode": "April 08, 2013, 03:33:02 PM",
    "reply": 1,
    "user": "32n49",
    "content": "It sounded too good to be true until i seen tax rates may increase slightly.  How big is slightly?  If everybody has healthcare how does it affect healthcare workers (doctors, nurses, etc)?",
    "contentSimp": "sounded good true tax rates increase slightly.  big slightly?  healthcare affect healthcare workers (doctors, nurses, etc)?"
  },
  {
    "index": 24,
    "timeCode": "April 08, 2013, 03:39:57 PM",
    "reply": 4,
    "user": "32n49",
    "content": "This is due to the lack of staff and space.  I'm not sure how to solve this problem because the only solution is to hire more people and get bigger spaces which cost money. Any ideas?",
    "contentSimp": "due lack staff space.  i'm solve problem solution hire people bigger spaces cost money. ideas?"
  },
  {
    "index": 25,
    "timeCode": "April 08, 2013, 03:45:43 PM",
    "reply": 6,
    "user": "32n49",
    "content": "It's not that they don't try to educate people about common disease.  That's why we have Google and the media.  It's that people don't care about this topic unless its affecting their life at that specific moment.",
    "contentSimp": "it's don't educate people common disease.  that's google media.  it's people don't care topic affecting life specific moment."
  },
  {
    "index": 26,
    "timeCode": "April 13, 2013, 10:06:04 AM",
    "reply": 0,
    "user": "18n33",
    "content": "i dont think the government should play in any role of the health care. anytime the government takes part in anything with the people the quality greatly decreases. it should be the responsibility of the workplace.",
    "contentSimp": "government play role health care. anytime government takes part people quality greatly decreases. responsibility workplace."
  },
  {
    "index": 27,
    "timeCode": "April 13, 2013, 10:08:39 AM",
    "reply": 20,
    "user": "18n33",
    "content": "exactly and the last thing we need is for money to be taken from our education. its because people arent getting a good enough education that they are needing medicare. if more people focused and highering their education, and if the government went more into helping the education system less people would need government care to afford health care. less people would get sick because they would be able to afford a cleaner enviroment",
    "contentSimp": "thing money education. people good education needing medicare. people focused highering education, government helping education system people government care afford health care. people sick afford cleaner enviroment"
  },
  {
    "index": 28,
    "timeCode": "April 13, 2013, 10:10:12 AM",
    "reply": 24,
    "user": "18n33",
    "content": "educate better, dont make college so expensive so more people can go and get such a good education and pursue things like doctors, nurses, surgeons.",
    "contentSimp": "educate better, make college expensive people good education pursue things doctors, nurses, surgeons."
  },
  {
    "index": 29,
    "timeCode": "April 13, 2013, 10:17:05 AM",
    "reply": -1,
    "user": "18n33",
    "content": "i am a big believer in the laissez-fare** approach to government. \"handsoff approach\" whenever the government is involved, the quality is decreased, the care is decreased, and honestly so many shortcuts are taken, that people might as well not even use it. whenever private companies do anything, the quality is a lot higher because they need you to want it, and to buy it, so they are going to make it to the best of their ability. yes it might be a little more pricey, but wouldn't it be worth it if the product was better? this is how i feel towards government controlling our health care systems, honestly the quality would suck if it were under the government hands. the only thing i think the government should help with is education. Sweden, if you are a born citizen, you get to go to college for free. this is how it should be here in America. with a smarter population, health care would take care of itself. people would be able to afford their own health care. also we might become a top country once again. i still think their needs to be competition into what college a person attends though, otherwise college would be like high school, just a right of passage.",
    "contentSimp": "big believer laissez-fare** approach government. \"handsoff approach\" government involved, quality decreased, care decreased, honestly shortcuts taken, people it. private companies anything, quality lot higher it, buy it, make ability. pricey, wouldn't worth product better? feel government controlling health care systems, honestly quality suck government hands. thing government education. sweden, born citizen, college free. america. smarter population, health care care itself. people afford health care. top country again. competition college person attends though, college high school, passage."
  },
  {
    "index": 30,
    "timeCode": "April 13, 2013, 10:44:33 AM",
    "reply": 16,
    "user": "74n39",
    "content": "I agreed that education on preventive care need to be raised. In addition, there should be ways to make this information available to everyone, and making everyone aware of it. Nowadays, we know that not many people are interested and unaware of what can they do to prevent themselves from disease but if we could make the preventive care campaign more interesting and easier to understand, it would eventually got into everyone's head.",
    "contentSimp": "agreed education preventive care raised. addition, ways make information everyone, making aware it. nowadays, people interested unaware prevent disease make preventive care campaign interesting easier understand, eventually everyone's head."
  },
  {
    "index": 31,
    "timeCode": "April 13, 2013, 10:51:12 AM",
    "reply": -1,
    "user": "74n39",
    "content": "I think it's people's right whether they want or do not want to have health insurance. Indeed, it is great if everyone has health insurance, but if it's not their will then there shouldn't be any unfair force to get one. Some people knows how to take care and prevent them from disease, such as eating right. This will help cutting government's budget that wanted to provide health insurance to everyone. With this money, government can use it to build more Emergency care, and that's where everyone really need because we don't know what's going to happen to us at any moment.",
    "contentSimp": "it's people's health insurance. indeed, great health insurance, it's shouldn't unfair force one. people care prevent disease, eating right. cutting government's budget wanted provide health insurance everyone. money, government build emergency care, that's don't what's happen moment."
  },
  {
    "index": 32,
    "timeCode": "April 13, 2013, 10:55:07 AM",
    "reply": 29,
    "user": "74n39",
    "content": "Totally agree on education system. The easier to get access to education, the more people will wanted to get education. The competition of career in market will increase, people would seek even higher education to compete, consequently, more people are aware and educated, we can produce not just a better healthcare system, but others too such as economic.",
    "contentSimp": "totally agree education system. easier access education, people wanted education. competition career market increase, people seek higher education compete, consequently, people aware educated, produce healthcare system, economic."
  },
  {
    "index": 33,
    "timeCode": "April 13, 2013, 11:31:38 AM",
    "reply": -1,
    "user": "99n32",
    "content": "Investing in emerging healthcare companies will increase competition and hopefully lower the price of medication and equipment.",
    "contentSimp": "investing emerging healthcare companies increase competition lower price medication equipment."
  },
  {
    "index": 34,
    "timeCode": "April 13, 2013, 11:32:53 AM",
    "reply": -1,
    "user": "99n32",
    "content": "Reforming the patten to lower the amount of time a pharmaceutical company can hold the right to monopolies their product will help a lot",
    "contentSimp": "reforming patten lower amount time pharmaceutical company hold monopolies product lot"
  },
  {
    "index": 35,
    "timeCode": "April 15, 2013, 01:06:36 PM",
    "reply": 29,
    "user": "32n49",
    "content": "I like this idea. I do believe that if the government are in control of our government then they'll take many short cuts to just save a buck. ",
    "contentSimp": "idea. government control government they'll short cuts save buck. "
  },
  {
    "index": 36,
    "timeCode": "April 15, 2013, 01:09:34 PM",
    "reply": -1,
    "user": "32n49",
    "content": "It would be nice for everybody to have health insurance but I know many people who rarely go to the doctors.  Should they have to pay so much just for healthcare when they only visit for check ups? ",
    "contentSimp": "nice health insurance people rarely doctors.  pay healthcare visit check ups? "
  },
  {
    "index": 37,
    "timeCode": "April 15, 2013, 01:19:40 PM",
    "reply": -1,
    "user": "32n49",
    "content": "I believe that the healthcare plan is to help the low income and it takes away from people who can afford healthcare because they went to college and got well paying jobs.  Many low income people didnt go to college because of the money for college tuition so if we had money for them to go to college then maybe more people would have healthcare.",
    "contentSimp": "healthcare plan low income takes people afford healthcare college paying jobs.  low income people college money college tuition money college people healthcare."
  },
  {
    "index": 39,
    "timeCode": "April 16, 2013, 01:48:18 PM",
    "reply": -1,
    "user": "74n39",
    "content": "Government should restricted their inspection on the Food and Drink company to make sure the quality of the food and drink won't cause harm for the body. Also, government should support and help lowered price on \"Healthy\" menu, and \"Organic\" products, so more people can afford the good products. This will not only prevent people from getting sick and become obese, but raise the economic on the farmers side.",
    "contentSimp": "government restricted inspection food drink company make quality food drink won't harm body. also, government support lowered price \"healthy\" menu, \"organic\" products, people afford good products. prevent people sick obese, raise economic farmers side."
  },
  {
    "index": 40,
    "timeCode": "April 16, 2013, 01:54:11 PM",
    "reply": -1,
    "user": "74n39",
    "content": "Vaccines supply should have enough when its needed. For example, the meningitis vaccine last year, though people without insurance can get it for $25 but what happened was the vaccines weren't enough for everyone, and they have to get them from the private care for over $100. Government should be more prepared on their stocks.",
    "contentSimp": "vaccines supply needed. example, meningitis vaccine year, people insurance $25 happened vaccines weren't everyone, private care $100. government prepared stocks."
  },
  {
    "index": 41,
    "timeCode": "April 18, 2013, 11:15:41 AM",
    "reply": -1,
    "user": "43n78",
    "content": "The importance of the military should not be undermined. However, we in the US are as further away from doing that than any nation in the world. The United States spends more on military than any nation in the world. A lot of that spending is superfluous and there is plenty of room to make budget cuts there.",
    "contentSimp": "importance military undermined. however, nation world. united states spends military nation world. lot spending superfluous plenty room make budget cuts there."
  },
  {
    "index": 42,
    "timeCode": "April 18, 2013, 11:22:57 AM",
    "reply": 29,
    "user": "43n78",
    "content": "I also believe in minimal government intervention within the economy; however some intervention is still necessary to a certain extent. Millions of people are priced out of healthcare today meaning that often this system is causing more harm than good. This is when the government needs to step in and make certain restrictions. Private companies work better than state run ones, however their primary motive is profit. When it comes to healthcare, we have to remember that this method will inevitably price out some customers ('patients'). It is essential that nobody gets left behind. Just like education, healthcare is a need which should not be denied to any citizen.",
    "contentSimp": "minimal government intervention economy; intervention extent. millions people priced healthcare today meaning system causing harm good. government step make restrictions. private companies work state run ones, primary motive profit. healthcare, remember method inevitably price customers ('patients'). essential left behind. education, healthcare denied citizen."
  },
  {
    "index": 43,
    "timeCode": "April 18, 2013, 11:26:56 AM",
    "reply": 36,
    "user": "43n78",
    "content": "I think that the whole structure regarding insurance needs to be revamped. However, to ensure that everybody has access to healthcare is costly and therefore requires funds, hence making sure that everybody has insurance. These funds can also be raised via taxes, or subsidizing doctors.",
    "contentSimp": "structure insurance revamped. however, ensure access healthcare costly requires funds, making insurance. funds raised taxes, subsidizing doctors."
  },
  {
    "index": 44,
    "timeCode": "April 18, 2013, 11:30:29 AM",
    "reply": -1,
    "user": "43n78",
    "content": "Certain industries should compensate their workers with full healthcare benefits. It is more likely for someone working around nuclear reactors, for instance, to contract cancer from the radiation. These companies should be fully liable for their workers' healthcare costs.",
    "contentSimp": "industries compensate workers full healthcare benefits. working nuclear reactors, instance, contract cancer radiation. companies fully liable workers' healthcare costs."
  },
  {
    "index": 45,
    "timeCode": "April 19, 2013, 11:10:07 AM",
    "reply": -1,
    "user": "18n33",
    "content": "exactly. like maybe make a free information clinic for preventions awareness",
    "contentSimp": "exactly. make free information clinic preventions awareness"
  },
  {
    "index": 46,
    "timeCode": "April 19, 2013, 11:12:14 AM",
    "reply": -1,
    "user": "18n33",
    "content": "i agree. it doesnt help when the things that are healthy for the body costs more than the things that are bad.",
    "contentSimp": "agree. things healthy body costs things bad."
  },
  {
    "index": 47,
    "timeCode": "April 19, 2013, 11:15:00 AM",
    "reply": 44,
    "user": "18n33",
    "content": "i agree. the more dangerous or health-risk the job is, the more the company should help with health care.",
    "contentSimp": "agree. dangerous health-risk job is, company health care."
  },
  {
    "index": 48,
    "timeCode": "April 19, 2013, 11:20:14 AM",
    "reply": -1,
    "user": "18n33",
    "content": "when it comes to pharmaceuticals, i think that should coincide with my previous idea that it should be taken away from the governments hand and into the hands of the companies people are employed for. along with getting health care, this should also cover medicines needed to be able to return to work healthy. employers don't want to have employees being out sick all the time, so this in itself will be incentive to having a good health care company set up for their employees. ",
    "contentSimp": "pharmaceuticals, coincide previous idea governments hand hands companies people employed for. health care, cover medicines needed return work healthy. employers don't employees sick time, incentive good health care company set employees. "
  },
  {
    "index": 49,
    "timeCode": "April 19, 2013, 11:25:55 AM",
    "reply": 42,
    "user": "18n33",
    "content": "private companies will have the incentive of wanting their employees in their best health state, so this would make them choose a proper and effective health care plan without killing their pockets. also the fact that it is the companies job to provide for health care and not the government will help force the people who are riding on government money and peoples taxes for health and food to go out and actually look for a real job. so this in itself will decrease unemployment. lastly i agree government will have to help a little for the people who just are having bad luck with a job, but this should be a minimal hand, and for a minimal time period. at most maybe 6 months, that way people don't take advantage of our government, and make it fair for the people that work hard for their money and have to give out big taxes because other people don't have jobs. so total this would 1. increase quality. 2. decrease unemployment 3. decrease taxes. this is america, land of opportunity, not land of free-loaders.",
    "contentSimp": "private companies incentive wanting employees health state, make choose proper effective health care plan killing pockets. fact companies job provide health care government force people riding government money peoples taxes health food real job. decrease unemployment. lastly agree government people bad luck job, minimal hand, minimal time period. 6 months, people don't advantage government, make fair people work hard money give big taxes people don't jobs. total 1. increase quality. 2. decrease unemployment 3. decrease taxes. america, land opportunity, land free-loaders."
  },
  {
    "index": 50,
    "timeCode": "April 19, 2013, 12:01:10 PM",
    "reply": -1,
    "user": "99n32",
    "content": "Most Americans who are not covered are young adults in college. This is because health insurance can be too expensive even at the minimum coverage plan. I propose that young adults should be covered under their parent's insurance until the age of 25. This should not raised the price high on the parents because people in this age group tend to be healthier.",
    "contentSimp": "americans covered young adults college. health insurance expensive minimum coverage plan. propose young adults covered parent's insurance age 25. raised price high parents people age group tend healthier."
  },
  {
    "index": 51,
    "timeCode": "April 19, 2013, 12:05:35 PM",
    "reply": -1,
    "user": "99n32",
    "content": "Raising the quality of medicine and care should be our top priority. Doctors should praise  not by the amount of  patients they treat, but the quality of healthcare they give to the patient. Most doctors today get paid regardless on how well they treat you. This should be reformed!",
    "contentSimp": "raising quality medicine care top priority. doctors praise  amount of  patients treat, quality healthcare give patient. doctors today paid treat you. reformed!"
  }
]