[{
  "index": 0,
  "timeCode": "March 25, 2013, 01:29:30 PM",
  "reply": -1,
  "user": "88a51",
  "content": "The health care system should finance more money the people who are less healthy and ill or have some sort of disease and not as much to the people who are regularly healthy",
  "contentSimp": "health care system finance money people healthy sort disease people regularly healthy"
}, {
  "index": 1,
  "timeCode": "March 25, 2013, 01:36:48 PM",
  "reply": 0,
  "user": "88a51",
  "content": "with the exception of the elderly and the youth",
  "contentSimp": "exception elderly youth"
}, {
  "index": 2,
  "timeCode": "March 25, 2013, 01:39:45 PM",
  "reply": -1,
  "user": "88a51",
  "content": "Every health insurance in America should provide 2 to 3 free clinical check ups for a family of 3 or more, and 1 to 2 for single households.",
  "contentSimp": "health insurance america provide 2 3 free clinical check ups family 3 more, 1 2 single households."
}, {
  "index": 3,
  "timeCode": "March 25, 2013, 01:51:51 PM",
  "reply": -1,
  "user": "88a51",
  "content": "medicare\/medicaid should be equal people of all income but at the same time affordable",
  "contentSimp": "medicare\/medicaid equal people income time affordable"
}, {
  "index": 4,
  "timeCode": "March 25, 2013, 03:17:34 PM",
  "reply": -1,
  "user": "8a52",
  "content": "Insurance companies should make the co-payments based upon yearly household income.",
  "contentSimp": "insurance companies make co-payments based yearly household income."
}, {
  "index": 5,
  "timeCode": "March 25, 2013, 03:18:26 PM",
  "reply": 3,
  "user": "8a52",
  "content": "This will help with people actually staying current on their health.",
  "contentSimp": "people staying current health."
}, {
  "index": 6,
  "timeCode": "March 25, 2013, 03:19:32 PM",
  "reply": -1,
  "user": "8a52",
  "content": "Medicare\/Medicaid should get a \"flex card\" with so much money on it yearly so that will be able to pay for at least their prescriptions.",
  "contentSimp": "medicare\/medicaid \"flex card\" money yearly pay prescriptions."
}, {
  "index": 7,
  "timeCode": "March 25, 2013, 03:21:47 PM",
  "reply": -1,
  "user": "8a52",
  "content": "When prescribed drugs the doctor should have a bar code to scan so you can get them refilled more conveniently when you want to get the prescription filled at the drug store. This way the pharmacist can monitor what drugs you are getting and how much.",
  "contentSimp": "prescribed drugs doctor bar code scan refilled conveniently prescription filled drug store. pharmacist monitor drugs much."
}, {
  "index": 8,
  "timeCode": "March 25, 2013, 03:23:36 PM",
  "reply": -1,
  "user": "8a52",
  "content": "Physicians should evaluate and give tips to people who say they are having problems with certain issues before just automatically diagnose them with some disease that causes them to have to take medicine that they can become dependent on and start to abuse.",
  "contentSimp": "physicians evaluate give tips people problems issues automatically diagnose disease medicine dependent start abuse."
}, {
  "index": 9,
  "timeCode": "March 25, 2013, 03:24:48 PM",
  "reply": -1,
  "user": "8a52",
  "content": "People with chronic illnesses should have specialists with reasonable prices so physicians can monitor their health more efficiently.",
  "contentSimp": "people chronic illnesses specialists reasonable prices physicians monitor health efficiently."
}, {
  "index": 10,
  "timeCode": "March 25, 2013, 03:25:42 PM",
  "reply": -1,
  "user": "8a52",
  "content": "All doctors and physicians should have a small pharmacist that will be convenient for the patient to get their prescriptions refilled.",
  "contentSimp": "doctors physicians small pharmacist convenient patient prescriptions refilled."
}, {
  "index": 11,
  "timeCode": "March 25, 2013, 03:26:55 PM",
  "reply": -1,
  "user": "8a52",
  "content": "Physicians need to go to seminars and small courses to stay current on new things in the health world and what type of diseases have been detected lately so that less misdiagnosing occurs.",
  "contentSimp": "physicians seminars small courses stay current things health world type diseases detected misdiagnosing occurs."
}, {
  "index": 12,
  "timeCode": "March 25, 2013, 03:30:22 PM",
  "reply": -1,
  "user": "8a52",
  "content": "Emergency room visits should be less expensive. And pharmacies should have a small in and out clinics with reasonable prices for emergencies less severe than hospital attention for anyone with or without insurance.",
  "contentSimp": "emergency room visits expensive. pharmacies small clinics reasonable prices emergencies severe hospital attention insurance."
}, {
  "index": 13,
  "timeCode": "March 25, 2013, 03:32:49 PM",
  "reply": -1,
  "user": "8a52",
  "content": "Nursing homes should be covered by Medicare since some elderly do not have family that can afford it but need their loved ones to be monitored.",
  "contentSimp": "nursing homes covered medicare elderly family afford loved monitored."
}, {
  "index": 14,
  "timeCode": "March 25, 2013, 03:35:13 PM",
  "reply": -1,
  "user": "8a52",
  "content": "The government could pull out all money going into the healthcare system and the country would just have to build itself back up by people helping each other out.",
  "contentSimp": "government pull money healthcare system country build back people helping out."
}, {
  "index": 15,
  "timeCode": "March 25, 2013, 03:36:11 PM",
  "reply": -1,
  "user": "8a52",
  "content": "People with chronic illnesses should seek the medical attention that they need no matter the financial situation.",
  "contentSimp": "people chronic illnesses seek medical attention matter financial situation."
}, {
  "index": 16,
  "timeCode": "March 25, 2013, 03:38:27 PM",
  "reply": -1,
  "user": "8a52",
  "content": "All drugs should have a generic brand offered so people won't have to pay so much for the medicines that they need.",
  "contentSimp": "drugs generic brand offered people won't pay medicines need."
}, {
  "index": 17,
  "timeCode": "March 25, 2013, 03:39:27 PM",
  "reply": -1,
  "user": "8a52",
  "content": "Birth control should be free so that pregnancies will decrease and Medicaid won't have to provide for that person and the unborn child as well. ",
  "contentSimp": "birth control free pregnancies decrease medicaid won't provide person unborn child well. "
}, {
  "index": 18,
  "timeCode": "March 25, 2013, 03:45:51 PM",
  "reply": -1,
  "user": "8a52",
  "content": "Seeing a dietician or a nutritionist should be free at least once a year so maybe that will cut back on visiting the primary doctor so much because natural health is sufficient and they are less likely to get ill.",
  "contentSimp": "dietician nutritionist free year cut back visiting primary doctor natural health sufficient ill."
}, {
  "index": 19,
  "timeCode": "March 26, 2013, 12:28:53 PM",
  "reply": -1,
  "user": "36a53",
  "content": "There should be a universal healthcare system. Insurance companies are a big problem today",
  "contentSimp": "universal healthcare system. insurance companies big problem today"
}, {
  "index": 20,
  "timeCode": "March 26, 2013, 12:33:09 PM",
  "reply": -1,
  "user": "36a53",
  "content": "Physicians misdiagnosing patients is happening more often. The physicians should be evaluated regulary so it reduces the risk",
  "contentSimp": "physicians misdiagnosing patients happening often. physicians evaluated regulary reduces risk"
}, {
  "index": 21,
  "timeCode": "March 26, 2013, 12:39:29 PM",
  "reply": 17,
  "user": "36a53",
  "content": "Women clinics should be readily available and more awareness to prevent diseases\/cancers",
  "contentSimp": "women clinics readily awareness prevent diseases\/cancers"
}, {
  "index": 22,
  "timeCode": "March 26, 2013, 12:48:03 PM",
  "reply": 9,
  "user": "36a53",
  "content": "Being able to visit specialists with reasonable prices will also help in the long run--illness could improve or caught early before worsens, and less trips to a physician who could possibly not know what is wrong",
  "contentSimp": "visit specialists reasonable prices long run--illness improve caught early worsens, trips physician possibly wrong"
}, {
  "index": 23,
  "timeCode": "March 26, 2013, 12:51:37 PM",
  "reply": -1,
  "user": "36a53",
  "content": "Physicians should pay attention more to figuring out the cause of a particular problem rather than prescribing drugs to alleviate symptoms--more money gone to drugs and illness not cured",
  "contentSimp": "physicians pay attention figuring problem prescribing drugs alleviate symptoms--more money drugs illness cured"
}, {
  "index": 24,
  "timeCode": "March 26, 2013, 01:21:29 PM",
  "reply": -1,
  "user": "80a54",
  "content": "I think that people who have mental illnesses should be able to see a doctor or specialist at a reasonable cost",
  "contentSimp": "people mental illnesses doctor specialist reasonable cost"
}, {
  "index": 25,
  "timeCode": "March 26, 2013, 01:22:24 PM",
  "reply": 23,
  "user": "80a54",
  "content": "True, because sometimes money for drugs could result in substance abuse for certain cases.",
  "contentSimp": "true, money drugs result substance abuse cases."
}, {
  "index": 26,
  "timeCode": "March 26, 2013, 01:23:30 PM",
  "reply": 22,
  "user": "80a54",
  "content": "Exactly. Saving both time and money without wasting the resources that the government has supplied.",
  "contentSimp": "exactly. saving time money wasting resources government supplied."
}, {
  "index": 27,
  "timeCode": "March 26, 2013, 01:25:10 PM",
  "reply": 21,
  "user": "80a54",
  "content": "I agree because it is ultimately up to the woman to decide for herself whether or not to have the baby and the risks that go along with it.",
  "contentSimp": "agree ultimately woman decide baby risks it."
}, {
  "index": 28,
  "timeCode": "March 26, 2013, 01:26:51 PM",
  "reply": -1,
  "user": "80a54",
  "content": "Seeing a dietician\/nutritionist would also give the person a better picture as to where their health is, and how to improve it, to avoid going to the doctor at all.",
  "contentSimp": "dietician\/nutritionist give person picture health is, improve it, avoid doctor all."
}, {
  "index": 29,
  "timeCode": "March 26, 2013, 01:28:07 PM",
  "reply": 3,
  "user": "80a54",
  "content": "I agree, but I feel that for those unemployed or have no intention of getting a job may have an issue paying it.",
  "contentSimp": "agree, feel unemployed intention job issue paying it."
}, {
  "index": 30,
  "timeCode": "March 26, 2013, 01:30:45 PM",
  "reply": -1,
  "user": "80a54",
  "content": "I think that emergency room visits should be free, if the emergency is one of actual concern. Not an \"emergency\" involving a headache or stomach problems that could be solved with over the counter medication, but rather emergencies involving deep cuts or severe infections.",
  "contentSimp": "emergency room visits free, emergency actual concern. \"emergency\" involving headache stomach problems solved counter medication, emergencies involving deep cuts severe infections."
}, {
  "index": 31,
  "timeCode": "March 26, 2013, 01:34:39 PM",
  "reply": 7,
  "user": "80a54",
  "content": "I agree, because doing so would make the system more efficient without sending people away who actually need it. Also, you could get a better tab on how much of the substance is being used, and the doctor can tell if the patient is abusing the substance or not.",
  "contentSimp": "agree, make system efficient sending people it. also, tab substance used, doctor patient abusing substance not."
}, {
  "index": 32,
  "timeCode": "March 26, 2013, 01:37:08 PM",
  "reply": -1,
  "user": "80a54",
  "content": "I think that every hospital or clinic should offer health care because people can't always get to the specific provider they have listed in their insurance. They could also need serious medical attention and not be able to get it at an affordable price.",
  "contentSimp": "hospital clinic offer health care people can't specific provider listed insurance. medical attention affordable price."
}, {
  "index": 33,
  "timeCode": "March 26, 2013, 01:40:17 PM",
  "reply": 0,
  "user": "80a54",
  "content": "Also, the mentally ill\/disabled",
  "contentSimp": "also, mentally ill\/disabled"
}, {
  "index": 34,
  "timeCode": "March 26, 2013, 01:41:54 PM",
  "reply": -1,
  "user": "80a54",
  "content": "Maybe they could also get coupons or cards allowing them to get a discounted visit to the doctor, or see a specialist.",
  "contentSimp": "coupons cards allowing discounted visit doctor, specialist."
}, {
  "index": 35,
  "timeCode": "March 26, 2013, 01:44:29 PM",
  "reply": -1,
  "user": "80a54",
  "content": "True, so they won't be wasting money on false diagnoses. This would also make the system more reliable to the public, knowing that doctors have to stay current with the diseases and their symptoms.",
  "contentSimp": "true, won't wasting money false diagnoses. make system reliable public, knowing doctors stay current diseases symptoms."
}, {
  "index": 36,
  "timeCode": "March 28, 2013, 11:47:58 AM",
  "reply": -1,
  "user": "56a55",
  "content": "The healthcare system must be changed in some features: The healthcare cost must be reduced as much as it is to help the low income or unemployed people or family to afford. OBAMA Care should be forced to bring the best health care services to everybody regardless their ability to pay for the Hospital bill In the education system, the doctors, specialists, or practitioners should be deep educated and good trained as well to give the best service to the patient and their family and I think this part is Okay. In order to save time and money, medical technology should be given and improve to give the best health care service for patients. For example, like we can use the robots instead of doctors to do an surgery, or using new invented radiology scanner to reduce the radio way, UV ray, ultrasound wave, etc. Everybody should be given the equal health care services as the cost should be low like in Canada, or Australia. Insurance, as in Obama Care that all people must obtain it regardless they never get sick. Although it may affect to the health service, but people will have more option in taking care their health more efficiency. Moreover, the education should teach all the doctors, physicians, specialist, nurses, or any people who work in the healthcare that the patient health is the most important than anything else, instead of taking their insurance or making a fast diagnostic. And I am looking for this aspect because as I see, there is not many doctors, physician, specialists, or nurses pay attention to this particular topic. Medicine should be lowered in price as in the generic medication that everybody can afford to buy though they have insurance or not. And this may help people more taking care for their health. Lastly, maintaining a good health is the best way to make we live better and we don't need to get the healthcare services every time we get sick unless we are getting old and need people to take care.",
  "contentSimp": "healthcare system changed features: healthcare cost reduced low income unemployed people family afford. obama care forced bring health care services ability pay hospital bill education system, doctors, specialists, practitioners deep educated good trained give service patient family part okay. order save time money, medical technology improve give health care service patients. example, robots doctors surgery, invented radiology scanner reduce radio way, uv ray, ultrasound wave, etc. equal health care services cost low canada, australia. insurance, obama care people obtain sick. affect health service, people option taking care health efficiency. moreover, education teach doctors, physicians, specialist, nurses, people work healthcare patient health important else, taking insurance making fast diagnostic. aspect see, doctors, physician, specialists, nurses pay attention topic. medicine lowered price generic medication afford buy insurance not. people taking care health. lastly, maintaining good health make live don't healthcare services time sick people care."
}, {
  "index": 37,
  "timeCode": "March 28, 2013, 11:52:09 AM",
  "reply": -1,
  "user": "56a55",
  "content": "i agree because the women needs to be treated fairly as men and other aspects like age, gender, sexuality, education, family background, etc.",
  "contentSimp": "agree women treated fairly men aspects age, gender, sexuality, education, family background, etc."
}, {
  "index": 38,
  "timeCode": "March 28, 2013, 11:53:34 AM",
  "reply": 16,
  "user": "56a55",
  "content": "I think the generic should be get off to let the main one reduce in cost",
  "contentSimp": "generic main reduce cost"
}, {
  "index": 39,
  "timeCode": "April 01, 2013, 03:09:22 PM",
  "reply": -1,
  "user": "8a52",
  "content": "This would reduce the cost of the prescribed drug then people would be able to afford it as well as have the oppurtunity to actually buy the medication that they need to take on a regular basis.",
  "contentSimp": "reduce cost prescribed drug people afford oppurtunity buy medication regular basis."
}, {
  "index": 40,
  "timeCode": "April 01, 2013, 03:11:00 PM",
  "reply": -1,
  "user": "8a52",
  "content": "More clinics similar to Care-Now should be open but they should have family medicine doctors there so that misdiagnosing will be less likely to occur and the prescribing of drugs will be less likely to happen",
  "contentSimp": "clinics similar care-now open family medicine doctors misdiagnosing occur prescribing drugs happen"
}, {
  "index": 41,
  "timeCode": "April 01, 2013, 03:13:52 PM",
  "reply": -1,
  "user": "8a52",
  "content": "Physicians should be monitored on what and how much they are prescribing to their patients because this may crack down on them getting certain drugs for promotional purposes and receiving things from the drug companies that they would normally not get if they were not prescribing these drugs. It is all about the money in these cases so some doctors really are not considered with their patients health.",
  "contentSimp": "physicians monitored prescribing patients crack drugs promotional purposes receiving things drug companies prescribing drugs. money cases doctors considered patients health."
}, {
  "index": 42,
  "timeCode": "April 01, 2013, 03:16:46 PM",
  "reply": -1,
  "user": "8a52",
  "content": "Less immunizations might help people to actually be able to fight off some of these diseases that they are trying to prevent from coming back since new ones are introduced all the time.",
  "contentSimp": "immunizations people fight diseases prevent coming back introduced time."
}, {
  "index": 43,
  "timeCode": "April 01, 2013, 03:17:41 PM",
  "reply": -1,
  "user": "8a52",
  "content": "More studies should go into looking at the patterns and trends of certain outbreaks globally and try to figure out a way to prevent them from continuously spreading.",
  "contentSimp": "studies patterns trends outbreaks globally figure prevent continuously spreading."
}, {
  "index": 44,
  "timeCode": "April 01, 2013, 03:20:07 PM",
  "reply": -1,
  "user": "8a52",
  "content": "HIV\/AIDS patients should get coupons on their medications and also have an affordable specialized doctor to visit for regular check-ups. Also, they can be used for the process of trying to find a cure for the disease.",
  "contentSimp": "hiv\/aids patients coupons medications affordable specialized doctor visit regular check-ups. also, process find cure disease."
}, {
  "index": 45,
  "timeCode": "April 01, 2013, 03:21:33 PM",
  "reply": -1,
  "user": "8a52",
  "content": "More restrictions should be placed on receiving Medicaid so that people who are lazy and really just want to rely on the government for help will be less likely to get it.",
  "contentSimp": "restrictions receiving medicaid people lazy rely government it."
}, {
  "index": 46,
  "timeCode": "April 01, 2013, 03:25:04 PM",
  "reply": -1,
  "user": "88a51",
  "content": "There should be more pharmacy with a local doctor or physician to conveniently get your medication and check-up at the same time",
  "contentSimp": "pharmacy local doctor physician conveniently medication check-up time"
}, {
  "index": 47,
  "timeCode": "April 02, 2013, 11:20:30 AM",
  "reply": -1,
  "user": "56a55",
  "content": "Another thing, I would like to mention from the previous post, they are: To the Disable people, HIV\/AIDS patients, etc. serious diseases, they must to be treated fairly and appropriate to the normal people, or may be better than those because they are even weaker and depress for along time may be the whole life even with mental, physical, or social health. To the LGBT community, they also needs to be treated equally to other people regardless race, age, background, etc. And this is the task of the health care providers who are responsible in providing them the best quality health service. People who is in the Nursing home would be suffered so many problems and can't get away from aging, so they need to have a good care even about mental, physical, and social health treatment to make them enjoy the rest of life. It should be more health care show or programs as many health issue commercials to everyone to make an announcement or warning about any thing related to health like overdosing, street drug, eating habitat, passive life style, unhealthy behaviors,smoking, drinking, STDs, HIV thread, etc. There are now many and many case of rape related in the healthcare system, so it needs to pass a law or some restriction rules to reduce this issue as guaranteed the good working environment to all healthcare employees.",
  "contentSimp": "thing, mention previous post, are: disable people, hiv\/aids patients, etc. diseases, treated fairly normal people, weaker depress time life mental, physical, social health. lgbt community, treated equally people race, age, background, etc. task health care providers responsible providing quality health service. people nursing home suffered problems can't aging, good care mental, physical, social health treatment make enjoy rest life. health care show programs health issue commercials make announcement warning thing related health overdosing, street drug, eating habitat, passive life style, unhealthy behaviors,smoking, drinking, stds, hiv thread, etc. case rape related healthcare system, pass law restriction rules reduce issue guaranteed good working environment healthcare employees."
}, {
  "index": 48,
  "timeCode": "April 02, 2013, 11:25:30 AM",
  "reply": -1,
  "user": "56a55",
  "content": "Yes, but not all people are like what you say. As I know there are so many people who are very lazy and dependence, but there are also people who get really sick and serious illness that they can not afford by themselves to pay for the medication as well as other health issues",
  "contentSimp": "yes, people say. people lazy dependence, people sick illness afford pay medication health issues"
}, {
  "index": 49,
  "timeCode": "April 02, 2013, 11:26:32 AM",
  "reply": 46,
  "user": "56a55",
  "content": "I agree with you, it needs to have more to get the better health service and even though saving time and money.",
  "contentSimp": "agree you, health service saving time money."
}, {
  "index": 50,
  "timeCode": "April 02, 2013, 12:37:52 PM",
  "reply": 47,
  "user": "80a54",
  "content": "I agree. Although healthcare covers most things, these specialized areas shouldn't be neglected, and should also recieve the same ammount of care, if not more, than the amount given in general healthcare.",
  "contentSimp": "agree. healthcare covers things, specialized areas shouldn't neglected, recieve ammount care, more, amount general healthcare."
}, {
  "index": 51,
  "timeCode": "April 02, 2013, 12:50:35 PM",
  "reply": -1,
  "user": "80a54",
  "content": " ",
  "contentSimp": " "
}, {
  "index": 52,
  "timeCode": "April 08, 2013, 01:10:56 PM",
  "reply": -1,
  "user": "8a52",
  "content": "Regular check ups on physicians should be required to make sure that they still have morals and values and really do care about the patients rather than they're paychecks.",
  "contentSimp": "regular check ups physicians required make morals values care patients they're paychecks."
}, {
  "index": 53,
  "timeCode": "April 08, 2013, 01:13:21 PM",
  "reply": -1,
  "user": "8a52",
  "content": "The new technology would also reduce the amount of time that surgery would or regular everyday visits would take. Also with new things coming out there should be seminars for them to be displayed so that the doctors have a chance of purchasing them.",
  "contentSimp": "technology reduce amount time surgery regular everyday visits take. things coming seminars displayed doctors chance purchasing them."
}, {
  "index": 54,
  "timeCode": "April 08, 2013, 01:16:37 PM",
  "reply": -1,
  "user": "8a52",
  "content": "Support groups for people that are chronically ill should be provided by the government so that they have a better chance of thriving in life and not just to know that other people suffer but that they can help each other live a healthier lifestyle to try and relieve some pain and maybe even live longer.",
  "contentSimp": "support groups people chronically provided government chance thriving life people suffer live healthier lifestyle relieve pain live longer."
}, {
  "index": 55,
  "timeCode": "April 08, 2013, 01:18:18 PM",
  "reply": -1,
  "user": "8a52",
  "content": "If Medicare\/Medicaid would crack down on the system and actually administer to the people who need it then taxes would probably go down because the government would not have to put so much money towards the healthcare system.",
  "contentSimp": "medicare\/medicaid crack system administer people taxes government put money healthcare system."
}, {
  "index": 56,
  "timeCode": "April 08, 2013, 01:20:24 PM",
  "reply": -1,
  "user": "8a52",
  "content": "Assistant living for the elderly should be more affordable so that the nursing homes will not be so crowded, because some elderly people resort to the nursing home since that is all they're insurance will cover.",
  "contentSimp": "assistant living elderly affordable nursing homes crowded, elderly people resort nursing home they're insurance cover."
}, {
  "index": 57,
  "timeCode": "April 08, 2013, 01:22:57 PM",
  "reply": -1,
  "user": "8a52",
  "content": "Maintaining a good healthcare system is the key reason so maybe the government should really evaluate this area more than all the other ones.",
  "contentSimp": "maintaining good healthcare system key reason government evaluate area ones."
}, {
  "index": 58,
  "timeCode": "April 09, 2013, 11:19:46 AM",
  "reply": -1,
  "user": "56a55",
  "content": "The budget for the healthcare services is reducing. So it needs to be considered to increase that amount of money. If the citizens are healthy, that means the country is also \"healthy\" too. Some new researches in Health science should be encouraged and granted by the governments or other foundations help the young new scientists to find the new methods and better cures for the patients or even a whole healthcare systems. Working hard will Many people are complaining about the healthcare insurance, not Medicare or Medicaid, so, there has to be some social benefits to qualify for those who are not getting enough financial supports for it. There must be some new hospitals build to server enough for the increasing patients where the old one is insufficient and does not well-qualified for the whole service. Any specialists or nurses who violate the policy or rules must be charged based on the scale of what errors they make during the healthcare services as will be a good model for others to obey and minimize the errors from little to zero.",
  "contentSimp": "budget healthcare services reducing. considered increase amount money. citizens healthy, means country \"healthy\" too. researches health science encouraged granted governments foundations young scientists find methods cures patients healthcare systems. working hard people complaining healthcare insurance, medicare medicaid, so, social benefits qualify financial supports it. hospitals build server increasing patients insufficient well-qualified service. specialists nurses violate policy rules charged based scale errors make healthcare services good model obey minimize errors zero."
}, {
  "index": 59,
  "timeCode": "April 09, 2013, 11:21:24 AM",
  "reply": -1,
  "user": "56a55",
  "content": "I agree with you. even there are some people who cheat on this to get the free benefits for them.",
  "contentSimp": "agree you. people cheat free benefits them."
}, {
  "index": 60,
  "timeCode": "April 09, 2013, 11:23:18 AM",
  "reply": 56,
  "user": "56a55",
  "content": "Healthcare services is such a business where people who are insured will get the best service as they pay for what they receive.",
  "contentSimp": "healthcare services business people insured service pay receive."
}, {
  "index": 61,
  "timeCode": "April 09, 2013, 11:25:31 AM",
  "reply": -1,
  "user": "56a55",
  "content": "That would be great! But people are in the way of busy working life so it needs the quick and fast service to serve as many people as it is and done well!",
  "contentSimp": "great! people busy working life quick fast service serve people well!"
}, {
  "index": 62,
  "timeCode": "April 09, 2013, 12:08:15 PM",
  "reply": -1,
  "user": "80a54",
  "content": "Yes I agree. In doing so, it would also reduce the funds required for those who don't care as much, for funding should only go to those who actually care.",
  "contentSimp": "agree. so, reduce funds required don't care much, funding care."
}, {
  "index": 63,
  "timeCode": "April 09, 2013, 12:11:22 PM",
  "reply": -1,
  "user": "80a54",
  "content": "This method sounds pretty solid in my opinion. The only problem is that sometimes there are more sick people than anticipated, and there isn't enough healthcare to deal with the amount of sickness that is presented.",
  "contentSimp": "method sounds pretty solid opinion. problem sick people anticipated, isn't healthcare deal amount sickness presented."
}, {
  "index": 64,
  "timeCode": "April 09, 2013, 12:18:41 PM",
  "reply": -1,
  "user": "80a54",
  "content": "As technology grows more advanced day after day, at some point there is going to be a way to monitor all of those who truly need healthcare. Hopefully people can do all of the necessary things to get the help they need, and get on track to becoming healthier. At this time, there should also be enough medication and staff to deal with those that need healthcare, for without the staff and supplies, healthcare will decrease, and more people will remain sick and die. At the rate technology is evolving, there should already be a system, unfortunately not everyone can be trusted with medication and the help that the staff provides.",
  "contentSimp": "technology grows advanced day day, point monitor healthcare. people things need, track healthier. time, medication staff deal healthcare, staff supplies, healthcare decrease, people remain sick die. rate technology evolving, system, trusted medication staff provides."
}, {
  "index": 65,
  "timeCode": "April 09, 2013, 01:37:06 PM",
  "reply": 30,
  "user": "36a53",
  "content": "But it will be very difficult to draw the line of what will fit under \"emergency\" if those visits are free completely. It should probably be at a more reasonable cost instead.",
  "contentSimp": "difficult draw line fit \"emergency\" visits free completely. reasonable cost instead."
}, {
  "index": 66,
  "timeCode": "April 09, 2013, 01:45:11 PM",
  "reply": -1,
  "user": "36a53",
  "content": "I think medical research is a big factor in providing adequate healthcare. More funding should be available to researchers to find cures for diseases, new techniques for procedures, new drugs, and ways to prevent illnesses.",
  "contentSimp": "medical research big factor providing adequate healthcare. funding researchers find cures diseases, techniques procedures, drugs, ways prevent illnesses."
}, {
  "index": 67,
  "timeCode": "April 09, 2013, 01:53:35 PM",
  "reply": 46,
  "user": "36a53",
  "content": "I don't think that having a pharmacy and physician together will really make that much of a difference. there are more important things than making it \"convenient\" for the patient so they don't have to drive to a pharmacy. I'd rather have a more fit physician and pharmacist instead.",
  "contentSimp": "don't pharmacy physician make difference. important things making \"convenient\" patient don't drive pharmacy. i'd fit physician pharmacist instead."
}, {
  "index": 68,
  "timeCode": "April 10, 2013, 01:40:37 PM",
  "reply": -1,
  "user": "88a51",
  "content": "I agree and the more technology advances the more job opportunities for people without jobs leading to less dependent people on healthcare.",
  "contentSimp": "agree technology advances job opportunities people jobs leading dependent people healthcare."
}, {
  "index": 69,
  "timeCode": "April 10, 2013, 01:51:34 PM",
  "reply": 67,
  "user": "88a51",
  "content": "I agree on more research towards diseases which is one of the main sources of healthcare because if a cure is discovered then it gives the people who are ill to live healthy lives and get back on their feet.",
  "contentSimp": "agree research diseases main sources healthcare cure discovered people live healthy lives back feet."
}]
