[{"index":0,"timeCode":"April 11, 2013, 03:55:52 PM","reply":-1,"user":"43z78","content":"Giving people health insurance that they can afford","contentSimp":"giving people health insurance afford"},{"index":1,"timeCode":"April 11, 2013, 03:56:13 PM","reply":-1,"user":"43z78","content":"Shorter waiting times in the ER","contentSimp":"shorter waiting times er"},{"index":2,"timeCode":"April 11, 2013, 03:56:51 PM","reply":-1,"user":"43z78","content":"Better service in the ER","contentSimp":"service er"},{"index":3,"timeCode":"April 11, 2013, 03:57:15 PM","reply":2,"user":"43z78","content":"Nicer nurses and doctors","contentSimp":"nicer nurses doctors"},{"index":4,"timeCode":"April 11, 2013, 03:58:26 PM","reply":-1,"user":"43z78","content":"Faster\/better service in doctor offices","contentSimp":"faster\/better service doctor offices"},{"index":5,"timeCode":"April 11, 2013, 03:59:45 PM","reply":-1,"user":"43z78","content":"Hiring nurses who are fully trained in order to provide the best patient care","contentSimp":"hiring nurses fully trained order provide patient care"},{"index":6,"timeCode":"April 11, 2013, 04:00:26 PM","reply":-1,"user":"43z78","content":"Giving people medicine that they can afford","contentSimp":"giving people medicine afford"},{"index":7,"timeCode":"April 11, 2013, 04:01:15 PM","reply":-1,"user":"43z78","content":"Making a visit to the doctors office or ER easier for those who do not have insurance","contentSimp":"making visit doctors office er easier insurance"},{"index":8,"timeCode":"April 11, 2013, 04:02:50 PM","reply":-1,"user":"43z78","content":"Giving families the option to keep their family member on life support longer","contentSimp":"giving families option family member life support longer"},{"index":9,"timeCode":"April 11, 2013, 04:04:05 PM","reply":-1,"user":"43z78","content":"Create certain clinics for certain age groups to insure that everyone is seen quicker","contentSimp":"create clinics age groups insure quicker"},{"index":10,"timeCode":"April 11, 2013, 04:06:33 PM","reply":-1,"user":"43z78","content":"Create ways that give people who are sick a way to wait at home until they can be seen so that they can avoid spreading germs.","contentSimp":"create ways give people sick wait home avoid spreading germs."},{"index":11,"timeCode":"April 11, 2013, 04:07:43 PM","reply":-1,"user":"43z78","content":"Provide better sanitary in schools and on jobs so that people can avoid getting sick.","contentSimp":"provide sanitary schools jobs people avoid sick."},{"index":12,"timeCode":"April 11, 2013, 04:08:25 PM","reply":-1,"user":"43z78","content":"Make vitamins free","contentSimp":"make vitamins free"},{"index":13,"timeCode":"April 11, 2013, 04:08:58 PM","reply":-1,"user":"43z78","content":"Have classes were people can learn how to take care of themselves","contentSimp":"classes people learn care"},{"index":14,"timeCode":"April 11, 2013, 04:09:18 PM","reply":-1,"user":"43z78","content":"Provide faster ambulance and fire truck services","contentSimp":"provide faster ambulance fire truck services"},{"index":15,"timeCode":"April 11, 2013, 04:10:16 PM","reply":-1,"user":"43z78","content":"Create more fire stations and hire more workers who are properly trained to complete the tasks that come with the job.","contentSimp":"create fire stations hire workers properly trained complete tasks job."},{"index":16,"timeCode":"April 11, 2013, 04:12:17 PM","reply":-1,"user":"43z78","content":"Give people better healthcare insurance options at their jobs","contentSimp":"give people healthcare insurance options jobs"},{"index":17,"timeCode":"April 11, 2013, 04:14:41 PM","reply":-1,"user":"43z78","content":"Create ways to make sure that everyone has insurance that they can afford. If they do not have insurance, then go out door to door and tell them options that they have and why insurance is a must.","contentSimp":"create ways make insurance afford. insurance, door door options insurance must."},{"index":18,"timeCode":"April 11, 2013, 04:16:27 PM","reply":-1,"user":"43z78","content":"Build more hospitals","contentSimp":"build hospitals"},{"index":19,"timeCode":"April 11, 2013, 04:19:14 PM","reply":-1,"user":"43z78","content":"Provide better service in nursing homes","contentSimp":"provide service nursing homes"},{"index":20,"timeCode":"April 11, 2013, 04:55:42 PM","reply":-1,"user":"99z32","content":"reduce the profitability of pharmaceutical drugs to drive the cost of medication down","contentSimp":"reduce profitability pharmaceutical drugs drive cost medication"},{"index":21,"timeCode":"April 11, 2013, 04:56:24 PM","reply":-1,"user":"99z32","content":"legalize marijuana to be used as a \"better\" alternative to certain psychiatric drugs","contentSimp":"legalize marijuana \"better\" alternative psychiatric drugs"},{"index":22,"timeCode":"April 11, 2013, 04:58:14 PM","reply":-1,"user":"99z32","content":"hospitals and doctors be held harshly accountable for malpractice","contentSimp":"hospitals doctors held harshly accountable malpractice"},{"index":23,"timeCode":"April 11, 2013, 04:59:41 PM","reply":7,"user":"99z32","content":"also require doctors to perform the procedures before asking about payment to ensure better care rather than substandard practice due to being a \"risk\"","contentSimp":"require doctors perform procedures payment ensure care substandard practice due \"risk\""},{"index":24,"timeCode":"April 11, 2013, 05:00:38 PM","reply":13,"user":"99z32","content":"make the class a state requirement","contentSimp":"make class state requirement"},{"index":25,"timeCode":"April 11, 2013, 05:01:43 PM","reply":-1,"user":"99z32","content":"having more doctors on hand in hospitals to ensure quicker response time to emergencies","contentSimp":"doctors hand hospitals ensure quicker response time emergencies"},{"index":26,"timeCode":"April 11, 2013, 05:03:09 PM","reply":-1,"user":"99z32","content":"one thing that would help America's healthcare system would be to limit the amount of lobbying the pharmaceutical companies can bride our elected officials.","contentSimp":"thing america's healthcare system limit amount lobbying pharmaceutical companies bride elected officials."},{"index":27,"timeCode":"April 11, 2013, 05:05:51 PM","reply":-1,"user":"99z32","content":"another thing that will help reform America's Healthcare system would be to not allow people to die just because they cannot afford the medicine, or procedures.","contentSimp":"thing reform america's healthcare system people die afford medicine, procedures."},{"index":28,"timeCode":"April 11, 2013, 05:06:51 PM","reply":-1,"user":"99z32","content":"stop sending foreign aid to countries that hate The United States when we have families here at home who cannot afford to eat or get a good education","contentSimp":"stop sending foreign aid countries hate united states families home afford eat good education"},{"index":29,"timeCode":"April 11, 2013, 05:07:24 PM","reply":-1,"user":"99z32","content":"eliminate the somewhat of a monopoly on healthcare over the people","contentSimp":"eliminate monopoly healthcare people"},{"index":30,"timeCode":"April 11, 2013, 05:10:01 PM","reply":-1,"user":"99z32","content":"prevent doctors from taking advantage of patients by having a board that oversees doctors offices in a certain area, possibly have a board of individuals that will review each case within each hospital","contentSimp":"prevent doctors taking advantage patients board oversees doctors offices area, possibly board individuals review case hospital"},{"index":31,"timeCode":"April 11, 2013, 05:11:17 PM","reply":5,"user":"99z32","content":"additionally allow the nurses to do more without having to have the doctor do it. The nurse should be trained to do the additional tasks though.","contentSimp":"additionally nurses doctor it. nurse trained additional tasks though."},{"index":32,"timeCode":"April 11, 2013, 05:12:55 PM","reply":-1,"user":"99z32","content":"sanitation and personal hygiene should be taught at an early age to have a better understanding of the importance of cleanliness.","contentSimp":"sanitation personal hygiene taught early age understanding importance cleanliness."},{"index":33,"timeCode":"April 11, 2013, 05:16:44 PM","reply":-1,"user":"99z32","content":"not allowing doctors to prescribe young individuals with medicines that could potentially harm the individual more than the problem they initially visited for was.","contentSimp":"allowing doctors prescribe young individuals medicines potentially harm individual problem initially visited was."},{"index":34,"timeCode":"April 11, 2013, 05:17:29 PM","reply":-1,"user":"99z32","content":"overall reduce the profitability of healthcare and force these establishments into putting the patient first rather than the almighty DOLLAR!","contentSimp":"reduce profitability healthcare force establishments putting patient almighty dollar!"},{"index":35,"timeCode":"April 11, 2013, 05:19:46 PM","reply":-1,"user":"99z32","content":"require doctors to explain different options of treatment rather than prescribing the patients with drugs. ex: rather than prescribing someone with medicine, the doctor could give the patient an alternative such as a change in diet, or a certain food group or a natural remedy that would be much more affordable.","contentSimp":"require doctors explain options treatment prescribing patients drugs. ex: prescribing medicine, doctor give patient alternative change diet, food group natural remedy affordable."},{"index":36,"timeCode":"April 11, 2013, 05:21:55 PM","reply":-1,"user":"99z32","content":"having a universal database of information on each patient between every hospital and doctors office in the US would allow a faster treatment and would allow doctors to see what prior doctors and health professionals have prescribed the patient to see if it has worked or shouldn't be used again. Also allow the doctors to make little notes in the database on the patients such as allergies, or certain drugs that shouldn't be given to the patient.","contentSimp":"universal database information patient hospital doctors office faster treatment doctors prior doctors health professionals prescribed patient worked shouldn't again. doctors make notes database patients allergies, drugs shouldn't patient."},{"index":37,"timeCode":"April 11, 2013, 05:23:28 PM","reply":-1,"user":"99z32","content":"bring back the draft and reduce the military budget to the extreme and take care of our own people and system before we go and try expanding our already broken system to foreign countries.","contentSimp":"bring back draft reduce military budget extreme care people system expanding broken system foreign countries."},{"index":38,"timeCode":"April 11, 2013, 05:24:44 PM","reply":-1,"user":"99z32","content":"have roughly the same treatment for the poor and middle class as the rich and wealthy are subject to.","contentSimp":"roughly treatment poor middle class rich wealthy subject to."},{"index":39,"timeCode":"April 11, 2013, 05:25:34 PM","reply":-1,"user":"99z32","content":"stop genetically modifying our foods and teach the people how to eat more healthy.","contentSimp":"stop genetically modifying foods teach people eat healthy."},{"index":40,"timeCode":"April 12, 2013, 01:51:42 PM","reply":3,"user":"74z39","content":"have more staff at the er\/hospital","contentSimp":"staff er\/hospital"},{"index":41,"timeCode":"April 12, 2013, 01:52:44 PM","reply":-1,"user":"74z39","content":"better education on how to take care of minor injuries so doctors in the hospital give people with more urgent emergencies better priority and care","contentSimp":"education care minor injuries doctors hospital give people urgent emergencies priority care"},{"index":42,"timeCode":"April 12, 2013, 01:53:07 PM","reply":-1,"user":"74z39","content":"make medicine more affordable","contentSimp":"make medicine affordable"},{"index":43,"timeCode":"April 12, 2013, 01:54:10 PM","reply":-1,"user":"74z39","content":"have healthcare accessible for those who work- even if they're laid off or fired(that's if they have a dependable track record but made a mistake)","contentSimp":"healthcare accessible work- they're laid fired(that's dependable track record made mistake)"},{"index":44,"timeCode":"April 12, 2013, 01:55:29 PM","reply":-1,"user":"74z39","content":"have insurance companies be more open and upfront with all their conditions on their plans","contentSimp":"insurance companies open upfront conditions plans"},{"index":45,"timeCode":"April 12, 2013, 01:55:58 PM","reply":-1,"user":"74z39","content":"have insurance companies care more about the people than their profits","contentSimp":"insurance companies care people profits"},{"index":46,"timeCode":"April 12, 2013, 01:56:45 PM","reply":-1,"user":"74z39","content":"have insurance companies not turn a family down for an insurance plan (or make them pay ten times more than they should) if there is a pre existant disease in the family","contentSimp":"insurance companies turn family insurance plan (or make pay ten times should) pre existant disease family"},{"index":47,"timeCode":"April 12, 2013, 01:57:05 PM","reply":-1,"user":"74z39","content":"have the er not charge you an arm and a leg for everything used (like blankets and socks and of such)","contentSimp":"er charge arm leg (like blankets socks such)"},{"index":48,"timeCode":"April 12, 2013, 01:57:54 PM","reply":-1,"user":"74z39","content":"train nurses and doctor to be kind no matter how busy they are in the er (people are in pain and sometimes all they need to see is smiling face)","contentSimp":"train nurses doctor kind matter busy er (people pain smiling face)"},{"index":49,"timeCode":"April 12, 2013, 01:58:31 PM","reply":-1,"user":"74z39","content":"educate the population about mental diseases","contentSimp":"educate population mental diseases"},{"index":50,"timeCode":"April 12, 2013, 01:58:57 PM","reply":-1,"user":"74z39","content":"have more financing for healthcare","contentSimp":"financing healthcare"},{"index":51,"timeCode":"April 12, 2013, 01:59:45 PM","reply":-1,"user":"74z39","content":"give more information about options of what to do to families who are taking care of the elderly","contentSimp":"give information options families taking care elderly"},{"index":52,"timeCode":"April 12, 2013, 02:00:29 PM","reply":-1,"user":"74z39","content":"more financial help to those who take care of the elderly full time","contentSimp":"financial care elderly full time"},{"index":53,"timeCode":"April 12, 2013, 02:02:43 PM","reply":-1,"user":"74z39","content":"teach children in school more about the healthcare systems that they need to know. knowledge is power, so teach it to them while they're young. this way they know what to expect when they're older. this way they will be thoroughly informed when they have to make the choices that they do when it comes to their health.","contentSimp":"teach children school healthcare systems know. knowledge power, teach they're young. expect they're older. informed make choices health."},{"index":54,"timeCode":"April 12, 2013, 02:06:08 PM","reply":-1,"user":"74z39","content":"have a more thorough way of educating the public on STDs and preventive measures","contentSimp":"educating public stds preventive measures"},{"index":55,"timeCode":"April 12, 2013, 02:06:47 PM","reply":-1,"user":"74z39","content":"educate the public on more natural ways of changing one's lifestyle to offset their genetic predispositons to certain diseases.","contentSimp":"educate public natural ways changing one's lifestyle offset genetic predispositons diseases."},{"index":56,"timeCode":"April 12, 2013, 02:07:34 PM","reply":-1,"user":"74z39","content":"have each person in America get tests done to see their standpoint in how healthy they are and what they need to do to prevent what they're genetically pre disposed to","contentSimp":"person america tests standpoint healthy prevent they're genetically pre disposed"},{"index":57,"timeCode":"April 12, 2013, 02:10:32 PM","reply":-1,"user":"74z39","content":"give thorough explanation of what shot that is required can do (all the good things and bad)","contentSimp":"give explanation shot required (all good things bad)"},{"index":58,"timeCode":"April 12, 2013, 02:11:04 PM","reply":-1,"user":"74z39","content":"if the bad outweigh the good an injection can do then the parent has the right to choose if their child is injected","contentSimp":"bad outweigh good injection parent choose child injected"},{"index":59,"timeCode":"April 12, 2013, 02:11:27 PM","reply":-1,"user":"74z39","content":"teach eastern and western approaches to medicine in med school","contentSimp":"teach eastern western approaches medicine med school"},{"index":60,"timeCode":"April 12, 2013, 02:13:03 PM","reply":-1,"user":"74z39","content":"give more funding to the ERs so they can staff more doctors and nurses to tend to those who need it","contentSimp":"give funding ers staff doctors nurses tend"},{"index":61,"timeCode":"April 12, 2013, 02:14:29 PM","reply":-1,"user":"74z39","content":"make birth control over the counter for women eighteen years old and up","contentSimp":"make birth control counter women eighteen years"},{"index":62,"timeCode":"April 12, 2013, 02:15:02 PM","reply":-1,"user":"74z39","content":"educate young men and women about rape and domestic abuse ","contentSimp":"educate young men women rape domestic abuse "},{"index":63,"timeCode":"April 12, 2013, 02:15:48 PM","reply":-1,"user":"74z39","content":"educate the public more about suicide and organizations who they can turn to if anyone ever feels suicidal","contentSimp":"educate public suicide organizations turn feels suicidal"},{"index":64,"timeCode":"April 12, 2013, 02:16:18 PM","reply":63,"user":"74z39","content":"or for those who have lost a loved one","contentSimp":"lost loved"},{"index":65,"timeCode":"April 12, 2013, 02:18:25 PM","reply":-1,"user":"74z39","content":"make healthcare affordable to those who do not have insurance. have a standard chart in every practice that shows what percentage of medical operation is done based on the family's income.","contentSimp":"make healthcare affordable insurance. standard chart practice shows percentage medical operation based family's income."},{"index":66,"timeCode":"April 12, 2013, 03:15:22 PM","reply":6,"user":"32z49","content":"easier access to health insurance","contentSimp":"easier access health insurance"},{"index":67,"timeCode":"April 12, 2013, 03:16:49 PM","reply":-1,"user":"18z33","content":"Educating the people about the issues of healthcare and where it stands compared to other nations.","contentSimp":"educating people issues healthcare stands compared nations."},{"index":68,"timeCode":"April 12, 2013, 03:17:26 PM","reply":-1,"user":"32z49","content":"lower interest rates on insurance","contentSimp":"lower interest rates insurance"},{"index":69,"timeCode":"April 12, 2013, 03:17:45 PM","reply":-1,"user":"18z33","content":"Make sure that the medical places are not influenced by money or their paycheck.","contentSimp":"make medical places influenced money paycheck."},{"index":70,"timeCode":"April 12, 2013, 03:18:00 PM","reply":-1,"user":"32z49","content":"more diabetes awareness","contentSimp":"diabetes awareness"},{"index":71,"timeCode":"April 12, 2013, 03:18:40 PM","reply":-1,"user":"32z49","content":"more thorough explanations for medicine","contentSimp":"explanations medicine"},{"index":72,"timeCode":"April 12, 2013, 03:19:16 PM","reply":-1,"user":"32z49","content":"more willingness to work with payments for those that don't have insurance","contentSimp":"willingness work payments don't insurance"},{"index":73,"timeCode":"April 12, 2013, 03:19:48 PM","reply":-1,"user":"18z33","content":"Perhaps paying doctors according to how well they do and how many people they treat actually get better in the end. For example, increased pay if nearly 90% of the people who came to that doctor became healthy again and reduced pay if it is at a particular percent.","contentSimp":"paying doctors people treat end. example, increased pay 90% people doctor healthy reduced pay percent."},{"index":74,"timeCode":"April 12, 2013, 03:20:59 PM","reply":-1,"user":"18z33","content":"Have background checks on doctors and see about their experiences. Doctors with hands on experience would be much better than one that did mainly paper and book work.","contentSimp":"background checks doctors experiences. doctors hands experience paper book work."},{"index":75,"timeCode":"April 12, 2013, 03:21:33 PM","reply":-1,"user":"32z49","content":"try to lower the cost of an appointment to those who don't have insurance.  paying about $100.00 for a 5 min conversation with a doctor doesn't seem right.","contentSimp":"lower cost appointment don't insurance.  paying $100.00 5 min conversation doctor doesn't right."},{"index":76,"timeCode":"April 12, 2013, 03:22:16 PM","reply":-1,"user":"32z49","content":"make sure every tech, nurse, and doctor are brought up to speed with the ever-changing technology","contentSimp":"make tech, nurse, doctor brought speed ever-changing technology"},{"index":77,"timeCode":"April 12, 2013, 03:22:28 PM","reply":-1,"user":"18z33","content":"Make sure that hospital or or places where people go to for a doctor have ways to properly communicate with the people of different cultures or have English as a second language.","contentSimp":"make hospital places people doctor ways properly communicate people cultures english language."},{"index":78,"timeCode":"April 12, 2013, 03:22:57 PM","reply":-1,"user":"32z49","content":"hire more nurses so the patient to nurse ratio isn't as high, which lead to less accidents made by overwhelmed nurses","contentSimp":"hire nurses patient nurse ratio isn't high, lead accidents made overwhelmed nurses"},{"index":79,"timeCode":"April 12, 2013, 03:24:04 PM","reply":-1,"user":"18z33","content":"Make sure that doctors inform the people they meet with about the issues and warnings of particular medicines, especially if it was something that was recently made or approved by the government.","contentSimp":"make doctors inform people meet issues warnings medicines, recently made approved government."},{"index":80,"timeCode":"April 12, 2013, 03:25:32 PM","reply":-1,"user":"18z33","content":"Make sure that the locations of medical places are known to the public or is easily accessible to them.","contentSimp":"make locations medical places public easily accessible them."},{"index":81,"timeCode":"April 12, 2013, 03:25:32 PM","reply":-1,"user":"32z49","content":"have more extensive background checks on nurses and techs who work with coma patients","contentSimp":"extensive background checks nurses techs work coma patients"},{"index":82,"timeCode":"April 12, 2013, 03:25:59 PM","reply":80,"user":"32z49","content":"more roadsigns or billboards","contentSimp":"roadsigns billboards"},{"index":83,"timeCode":"April 12, 2013, 03:27:00 PM","reply":-1,"user":"18z33","content":"Make sure that doctors are honest with people rather than being \"light\" with people when trying to them things such as about whether or not they are indeed overweight or other issues","contentSimp":"make doctors honest people \"light\" people things overweight issues"},{"index":84,"timeCode":"April 12, 2013, 03:27:23 PM","reply":-1,"user":"32z49","content":"try to recruit more teachers for nursing and med programs","contentSimp":"recruit teachers nursing med programs"},{"index":85,"timeCode":"April 12, 2013, 03:27:50 PM","reply":-1,"user":"32z49","content":"raise pay for med program educators","contentSimp":"raise pay med program educators"},{"index":86,"timeCode":"April 12, 2013, 03:29:37 PM","reply":-1,"user":"32z49","content":"monitor how nurses and doctors retrieve medicine, so as to avoid abuse of drugs","contentSimp":"monitor nurses doctors retrieve medicine, avoid abuse drugs"},{"index":87,"timeCode":"April 12, 2013, 03:29:59 PM","reply":-1,"user":"18z33","content":"There needs to be a better standard of how medical care is and what is legal and illegal when it comes to what states rule as legal for the public. Many states have different views and state laws on particular medicines but instead it should be standardized across states.","contentSimp":"standard medical care legal illegal states rule legal public. states views state laws medicines standardized states."},{"index":88,"timeCode":"April 12, 2013, 03:32:06 PM","reply":-1,"user":"18z33","content":"The issue could come down to how connected with the public is states and other political figures that decide and change the rules and other things about the medical care of people.","contentSimp":"issue connected public states political figures decide change rules things medical care people."},{"index":89,"timeCode":"April 12, 2013, 03:34:41 PM","reply":-1,"user":"32z49","content":"take the money we use to fight this war with marijuana, and put it into healthcare budget.","contentSimp":"money fight war marijuana, put healthcare budget."},{"index":90,"timeCode":"April 12, 2013, 03:35:12 PM","reply":-1,"user":"18z33","content":"However if the issue was to come down to whether or states and the government then that means it would be up to the people to voice their opinion about things such as medical care. If they were to do so they would needs to vote or at least be educated about such things. And a nations such as the US, there is also the issue of communicating the problem. So over all there is a lot of things that needs to be addressed if it were to come down to helping out and improving health care.","contentSimp":"issue states government means people voice opinion things medical care. vote educated things. nations us, issue communicating problem. lot things addressed helping improving health care."},{"index":91,"timeCode":"April 12, 2013, 03:39:00 PM","reply":-1,"user":"18z33","content":"A lot of the government's money is also being drained when it come to inconsistency in medical practices or laws in different states.","contentSimp":"lot government's money drained inconsistency medical practices laws states."},{"index":92,"timeCode":"April 12, 2013, 03:39:17 PM","reply":-1,"user":"32z49","content":"minimize unnecessary care","contentSimp":"minimize unnecessary care"},{"index":93,"timeCode":"April 12, 2013, 03:39:45 PM","reply":-1,"user":"32z49","content":"such as early elective deliveries","contentSimp":"early elective deliveries"},{"index":94,"timeCode":"April 12, 2013, 03:41:15 PM","reply":90,"user":"18z33","content":"TLDR; Pretty much it is all about educating people who can vote to make the change.","contentSimp":"tldr; pretty educating people vote make change."},{"index":95,"timeCode":"April 12, 2013, 03:43:20 PM","reply":-1,"user":"32z49","content":"integrating more about our healthcare system into the curriculum of public schools","contentSimp":"integrating healthcare system curriculum public schools"},{"index":96,"timeCode":"April 12, 2013, 03:45:43 PM","reply":-1,"user":"32z49","content":"have more medically inclined people in government to make changes for the healthcare system.  They will be the ones who can make better informed decisions on what needs to be done in our healthcare system because they live that every day, as opposed to someone who is in the \"out looking in\"","contentSimp":"medically inclined people government make healthcare system.  make informed decisions healthcare system live day, opposed \"out in\""},{"index":97,"timeCode":"April 18, 2013, 11:44:01 AM","reply":82,"user":"99z32","content":"additionally, have better direct routes and traffic flow to hospitals.","contentSimp":"additionally, direct routes traffic flow hospitals."},{"index":98,"timeCode":"April 18, 2013, 11:47:17 AM","reply":89,"user":"99z32","content":"additionally, legalize the herb and tax it to hell like cigarettes. Use the taxes to pay for our own states healthcare.","contentSimp":"additionally, legalize herb tax hell cigarettes. taxes pay states healthcare."},{"index":99,"timeCode":"April 18, 2013, 11:48:25 AM","reply":-1,"user":"99z32","content":"lower the cost of ambulance transport.","contentSimp":"lower cost ambulance transport."},{"index":100,"timeCode":"April 18, 2013, 11:49:12 AM","reply":-1,"user":"99z32","content":"state provide many more ambulances to hospitals to minimize the risk of fatality to a person due to a lack in number of ambulances.","contentSimp":"state provide ambulances hospitals minimize risk fatality person due lack number ambulances."},{"index":101,"timeCode":"April 18, 2013, 11:51:35 AM","reply":-1,"user":"99z32","content":"provide more onsite care, if an EMS believes that the person should be fine without having to go to the hospital they should let the person know directly and provide them with information as to how to remedy the issue.","contentSimp":"provide onsite care, ems believes person fine hospital person directly provide information remedy issue."},{"index":102,"timeCode":"April 18, 2013, 11:58:03 AM","reply":-1,"user":"99z32","content":"audit our whole federal government, and even state and local governments including military branches in search of financial waste. This financial waste should be used to finance the health of the people, reasonable security of the people, state and local utilities (transportation, government services) we should take care of the basics before attempting to take on excessive costs, as a normal family would do on a daily basis. Sit down see how much money we have coming in, pay for the necessities. Then whatever is left over can be used to finance  interests of the country as a whole.","contentSimp":"audit federal government, state local governments including military branches search financial waste. financial waste finance health people, reasonable security people, state local utilities (transportation, government services) care basics attempting excessive costs, normal family daily basis. sit money coming in, pay necessities. left finance  interests country whole."},{"index":103,"timeCode":"April 19, 2013, 01:23:57 PM","reply":0,"user":"74z39","content":"and if sudden job loss resulting in less of no income, then provide with alternative options to keep health insurance ongoing","contentSimp":"sudden job loss resulting income, provide alternative options health insurance ongoing"},{"index":104,"timeCode":"April 19, 2013, 01:24:28 PM","reply":100,"user":"74z39","content":"within financial means though","contentSimp":"financial means"},{"index":105,"timeCode":"April 19, 2013, 01:24:48 PM","reply":99,"user":"74z39","content":"and the costs of an emergency room visit","contentSimp":"costs emergency room visit"},{"index":106,"timeCode":"April 19, 2013, 01:26:28 PM","reply":-1,"user":"74z39","content":"ingrain healthy eating habits starting in elementary school so children grow up making better dietary choices","contentSimp":"ingrain healthy eating habits starting elementary school children grow making dietary choices"},{"index":107,"timeCode":"April 19, 2013, 01:27:35 PM","reply":-1,"user":"74z39","content":"feed students in school healthier, nutrient-filled lunches rather than what's cheapest to make","contentSimp":"feed students school healthier, nutrient-filled lunches what's cheapest make"},{"index":108,"timeCode":"April 19, 2013, 01:30:17 PM","reply":-1,"user":"74z39","content":"have secretarial staff in the waiting room medically trained to an extent to where they can offer some aid to those with less urgency compared to those who are in more dire situations who are taken into the ER right away ","contentSimp":"secretarial staff waiting room medically trained extent offer aid urgency compared dire situations er away "},{"index":109,"timeCode":"April 19, 2013, 01:31:23 PM","reply":-1,"user":"74z39","content":"stop denying people with preexisting diseases medical insurance","contentSimp":"stop denying people preexisting diseases medical insurance"},{"index":110,"timeCode":"April 19, 2013, 01:32:28 PM","reply":-1,"user":"74z39","content":"make getting insurances to those with preexisting diseases easier and more affordable","contentSimp":"make insurances preexisting diseases easier affordable"},{"index":111,"timeCode":"April 19, 2013, 01:33:09 PM","reply":-1,"user":"74z39","content":"teach young adults in high school how insurances works- premiums, benefits, the process of getting it\/using it, etc...","contentSimp":"teach young adults high school insurances works- premiums, benefits, process it\/using it, etc..."},{"index":112,"timeCode":"April 19, 2013, 01:36:45 PM","reply":-1,"user":"74z39","content":"have insurances focus on the health and need of their customers and not just focusing on the how much money ensuring insurance to their customers will make them","contentSimp":"insurances focus health customers focusing money ensuring insurance customers make"},{"index":113,"timeCode":"April 19, 2013, 01:37:56 PM","reply":-1,"user":"74z39","content":"have fresh out of med school students develop relationships with mentors throughout their whole career so if they need advice on anything they have someone","contentSimp":"fresh med school students develop relationships mentors career advice"},{"index":114,"timeCode":"April 19, 2013, 01:39:23 PM","reply":-1,"user":"74z39","content":"have doctors go back to conferences to learn about new discoveries in the scientific\/medical world so their knowledge is up to date with the new findings","contentSimp":"doctors back conferences learn discoveries scientific\/medical world knowledge date findings"},{"index":115,"timeCode":"April 19, 2013, 01:41:19 PM","reply":-1,"user":"74z39","content":"have doctors build relationships with their patients","contentSimp":"doctors build relationships patients"},{"index":116,"timeCode":"April 19, 2013, 01:43:51 PM","reply":-1,"user":"74z39","content":"don't use pesticides on crops\/find a way to grow crops naturally without any use of chemicals","contentSimp":"don't pesticides crops\/find grow crops naturally chemicals"},{"index":117,"timeCode":"April 19, 2013, 01:44:49 PM","reply":-1,"user":"74z39","content":"have places selling fruits and vegetables post signs up regarding what chemicals were sprayed on them and the effects they could cause after consumption","contentSimp":"places selling fruits vegetables post signs chemicals sprayed effects consumption"},{"index":118,"timeCode":"April 19, 2013, 01:46:47 PM","reply":-1,"user":"74z39","content":"if a patient's doctor is retiring within half a year (or withing an X amount of time), then the doctor should let them know asap and help his patient with finding a doctor they are comfortable\/suitable with","contentSimp":"patient's doctor retiring half year (or withing x amount time), doctor asap patient finding doctor comfortable\/suitable"},{"index":119,"timeCode":"April 19, 2013, 03:17:58 PM","reply":-1,"user":"18z33","content":"Change the condition of schools. What I mean by that is have schools and other places of education go through reforms such as removal of soda and snack machines that why children and adults do not have access to unhealthy food. This a step towards having people less likely to go to hospitals down the road from an unhealthy diet.","contentSimp":"change condition schools. schools places education reforms removal soda snack machines children adults access unhealthy food. step people hospitals road unhealthy diet."},{"index":120,"timeCode":"April 19, 2013, 03:21:59 PM","reply":-1,"user":"18z33","content":"Reform the educational system in schools, many adults who are teaching Health classes are mainly P.E. teachers or coaches who were forced to teach Health classes. By doing this, many times these \"Health teachers\" are putting half efforts just so that they can get through the Health classes they have to teach and go back to doing what they really wanted to do. By having actual trained and educated people working in the position of Health teacher rather than P.E. teachers or coaches of sports, then maybe children would be better educated about health and be more aware of what they're eating.","contentSimp":"reform educational system schools, adults teaching health classes p.e. teachers coaches forced teach health classes. this, times \"health teachers\" putting half efforts health classes teach back wanted do. actual trained educated people working position health teacher p.e. teachers coaches sports, children educated health aware they're eating."},{"index":121,"timeCode":"April 19, 2013, 03:24:03 PM","reply":119,"user":"32z49","content":"Make it like the Baylor Hospital chains; they don't have any sodas in the hospital except for a very small bottle sold in the gift shop.","contentSimp":"make baylor hospital chains; don't sodas hospital small bottle sold gift shop."},{"index":122,"timeCode":"April 19, 2013, 03:25:14 PM","reply":-1,"user":"32z49","content":"Make vegetables and healthy foods cheaper than a 1.00 McDouble","contentSimp":"make vegetables healthy foods cheaper 1.00 mcdouble"},{"index":123,"timeCode":"April 19, 2013, 03:25:43 PM","reply":-1,"user":"32z49","content":"Teach students about the different types of caloric diets","contentSimp":"teach students types caloric diets"},{"index":124,"timeCode":"April 19, 2013, 03:25:52 PM","reply":-1,"user":"18z33","content":"To further touch on education, perhaps it should start at the national level in which the government should help fund schools. A better educated population will help out overall in the long run. Most schools are forced to cut funding to projects and classes resulting in lack of better education for students in places such as hands on things and health.","contentSimp":"touch education, start national level government fund schools. educated population long run. schools forced cut funding projects classes resulting lack education students places hands things health."},{"index":125,"timeCode":"April 23, 2013, 10:54:00 AM","reply":-1,"user":"74z39","content":"make all fast food restaurants show you the dietary facts about their food","contentSimp":"make fast food restaurants show dietary facts food"},{"index":126,"timeCode":"April 23, 2013, 10:54:54 AM","reply":-1,"user":"74z39","content":"let consumers know how their food is processed\/made if consumers ask","contentSimp":"consumers food processed\/made consumers"},{"index":127,"timeCode":"April 23, 2013, 10:55:50 AM","reply":-1,"user":"74z39","content":"make children in school take more than one health class in four years of high school. there should be at least one health class per each academic school year","contentSimp":"make children school health class years high school. health class academic school year"},{"index":128,"timeCode":"April 23, 2013, 10:57:32 AM","reply":-1,"user":"74z39","content":"if they don't want to take health classes in high school give them the option of taking a yoga\/pilate\/crosfit\/zumba class (something to keep them active)","contentSimp":"don't health classes high school give option taking yoga\/pilate\/crosfit\/zumba class (something active)"},{"index":129,"timeCode":"April 23, 2013, 10:58:18 AM","reply":-1,"user":"74z39","content":"somehow remove the stigma of retirement homes","contentSimp":"remove stigma retirement homes"},{"index":130,"timeCode":"April 23, 2013, 10:58:42 AM","reply":-1,"user":"74z39","content":"make information about how to obtain long term care available.","contentSimp":"make information obtain long term care available."},{"index":131,"timeCode":"April 23, 2013, 10:59:21 AM","reply":-1,"user":"74z39","content":"make clinics to those who do not have insurance a little bit more affordable","contentSimp":"make clinics insurance bit affordable"},{"index":132,"timeCode":"April 23, 2013, 11:00:22 AM","reply":-1,"user":"74z39","content":"try to make medicine from the pharmacy more affordable","contentSimp":"make medicine pharmacy affordable"},{"index":133,"timeCode":"April 23, 2013, 11:01:14 AM","reply":-1,"user":"74z39","content":"make pharmaceuticals more regulated","contentSimp":"make pharmaceuticals regulated"},{"index":134,"timeCode":"April 23, 2013, 11:04:22 AM","reply":-1,"user":"74z39","content":"teach children in junior high school and high school all about health care while they're young so when they have to deal with it in the future, they are well prepared on how to handle healthcare issues","contentSimp":"teach children junior high school high school health care they're young deal future, prepared handle healthcare issues"},{"index":135,"timeCode":"April 23, 2013, 11:06:11 AM","reply":-1,"user":"74z39","content":"have our nation look at other country's who have better healthcare policies and see what America can do to tweek ours to be better than what it is now","contentSimp":"nation country's healthcare policies america tweek"},{"index":136,"timeCode":"April 23, 2013, 11:07:49 AM","reply":-1,"user":"74z39","content":"look at where all finances are going with regard to healthcare and then RE-finance the money to better allocate it so we don't waste it on programs we don't need or over fund so we can fund the under funded programs","contentSimp":"finances regard healthcare re-finance money allocate don't waste programs don't fund fund funded programs"},{"index":137,"timeCode":"April 23, 2013, 11:09:14 AM","reply":-1,"user":"74z39","content":"have local leaders who the communities can voice their concerns to and he\/she will voice them to those who can fix\/help with the problems arising","contentSimp":"local leaders communities voice concerns he\/she voice fix\/help problems arising"},{"index":138,"timeCode":"April 23, 2013, 11:10:51 AM","reply":-1,"user":"74z39","content":"have a segment of the news that informs the public of any changes of the healthcare system that is important for the general public to know","contentSimp":"segment news informs public healthcare system important general public"},{"index":139,"timeCode":"April 24, 2013, 12:44:36 PM","reply":-1,"user":"32z49","content":"explore more of other countries' technology so as to further ours","contentSimp":"explore countries' technology"},{"index":140,"timeCode":"April 24, 2013, 12:48:19 PM","reply":-1,"user":"32z49","content":"have more surveillance in hospital rooms, to avoid any abuse of any kind","contentSimp":"surveillance hospital rooms, avoid abuse kind"},{"index":141,"timeCode":"April 24, 2013, 12:53:04 PM","reply":-1,"user":"32z49","content":"regulate finances of a hospital so as to make sure it's more for the better of mankind than solely profit","contentSimp":"regulate finances hospital make it's mankind solely profit"},{"index":142,"timeCode":"April 24, 2013, 12:54:59 PM","reply":-1,"user":"32z49","content":"make it harder for people to claim mentally insane when faced with a criminal charge","contentSimp":"make harder people claim mentally insane faced criminal charge"},{"index":143,"timeCode":"April 25, 2013, 01:14:47 PM","reply":-1,"user":"99z32","content":"reform our educational system in a way that once someone enters high school (after their freshman year so they can get a feel for how school is) they are forced to choose whether they want to further pursue a college degree or enter the work force right out of school. After freshman year (beginning of sophomore year) each student will have to choose whether to branch off into a further educational process such as teaching more complex mathematics, sciences, and histories this type of path would be more suited for someone  wanting to continue their education past high school. On the contrary the second branch would be more workforce driven such as have classes to explore the different types of jobs available with a high school diploma, classes teaching everyday needs such as setting up insurance, saving money on groceries (smart Shopping), personal preventive care (how to take care of yourself and dependents), home ec classes, and also have different trade skills students could pursue in high school. There would be some overlay in subjects such as personal preventive care, job search techniques, and more. For far too long have I seen students in high school being taught math and science they never use in day to day activities when they don't even plan to go to college this education of these subjects to people who choose to enter the workforce waste so much time doing this that they have to wait and have no experience in how to get the jobs and once they do get the job they don't know how to do the required tasks in an adequate manner.","contentSimp":"reform educational system enters high school (after freshman year feel school is) forced choose pursue college degree enter work force school. freshman year (beginning sophomore year) student choose branch educational process teaching complex mathematics, sciences, histories type path suited someone  wanting continue education past high school. contrary branch workforce driven classes explore types jobs high school diploma, classes teaching everyday setting insurance, saving money groceries (smart shopping), personal preventive care (how care dependents), home ec classes, trade skills students pursue high school. overlay subjects personal preventive care, job search techniques, more. long students high school taught math science day day activities don't plan college education subjects people choose enter workforce waste time wait experience jobs job don't required tasks adequate manner."},{"index":144,"timeCode":"April 26, 2013, 03:21:24 PM","reply":-1,"user":"18z33","content":"Health needs to be acessisble to everyone who needs it in the US.","contentSimp":"health acessisble us."},{"index":145,"timeCode":"April 26, 2013, 03:22:00 PM","reply":-1,"user":"18z33","content":"Everyone needs better knowledge about the current state of Healthcare and what needs to be done for the people.","contentSimp":"knowledge current state healthcare people."},{"index":146,"timeCode":"April 26, 2013, 03:22:46 PM","reply":-1,"user":"18z33","content":"In the school system the understand about health and medical issues should be addressed either classes or other means.","contentSimp":"school system understand health medical issues addressed classes means."},{"index":147,"timeCode":"April 26, 2013, 03:23:40 PM","reply":-1,"user":"18z33","content":"Parents should also be informed about healthcare or adults in general so that people can fully be aware about it and inform or educate other people. Things tend to spread faster when people talk about it.","contentSimp":"parents informed healthcare adults general people fully aware inform educate people. things tend spread faster people talk it."},{"index":148,"timeCode":"April 26, 2013, 03:25:08 PM","reply":-1,"user":"18z33","content":"When it comes to the news, somethings should be addressed on there as well not just international news but also local and national and thing that really matter.","contentSimp":"news, somethings addressed international news local national thing matter."},{"index":149,"timeCode":"April 26, 2013, 03:26:43 PM","reply":-1,"user":"18z33","content":"Compared to nations around the world, US falls behind in many things such as education and the health of people, perhaps it is best to address this so that maybe healthcare and things related to medical issues can have less of a workload.","contentSimp":"compared nations world, falls things education health people, address healthcare things related medical issues workload."},{"index":150,"timeCode":"April 26, 2013, 03:27:53 PM","reply":-1,"user":"18z33","content":"On the same note about the health of people in the US, perhaps the path to all natural food with no chemicals or modified food should be told to people and perhaps then it would better the health of the people in the US.","contentSimp":"note health people us, path natural food chemicals modified food told people health people us."},{"index":151,"timeCode":"April 26, 2013, 03:29:06 PM","reply":-1,"user":"18z33","content":"To better inform people about issues in Healthcare, perhaps access to internet or TV should be easily obtained.","contentSimp":"inform people issues healthcare, access internet tv easily obtained."},{"index":152,"timeCode":"April 26, 2013, 03:30:17 PM","reply":-1,"user":"18z33","content":"Negative influences of junk food and \"lazy actives\" should be addressed and taken careful so that way children won't be on the path to a bad life style or health.","contentSimp":"negative influences junk food \"lazy actives\" addressed careful children won't path bad life style health."},{"index":153,"timeCode":"April 26, 2013, 03:31:07 PM","reply":-1,"user":"18z33","content":"Understanding the what happens behind the scene with things that large companies that advertise and sell junk food should be made clear and aware to the public.","contentSimp":"understanding scene things large companies advertise sell junk food made clear aware public."},{"index":154,"timeCode":"April 26, 2013, 03:32:03 PM","reply":153,"user":"18z33","content":"On that same note, by doing so people can help themselves in that sense and better the lifestyle choices.","contentSimp":"note, people sense lifestyle choices."},{"index":155,"timeCode":"April 26, 2013, 03:33:05 PM","reply":-1,"user":"18z33","content":"Perhaps the issues of schools and their educational system or even the way schools are funded (or lack of funding) can be the issue.","contentSimp":"issues schools educational system schools funded (or lack funding) issue."},{"index":156,"timeCode":"April 26, 2013, 03:35:19 PM","reply":-1,"user":"18z33","content":"Perhaps the environment and where people live can influence the situation and how people better take care of themselves. For example older neighborhoods or places of low income families tend to lack access to near by parks and recreational areas compared to newer homes that are planned out with parks and even a place to swim.","contentSimp":"environment people live influence situation people care themselves. older neighborhoods places low income families tend lack access parks recreational areas compared newer homes planned parks place swim."},{"index":157,"timeCode":"April 26, 2013, 03:36:46 PM","reply":-1,"user":"18z33","content":"If funding were to be put into educational systems then perhaps public schools would be much better suited to educate children and provide them with things that they would not normally receive especially in low income neighborhoods.","contentSimp":"funding put educational systems public schools suited educate children provide things receive low income neighborhoods."},{"index":158,"timeCode":"April 26, 2013, 03:37:42 PM","reply":-1,"user":"18z33","content":"When the issue of healthcare arises, it's hard for people to voice their opinions about it. If there was perhaps an easier way for people to comment on it and then perhaps there would be change.","contentSimp":"issue healthcare arises, it's hard people voice opinions it. easier people comment change."},{"index":159,"timeCode":"April 26, 2013, 03:39:12 PM","reply":-1,"user":"18z33","content":"It is not enough for people to just see it on TV or read it on a newspaper, many times people would acknowledge it but never really do anything about it or put it off for another time. Very few people would put out the effort to make a change.","contentSimp":"people tv read newspaper, times people acknowledge put time. people put effort make change."},{"index":160,"timeCode":"April 26, 2013, 03:40:28 PM","reply":-1,"user":"18z33","content":"On the same issue, many times it is people of different ethnicity that are shy or fearful to approach people government official, this should be addressed.","contentSimp":"issue, times people ethnicity shy fearful approach people government official, addressed."}]