[{"index":0,"timeCode":"April 01, 2013, 09:28:42 AM","reply":-1,"user":"91d41","content":"In Canada they have free health care since we know its possible i think we should aim for that.","contentSimp":"canada free health care aim that."},{"index":1,"timeCode":"April 01, 2013, 09:34:33 AM","reply":-1,"user":"91d41","content":"Instead of one emergency room in hospitals there should be at least two that have requirements so it can be less of a wait.","contentSimp":"emergency room hospitals requirements wait."},{"index":2,"timeCode":"April 01, 2013, 09:42:50 AM","reply":-1,"user":"91d41","content":"Finances shouldn't be so high once you get your bill from your recent hospital visit, so i think the bill paying should be paid only if the heavy or important things were used while at the hospital. If the physician didn't use important equipment then the bill shouldn't be so expensive.","contentSimp":"finances shouldn't high bill recent hospital visit, bill paying paid heavy important things hospital. physician didn't important equipment bill shouldn't expensive."},{"index":3,"timeCode":"April 01, 2013, 09:54:12 AM","reply":-1,"user":"91d41","content":"Insurance should come in different levels sort of like today but different. The first level is free for everyone and the next levels you would have today. The free package will still be treated as to the other packages. With the free package you still would get great service and quality. In the other packages the differences will be your family can stay all together as one health insurance verses your child leaving when they are 19.","contentSimp":"insurance levels sort today different. level free levels today. free package treated packages. free package great service quality. packages differences family stay health insurance verses child leaving 19."},{"index":4,"timeCode":"April 01, 2013, 09:57:16 AM","reply":-1,"user":"91d41","content":"The education shouldn't be messed with but the cost should go down since the school is already hard to get into ; which is a good thing; they cost should shorten.","contentSimp":"education shouldn't messed cost school hard ; good thing; cost shorten."},{"index":5,"timeCode":"April 01, 2013, 10:26:26 AM","reply":2,"user":"46d42","content":"The reason doctors use such important equipment is so that we can be treated to the best of their abilities. They are expensive because they are the best equipment.   ","contentSimp":"reason doctors important equipment treated abilities. expensive equipment.   "},{"index":6,"timeCode":"April 01, 2013, 10:26:55 AM","reply":-1,"user":"46d42","content":"How is school and health care related?","contentSimp":"school health care related?"},{"index":7,"timeCode":"April 01, 2013, 10:28:16 AM","reply":3,"user":"46d42","content":"What kind of levels should they have? Since you already have explained they are similar to the ones we already have today?","contentSimp":"kind levels have? explained similar today?"},{"index":8,"timeCode":"April 01, 2013, 10:33:49 AM","reply":-1,"user":"46d42","content":"I believe health care should be a little more affordable. The cost of living is already going up but the cost of staying alive shouldn't go up as well. Like taxes, the government takes out a percentage based on what the person makes, the cost of health care should be the same way. Because everyone makes different amounts of income the cost of health care should cost accordingly. ","contentSimp":"health care affordable. cost living cost staying alive shouldn't well. taxes, government takes percentage based person makes, cost health care way. makes amounts income cost health care cost accordingly. "},{"index":9,"timeCode":"April 01, 2013, 10:37:06 AM","reply":0,"user":"46d42","content":"But are our physicians just as good-quality as Canadian physicians? Is it quantity over quality? Free is convenient but you also have to think are you getting the best treatment possible?","contentSimp":"physicians good-quality canadian physicians? quantity quality? free convenient treatment possible?"},{"index":10,"timeCode":"April 01, 2013, 10:38:33 AM","reply":1,"user":"46d42","content":"What kinds of requirements should these emergency rooms have?","contentSimp":"kinds requirements emergency rooms have?"},{"index":11,"timeCode":"April 01, 2013, 10:48:08 AM","reply":-1,"user":"46d42","content":"When someone is overweight and they want to loose weight they will most likely go to the doctor and ask what the doctor has for them as a solution. Most doctors will suggest lipo-suction, body wraps, or weight loss pills. But has a doctor ever prescribed a healthy meal plan, or a work out schedule? Of course not! America is a business, Americans want money. Its very seldom that doctors will actually care about their patients more than making a profit out of them. Lipo-suction, body wraps and weight loss pills are quite expensive, healthcare does not cover it, in the end you are paying for confidence instead of working for it. What a caring doctor should prescribe is a dose of \"lay off on the McDonalds\", work out regularly and choose to be healthy. A healthy mindset can also build the confidence of a person for a lifetime and is the fuel for motivation.","contentSimp":"overweight loose weight doctor doctor solution. doctors suggest lipo-suction, body wraps, weight loss pills. doctor prescribed healthy meal plan, work schedule? not! america business, americans money. seldom doctors care patients making profit them. lipo-suction, body wraps weight loss pills expensive, healthcare cover it, end paying confidence working it. caring doctor prescribe dose \"lay mcdonalds\", work regularly choose healthy. healthy mindset build confidence person lifetime fuel motivation."},{"index":12,"timeCode":"April 01, 2013, 10:53:05 AM","reply":-1,"user":"46d42","content":"It seems like everyone wants cheap cost but no one wants cheap care. The reason health care is expensive is so we can have the best care available.","contentSimp":"cheap cost cheap care. reason health care expensive care available."},{"index":13,"timeCode":"April 01, 2013, 01:31:27 PM","reply":-1,"user":"63d43","content":"What would be a reasonable percentage to take out for health care?","contentSimp":"reasonable percentage health care?"},{"index":14,"timeCode":"April 01, 2013, 01:35:19 PM","reply":-1,"user":"63d43","content":"They should try a system where the amount you pay for health care should be determined by how many times you visit a doctor, with exceptions to the people who are chronically ill like patients with cancer","contentSimp":"system amount pay health care determined times visit doctor, exceptions people chronically patients cancer"},{"index":15,"timeCode":"April 01, 2013, 01:45:29 PM","reply":-1,"user":"63d43","content":"there are people constantly visit doctors because they are over weight and that effects how much we pay for healthcare so the people who choose to make bad choices should have to pay for their own action instead of making the general population pay as a whole","contentSimp":"people constantly visit doctors weight effects pay healthcare people choose make bad choices pay action making general population pay"},{"index":16,"timeCode":"April 01, 2013, 01:48:59 PM","reply":-1,"user":"63d43","content":"instead of spending tax payers dollars on trying to prevent obesity that money could be better spent somewhere else. For those people who decide to be obese should have to pay for their own actions. They are adults an should be responsible for what they eat and drink, the government should not have to spend money on telling you not to eat fast food everyday or to exercise   ","contentSimp":"spending tax payers dollars prevent obesity money spent else. people decide obese pay actions. adults responsible eat drink, government spend money telling eat fast food everyday exercise   "},{"index":17,"timeCode":"April 01, 2013, 01:51:35 PM","reply":-1,"user":"63d43","content":"There should be a maximum on how much a health care provider can charge a person because it would not hurt the health care providers to take a salary decrease","contentSimp":"maximum health care provider charge person hurt health care providers salary decrease"},{"index":18,"timeCode":"April 01, 2013, 02:24:12 PM","reply":1,"user":"34d44","content":"One could be for more urgent care and the other could be for injuries that would be okay to wait awhile","contentSimp":"urgent care injuries wait awhile"},{"index":19,"timeCode":"April 01, 2013, 02:30:18 PM","reply":-1,"user":"34d44","content":"I think everyone should have to pay the same amount. I don't think people should have to pay more just because they make more money.","contentSimp":"pay amount. don't people pay make money."},{"index":20,"timeCode":"April 01, 2013, 02:33:42 PM","reply":-1,"user":"34d44","content":"I think if health care was free, the quality of it would decrease.","contentSimp":"health care free, quality decrease."},{"index":21,"timeCode":"April 01, 2013, 02:39:25 PM","reply":-1,"user":"34d44","content":"This money should be put towards education for healthcare so that the quality and technology can continue to increase.","contentSimp":"money put education healthcare quality technology continue increase."},{"index":22,"timeCode":"April 01, 2013, 02:50:55 PM","reply":-1,"user":"34d44","content":"Yes, there should be maximums for charges but I don't think it should affect their salary. Doctors have to pay to keep their office open and operating.","contentSimp":"yes, maximums charges don't affect salary. doctors pay office open operating."},{"index":23,"timeCode":"April 01, 2013, 03:25:28 PM","reply":-1,"user":"92d45","content":"We Americans rely to much on pharmaceuticals. I believe we should have tighter regulations on the drugs that can be prescribed by doctors, and over the counter medicines. I say this because there are many examples of patients becoming dependent on these drugs leading to other health care related issues. ","contentSimp":"americans rely pharmaceuticals. tighter regulations drugs prescribed doctors, counter medicines. examples patients dependent drugs leading health care related issues. "},{"index":24,"timeCode":"April 01, 2013, 03:35:05 PM","reply":-1,"user":"92d45","content":"Adding to your point, I believe one of the biggest weapons we have against America's health system in general is exercise. All of the studies in the area of exercise have the benefits greatly out-weighting the risk. I believe America needs to stop leaning on pharmaceuticals, as a solution. Exercise is shown to be a tool against prevention of bad health,  and when one becomes ill exercise is also shown that exercise will help the body recover. ","contentSimp":"adding point, biggest weapons america's health system general exercise. studies area exercise benefits greatly out-weighting risk. america stop leaning pharmaceuticals, solution. exercise shown tool prevention bad health,  exercise shown exercise body recover. "},{"index":25,"timeCode":"April 01, 2013, 03:41:28 PM","reply":-1,"user":"92d45","content":"While I do believe health care should be cheaper for the average joe. I don't believe healthcare should be force onto people who don't need it, or simply just don't want it. I feel that it's a waste of money. I also think it break our constitutional rights.","contentSimp":"health care cheaper average joe. don't healthcare force people don't it, simply don't it. feel it's waste money. break constitutional rights."},{"index":26,"timeCode":"April 01, 2013, 03:41:53 PM","reply":-1,"user":"92d45","content":"ObamaCare?","contentSimp":"obamacare?"},{"index":27,"timeCode":"April 01, 2013, 03:48:26 PM","reply":-1,"user":"92d45","content":"There needs to be changes in Medicad, Medicare","contentSimp":"medicad, medicare"},{"index":28,"timeCode":"April 01, 2013, 03:54:59 PM","reply":-1,"user":"92d45","content":"There needs to be an advancement in the study of mental health. I feel like its such a black and grey area. Having the proper diagnosis on a person and treatment for the person.","contentSimp":"advancement study mental health. feel black grey area. proper diagnosis person treatment person."},{"index":29,"timeCode":"April 08, 2013, 09:38:09 AM","reply":12,"user":"91d41","content":"Even at that do we have the best care? Health care is expensive but that doesnt mean its the best. For something to be good it doesn't need to be high in price.","contentSimp":"care? health care expensive best. good doesn't high price."},{"index":30,"timeCode":"April 08, 2013, 09:53:32 AM","reply":-1,"user":"91d41","content":"Health care should be the same all around since we all are getting the same health care. So if you make more money than others why should they pay more for the same outcome","contentSimp":"health care health care. make money pay outcome"},{"index":31,"timeCode":"April 08, 2013, 11:20:55 AM","reply":-1,"user":"46d42","content":"A friend of mine's mother just recently broke her leg and back, she went to the doctors to get it checked out and it turns out she has to get $5000 worth of surgery done to repair the damage. She is also an older woman so it will also take more time to heal. Her family does not have that kind of money and her insurance does not cover the costs of the surgery. I think this is sad America, $5000 seems like a reasonable amount but the fact that insurance does not cover the cost of this surgery makes me sick to my stomach. If the government does not want to lower cost of health care then America's insurance companies should offer to cover more of our peoples' needs.","contentSimp":"friend mine's mother recently broke leg back, doctors checked turns $5000 worth surgery repair damage. older woman time heal. family kind money insurance cover costs surgery. sad america, $5000 reasonable amount fact insurance cover cost surgery makes sick stomach. government lower cost health care america's insurance companies offer cover peoples' needs."},{"index":32,"timeCode":"April 08, 2013, 11:27:40 AM","reply":-1,"user":"46d42","content":"McDonald's makes more money than these insurance companies, if not the same amount, maybe if we put more money into staying fit and healthy we would not need to go to the doctors for health related problems.","contentSimp":"mcdonald's makes money insurance companies, amount, put money staying fit healthy doctors health related problems."},{"index":33,"timeCode":"April 08, 2013, 11:42:07 AM","reply":-1,"user":"63d43","content":"instead of spending money on telling people what to eat they should use that money to open a community gym so that there is a place for people to go workout.","contentSimp":"spending money telling people eat money open community gym place people workout."},{"index":34,"timeCode":"April 08, 2013, 11:44:02 AM","reply":22,"user":"63d43","content":"I was referring to  the the insurance company not the doctors.","contentSimp":"referring to  insurance company doctors."},{"index":35,"timeCode":"April 08, 2013, 11:49:57 AM","reply":32,"user":"63d43","content":"the problem with that is that eating out is so much cheaper and faster compared to trying to eat healthy so maybe finding a way to make healthier food cheaper would decrease the amount of money people spend on fast food.","contentSimp":"problem eating cheaper faster compared eat healthy finding make healthier food cheaper decrease amount money people spend fast food."},{"index":36,"timeCode":"April 08, 2013, 11:52:10 AM","reply":-1,"user":"63d43","content":"If they could make healthy food more widely available then maybe people will choose to make the healthier decision.","contentSimp":"make healthy food widely people choose make healthier decision."},{"index":37,"timeCode":"April 08, 2013, 11:54:33 AM","reply":-1,"user":"63d43","content":"on the education side they could make taking a nutrient class in middle school a requirement so they kids can learn how to eat healthy and what types of food are good for you and that are easy to make.","contentSimp":"education side make taking nutrient class middle school requirement kids learn eat healthy types food good easy make."},{"index":38,"timeCode":"April 08, 2013, 12:39:12 PM","reply":36,"user":"34d44","content":"And also not as expensive. It's way cheaper and easier to eat off the dollar menus at fast food places.","contentSimp":"expensive. it's cheaper easier eat dollar menus fast food places."},{"index":39,"timeCode":"April 08, 2013, 12:48:41 PM","reply":37,"user":"34d44","content":"I agree. I think putting nutrition classes in schools is the best way to inform people of the importance of eating healthy.","contentSimp":"agree. putting nutrition classes schools inform people importance eating healthy."},{"index":40,"timeCode":"April 08, 2013, 12:54:23 PM","reply":-1,"user":"34d44","content":"What kinds of regulations would help this problem?","contentSimp":"kinds regulations problem?"},{"index":41,"timeCode":"April 13, 2013, 12:12:43 PM","reply":40,"user":"92d45","content":"I honestly don't know, we need to start educating americans at an early age that drugs aren't the solution to every medical problem. That taking to much drugs can lead to other medical issues.","contentSimp":"honestly don't know, start educating americans early age drugs aren't solution medical problem. taking drugs lead medical issues."},{"index":42,"timeCode":"April 13, 2013, 12:24:05 PM","reply":39,"user":"92d45","content":"Throughout middle school and high school I had nutritional classes, and like many other elective classes throughout school many students really failed to comprehend, and assess  the severity of the problems we live in these days. Every cause has an effect. I do think classes like that help, but if the student sees their parents eating fast food daily, nutritional classes become useless. Outside influences are very powerful during the adolescent years.  Its important that we pass down healthy lifestyles, from generation to generation. ","contentSimp":"middle school high school nutritional classes, elective classes school students failed comprehend, assess  severity problems live days. effect. classes help, student sees parents eating fast food daily, nutritional classes useless. influences powerful adolescent years.  important pass healthy lifestyles, generation generation. "},{"index":43,"timeCode":"April 13, 2013, 12:33:27 PM","reply":-1,"user":"92d45","content":"With the cost in America increasing, I honestly don't see how anyone would expect any services to decrease. Especially the services of  in the medical field, as important as they are. I think the only thing that can be done to offset the rise in cost, is prevention. It is  however the  inevitable that one will become sick however. I believe it all starts with the financial aspect of life. When the financial area of life get better, i feel all other areas of life will fall in place. including healthcare   ","contentSimp":"cost america increasing, honestly don't expect services decrease. services of  medical field, important are. thing offset rise cost, prevention. is  the  inevitable sick however. starts financial aspect life. financial area life better, feel areas life fall place. including healthcare   "},{"index":44,"timeCode":"April 15, 2013, 09:40:10 AM","reply":-1,"user":"91d41","content":"The problem with that is to get a better response to get healthier or to lose weight you have to do both, eat right and workout. ","contentSimp":"problem response healthier lose weight both, eat workout. "},{"index":45,"timeCode":"April 15, 2013, 09:45:02 AM","reply":-1,"user":"91d41","content":"America's obesity rate goes up every year by a higher number. Adults already know what to eat and what isn't the best thing, so they should start in schools and make it mandatory for kids to have a nutrients class or something in that category and make the breakfast and lunch menu healthy if it isn't already. Not saying its going to drop the rates but its a start for them to drop. ","contentSimp":"america's obesity rate year higher number. adults eat isn't thing, start schools make mandatory kids nutrients class category make breakfast lunch menu healthy isn't already. drop rates start drop. "},{"index":46,"timeCode":"April 15, 2013, 09:53:14 AM","reply":-1,"user":"91d41","content":"Dietary medications is not the way to go for losing weight or to get healthy. So why not take those off the shelves and with that money make it more reductive in another way. As in schools, gyms, people.","contentSimp":"dietary medications losing weight healthy. shelves money make reductive way. schools, gyms, people."},{"index":47,"timeCode":"April 15, 2013, 11:08:27 AM","reply":-1,"user":"46d42","content":"Although community gyms are a good idea, there are already gyms out there that are lost of cost and easy to join. The only thing stopping people today from going there is our busy lives' schedules and lack of motivation. The problem is not to build more places for people to work out its the people themselves that need to make better choices on how to live healthy lives.","contentSimp":"community gyms good idea, gyms lost cost easy join. thing stopping people today busy lives' schedules lack motivation. problem build places people work people make choices live healthy lives."},{"index":48,"timeCode":"April 15, 2013, 11:15:39 AM","reply":-1,"user":"46d42","content":"Eating healthy is a great way to stay fit and healthy but sometimes healthy food isn't always the most cheap, which is another reason why American's like to turn to fast food and other unhealthy but cheap and fast places. Maybe if we lowered the cost of the healthy foods more people would be in favor of buying healthy food.","contentSimp":"eating healthy great stay fit healthy healthy food isn't cheap, reason american's turn fast food unhealthy cheap fast places. lowered cost healthy foods people favor buying healthy food."},{"index":49,"timeCode":"April 15, 2013, 11:22:52 AM","reply":2,"user":"46d42","content":"In a way I agree with this statement. The hospital should only use the equipment necessary to treat the patient, but the reason the are so expensive is so that our patients can have the best treatment possible with the best equipment.","contentSimp":"agree statement. hospital equipment treat patient, reason expensive patients treatment equipment."},{"index":50,"timeCode":"April 15, 2013, 12:41:18 PM","reply":-1,"user":"34d44","content":"I think one way people could be motivated to live healthier lives is for insurance companies to give customers discounts or other perks for being in good health (low cholesterol level, not over weight, etc).","contentSimp":"people motivated live healthier lives insurance companies give customers discounts perks good health (low cholesterol level, weight, etc)."},{"index":51,"timeCode":"April 15, 2013, 12:46:49 PM","reply":42,"user":"34d44","content":"In these classes, they could also have some type of parent and student night where the kids tell their parents what they've learned and teach them about eating and living healthy so that the parents are informed as well and see how important it is.","contentSimp":"classes, type parent student night kids parents they've learned teach eating living healthy parents informed important is."},{"index":52,"timeCode":"April 17, 2013, 12:48:37 PM","reply":50,"user":"92d45","content":"I do agree with this point. I think it would be beneficial for both sides. However where would we draw the line for being healthy and non-healthy. I could also see the veiwpoints about people being discriminated   against if that point were to rise.","contentSimp":"agree point. beneficial sides. draw line healthy non-healthy. veiwpoints people discriminated   against point rise."},{"index":53,"timeCode":"April 17, 2013, 12:56:08 PM","reply":46,"user":"92d45","content":"I agree with your comment. Dietary medications is there as a fast way to lose weight. It is not the best way, or the most safe way to lose weight either. Its there to the people with the available resources to acquire such medications. Losing weight in gyms or by a diet is considered to be to slow. People fail to realize that losing weight via diet or exercise has many secondary benefits. Benefits you can't achieve by using medications ","contentSimp":"agree comment. dietary medications fast lose weight. way, safe lose weight either. people resources acquire medications. losing weight gyms diet considered slow. people fail realize losing weight diet exercise secondary benefits. benefits can't achieve medications "},{"index":54,"timeCode":"April 17, 2013, 01:09:27 PM","reply":45,"user":"92d45","content":"There's a reason America leads the world in health issues. Maybe it's the ingredients like fructose corn syrup, that can be found in every processed food sold in the market.  America needs to use other countries as examples when it comes to food. Even the most healthiest of choices aren't really all that healthy when you realize all the chemicals that are pumped into the food we eat.   ","contentSimp":"there's reason america leads world health issues. it's ingredients fructose corn syrup, found processed food sold market.  america countries examples food. healthiest choices aren't healthy realize chemicals pumped food eat.   "}]