[{"index":0,"timeCode":"April 09, 2013, 11:26:23 AM","reply":-1,"user":"56u29","content":"I think there should be tax breaks for physicians who find actual cures for low income patients with health problems. For example if a physician can get a diabetes 2 patient off of meds (although it is not curable) to where the patient has been educated and has their disease under control or managed- government should give physicians tax breaks on this because it would cost government less to pay for a low income persons meds.","contentSimp":"tax breaks physicians find actual cures low income patients health problems. physician diabetes 2 patient meds (although curable) patient educated disease control managed- government give physicians tax breaks cost government pay low income persons meds."},{"index":1,"timeCode":"April 09, 2013, 11:30:49 AM","reply":-1,"user":"56u29","content":"I don't believe much money should be spent on those with mental disabilities. Although research is good and maybe we can find ways to prevent peoples mental conditions, how much help are we really to those people and how much are they a help to society? I think if government and tax payers are going to spend money they should spend money on people who will be of some profit to society. ","contentSimp":"don't money spent mental disabilities. research good find ways prevent peoples mental conditions, people society? government tax payers spend money spend money people profit society. "},{"index":2,"timeCode":"April 09, 2013, 11:34:25 AM","reply":-1,"user":"56u29","content":"Child Protective Services shoukld be monitroed more closely because they always seem to force feed kids with pharmaceuticals such as antidepressants. I can only imagine how much money is spent trying to cure a kids negative experiences through drugs that never solve the problem. CPS' budget for meds should be cut so they can find better solutions that cost less.","contentSimp":"child protective services shoukld monitroed closely force feed kids pharmaceuticals antidepressants. imagine money spent cure kids negative experiences drugs solve problem. cps' budget meds cut find solutions cost less."},{"index":3,"timeCode":"April 09, 2013, 11:37:38 AM","reply":-1,"user":"56u29","content":"I think you should decide if you want health insurance. Thats an extra expense that is ridiculous and doesnt help us at all when we are alreadys truggling to pay bills in a hurting economy. Natural Selection- Not everybody is meant to survive.","contentSimp":"decide health insurance. extra expense ridiculous alreadys truggling pay bills hurting economy. natural selection- meant survive."},{"index":4,"timeCode":"April 09, 2013, 11:42:49 AM","reply":-1,"user":"56u29","content":"If you dont have insurance a ride to the hospital in an ambulance is $1000 thats ridiculous. It doesnt seem logical that a ride to a local hospital is wortht that much. Ambulances, emts, firefighters, are funded by city taxpayers. A drive to the hospital does not inconvenience the city or cost enough in gas for that.","contentSimp":"insurance ride hospital ambulance $1000 ridiculous. logical ride local hospital wortht much. ambulances, emts, firefighters, funded city taxpayers. drive hospital inconvenience city cost gas that."},{"index":5,"timeCode":"April 09, 2013, 11:46:00 AM","reply":-1,"user":"56u29","content":"Government should give taxbreaks to insurance companies that are willing to cover costs of chiropractic care and other modes of medicine\/health .","contentSimp":"government give taxbreaks insurance companies cover costs chiropractic care modes medicine\/health ."},{"index":6,"timeCode":"April 09, 2013, 11:48:09 AM","reply":-1,"user":"56u29","content":"free emergency healthcare should not be made available to patients 85 and older","contentSimp":"free emergency healthcare made patients 85 older"},{"index":7,"timeCode":"April 09, 2013, 11:48:56 AM","reply":-1,"user":"56u29","content":"If you think about it... why waste money on people that are really close to death.","contentSimp":"it... waste money people close death."},{"index":8,"timeCode":"April 09, 2013, 11:51:53 AM","reply":-1,"user":"56u29","content":"What if government were to take a big part of the budget towards healthcare and apply it to promoting\/helping organic agricultural busniess. The biggest problem in americais due to what we are eating. We're not diseased because our conditions are bad, but because our food is not whole.","contentSimp":"government big part budget healthcare apply promoting\/helping organic agricultural busniess. biggest problem americais due eating. we're diseased conditions bad, food whole."},{"index":9,"timeCode":"April 09, 2013, 01:28:13 PM","reply":-1,"user":"42u59","content":"Preventative care should be the main focus of healthcare.  It is easier to prevent someone from contracting a disease than to try to cure one.","contentSimp":"preventative care main focus healthcare.  easier prevent contracting disease cure one."},{"index":10,"timeCode":"April 09, 2013, 01:29:22 PM","reply":-1,"user":"42u59","content":"I think that pharmaceutical companies should allow more drugs that can cure diseases to go under clinical trials than worrying about the fact that cures do not make money.","contentSimp":"pharmaceutical companies drugs cure diseases clinical trials worrying fact cures make money."},{"index":11,"timeCode":"April 09, 2013, 01:31:53 PM","reply":8,"user":"42u59","content":"Physical education should also be improved because lack of funding towards it is another reason why people are contracting things such as high blood pressure and diabetes at younger ages.","contentSimp":"physical education improved lack funding reason people contracting things high blood pressure diabetes younger ages."},{"index":12,"timeCode":"April 09, 2013, 01:36:15 PM","reply":-1,"user":"42u59","content":"Healthcare should also be focused on helping everyone and not just the vast majority.  Not all medications work for everyone.","contentSimp":"healthcare focused helping vast majority.  medications work everyone."},{"index":13,"timeCode":"April 09, 2013, 01:38:43 PM","reply":-1,"user":"42u59","content":"Healthcare should be focused more on it's own country more than on others.  Charity starts at home.","contentSimp":"healthcare focused it's country others.  charity starts home."},{"index":14,"timeCode":"April 09, 2013, 01:43:03 PM","reply":-1,"user":"42u59","content":"Vaccinations should be more readily available to the public.","contentSimp":"vaccinations readily public."},{"index":15,"timeCode":"April 09, 2013, 01:45:04 PM","reply":-1,"user":"42u59","content":"Healthcare should be more focused on the young.","contentSimp":"healthcare focused young."},{"index":16,"timeCode":"April 09, 2013, 01:47:00 PM","reply":-1,"user":"42u59","content":"Healthcare research should focus more on artificial transplants.  This would significantly decrease our need for organ donors.","contentSimp":"healthcare research focus artificial transplants.  significantly decrease organ donors."},{"index":17,"timeCode":"April 09, 2013, 01:47:45 PM","reply":-1,"user":"42u59","content":"Emergency response time should be equal in all neighborhoods and not just the ones that are affluent.","contentSimp":"emergency response time equal neighborhoods affluent."},{"index":18,"timeCode":"April 09, 2013, 01:53:06 PM","reply":-1,"user":"42u59","content":"The age to enter into medicare should be increased due the fact that people are living longer.  The average lifespan for a human is no longer 72 but 83.  Also this will stop companies from dropping their employees from group coverage as soon.","contentSimp":"age enter medicare increased due fact people living longer.  average lifespan human longer 72 83.  stop companies dropping employees group coverage soon."},{"index":19,"timeCode":"April 09, 2013, 01:57:02 PM","reply":-1,"user":"42u59","content":"The government should increase the requirements to pass physical education classes instead of allowing children to become so doughy.  I don't think providing a rope or a jungle gym is that expensive.","contentSimp":"government increase requirements pass physical education classes allowing children doughy.  don't providing rope jungle gym expensive."},{"index":20,"timeCode":"April 09, 2013, 04:50:33 PM","reply":-1,"user":"88u75","content":"A basic health insurance should be mandatory for every citizen. Every citizen should have the right to be checked by a doctor and to get help when he or she needs it. The heritage and the financial income can not be problems to get a health insurance for every citizen.","contentSimp":"basic health insurance mandatory citizen. citizen checked doctor it. heritage financial income problems health insurance citizen."},{"index":21,"timeCode":"April 09, 2013, 04:53:20 PM","reply":-1,"user":"88u75","content":"Healthcare should be focused on everybody. There should not be a specific age boarder. Everybody is created equal so everybody deserves equal healthcare.","contentSimp":"healthcare focused everybody. specific age boarder. created equal deserves equal healthcare."},{"index":22,"timeCode":"April 09, 2013, 05:00:35 PM","reply":-1,"user":"88u75","content":"The healthcare system should look how healthcare systems in other countries working. In Germany is a health insurance mandatory and this is right. Life is not predictable and every day something bad can happen to everybody. Because of this, the U.S needs a mandatory health insurance. This insurance should cover everyday problems like sports injuries or financial support for people with eyes disabilities. For people who want to be covered better is still the opportunity to pay more and get more.","contentSimp":"healthcare system healthcare systems countries working. germany health insurance mandatory right. life predictable day bad happen everybody. this, u.s mandatory health insurance. insurance cover everyday problems sports injuries financial support people eyes disabilities. people covered opportunity pay more."},{"index":23,"timeCode":"April 09, 2013, 05:02:34 PM","reply":-1,"user":"88u75","content":"Every person has the same rights. Everybody deserves perfect healthcare until his last heartbeat.","contentSimp":"person rights. deserves perfect healthcare heartbeat."},{"index":24,"timeCode":"April 09, 2013, 05:03:31 PM","reply":-1,"user":"88u75","content":"The society should get more informed of current sicknesses in their districts.","contentSimp":"society informed current sicknesses districts."},{"index":25,"timeCode":"April 09, 2013, 05:07:44 PM","reply":-1,"user":"88u75","content":"We are living in the time period of globalization. Today, nobody can really say what home is. If the number of sick people is going to be decreased then there also going to be advantages in the U.S. The society should create a global healthcare network on all continents.","contentSimp":"living time period globalization. today, home is. number sick people decreased advantages u.s. society create global healthcare network continents."},{"index":26,"timeCode":"April 09, 2013, 05:12:39 PM","reply":-1,"user":"88u75","content":"A global healthcare network should be established to help for example foreigners during vacation in other countries. In addition, all healthcare documents on earth should be written in the same language and should be in the same form.","contentSimp":"global healthcare network established foreigners vacation countries. addition, healthcare documents earth written language form."},{"index":27,"timeCode":"April 11, 2013, 12:18:43 PM","reply":17,"user":"39u12","content":"There is no bias in repsonse times, it depends on the circumstance, if you live 30 miles from a hospital and or fire station, it will take longer to receive medical attention than if you lived just 5 miles away.","contentSimp":"bias repsonse times, depends circumstance, live 30 miles hospital fire station, longer receive medical attention lived 5 miles away."},{"index":28,"timeCode":"April 11, 2013, 12:21:38 PM","reply":-1,"user":"49s14","content":"I agree. if I agree. i work at a health club and insurance companies actually cover the membership costs for their members. There are age requirements for these types of programs. If the Government can give better tax breaks to these insurance companies, it could help with directing the spending towards getting our youth into health clubs and a more active lifestyle.","contentSimp":"agree. agree. work health club insurance companies cover membership costs members. age requirements types programs. government give tax breaks insurance companies, directing spending youth health clubs active lifestyle."},{"index":29,"timeCode":"April 11, 2013, 12:22:34 PM","reply":-1,"user":"39u12","content":"But this is a fallacy, that everything in the world, if equal, would work best. But as history has shown, when something grows to large and can no longer be controlled, it always collapses in on itself. Why decrease our healthcare benefits which have been worked for and earned by my forefathers, and give them to someone else who maybe has not earned them, or due to circumstance and bad luck has never received them. I look out my family and nation before any other, and taking away some benefits from myself and my family and giving them to others who have no right to them is just wrong, at least without my consent.","contentSimp":"fallacy, world, equal, work best. history shown, grows large longer controlled, collapses itself. decrease healthcare benefits worked earned forefathers, give earned them, due circumstance bad luck received them. family nation other, taking benefits family giving wrong, consent."},{"index":30,"timeCode":"April 11, 2013, 12:25:45 PM","reply":24,"user":"49s14","content":"I couldn't agree more but the root of the problem to this whole discussion is money. its not possible to get everyone the perfect healthcare plan.","contentSimp":"couldn't agree root problem discussion money. perfect healthcare plan."},{"index":31,"timeCode":"April 11, 2013, 12:29:06 PM","reply":-1,"user":"39u12","content":"We already have a system put in place called Medicaid, in which those who cannot afford services can receive them, on the taxpayer dollar. Why do we have to instead effect the privatized system? Those who receive medicaid do so off of the taxpayer, typically putting nothing in return back in, and costing taxpayers millions. Why effect directly those who can afford their own insurance? Giving equality to patients in deciding which doctors to see, this being Socialist! Also punishing doctors who take payment privately. If i have more money, and work harder, or maybe even am a little luckier, I should see whichever doctor I can afford. If I do not make enough to see that doctor, then I have to tough up and see the next one, and so on until I can afford one. This is how the world works, you get what you pay for. So everyone who cannot afford a nice car should be given a nice new Mercedes? Why? Where does the discussion end where freebies start and where they end? Keep the medical practice private, and keep the government out, they can only make things worse.","contentSimp":"system put place called medicaid, afford services receive them, taxpayer dollar. effect privatized system? receive medicaid taxpayer, typically putting return back in, costing taxpayers millions. effect directly afford insurance? giving equality patients deciding doctors see, socialist! punishing doctors payment privately. money, work harder, luckier, whichever doctor afford. make doctor, tough one, afford one. world works, pay for. afford nice car nice mercedes? why? discussion end freebies start end? medical practice private, government out, make things worse."},{"index":32,"timeCode":"April 11, 2013, 12:29:29 PM","reply":-1,"user":"49s14","content":"The Healthcare industry should start focusing more on the younger generation because of the increasing stat in childhood obesity. Cardiovascular disease is the leading cause of death in the United States.","contentSimp":"healthcare industry start focusing younger generation increasing stat childhood obesity. cardiovascular disease leading death united states."},{"index":33,"timeCode":"April 11, 2013, 12:31:55 PM","reply":9,"user":"49s14","content":"This is very true. companies and the government make it more expensive to eat healthy","contentSimp":"true. companies government make expensive eat healthy"},{"index":34,"timeCode":"April 11, 2013, 12:33:43 PM","reply":6,"user":"39u12","content":"This should be put in the same pot as social security, and if paid for by these individuals over the span of their life, that will in the future cover their cost. Why should they be turned down if others, some not even legal in this country can receive it? This is asinine, our seniors who have paid in and worked hard, lose it all and have it given to people who have never worked a day in their life? Reform programs such as welfare and food stamps, then we can have more money to work with and begin talks on matter such as healthcare reform","contentSimp":"put pot social security, paid individuals span life, future cover cost. turned others, legal country receive it? asinine, seniors paid worked hard, lose people worked day life? reform programs welfare food stamps, money work begin talks matter healthcare reform"},{"index":35,"timeCode":"April 11, 2013, 12:36:59 PM","reply":-1,"user":"39u12","content":"Maybe, English seems to be the universal language for many things such as business, why not healthcare. The only issue that may arise with a universale system is that I would take a strong effort by all nations taking part, and if it goes the way of the E.U., then could crumble down like domino's if one decides to drop, same matter as the current Euro Crisis","contentSimp":"maybe, english universal language things business, healthcare. issue arise universale system strong effort nations taking part, e.u., crumble domino's decides drop, matter current euro crisis"},{"index":36,"timeCode":"April 11, 2013, 12:38:50 PM","reply":-1,"user":"49s14","content":"Why is it so expensive just to get referred to another doctor? If someone is taken to the emergency room and cant be treated, they are referred somewhere else. That referral can be done before arriving. instead you pay a minimum of 1,000 dollars, and half of the time insurance companies do not want to pay their end.","contentSimp":"expensive referred doctor? emergency room treated, referred else. referral arriving. pay minimum 1,000 dollars, half time insurance companies pay end."},{"index":37,"timeCode":"April 11, 2013, 12:41:43 PM","reply":-1,"user":"39u12","content":"so such as with the elderly, we should cut their benefits since they are deemed no longer useful to society? Or i guess we can have elected death panels with can decide what is or is not necessary. Only leading back to a socialist approach. These should also receive the first attention next to small children.","contentSimp":"elderly, cut benefits deemed longer society? guess elected death panels decide necessary. leading back socialist approach. receive attention small children."},{"index":38,"timeCode":"April 11, 2013, 12:42:46 PM","reply":36,"user":"39u12","content":"I understand, and see this as an issue which needs to be resolved","contentSimp":"understand, issue resolved"},{"index":39,"timeCode":"April 11, 2013, 12:44:56 PM","reply":-1,"user":"49s14","content":"i know their are some benefits that healthcare companies offer if you live a healthy lifestyle. i think maybe our health insurance providers could offer some more incentives to a healthy lifestyle. maybe cheaper premiums and different kind of rewards.","contentSimp":"benefits healthcare companies offer live healthy lifestyle. health insurance providers offer incentives healthy lifestyle. cheaper premiums kind rewards."},{"index":40,"timeCode":"April 11, 2013, 12:45:05 PM","reply":-1,"user":"39u12","content":"Termination of other social assistance programs to fund a help care plan for those who are lower income?","contentSimp":"termination social assistance programs fund care plan lower income?"},{"index":41,"timeCode":"April 16, 2013, 12:12:30 PM","reply":-1,"user":"56u29","content":"I can say what home is... I live here in Arlington. I've lived in Dallas my whole life. I have a good understanding of where home is for me. I know several other people who would say the same.","contentSimp":"home is... live arlington. i've lived dallas life. good understanding home me. people same."},{"index":42,"timeCode":"April 16, 2013, 12:17:30 PM","reply":33,"user":"56u29","content":"Yeah unfortunately the biggest preventive STEP that we could take is in our food. There are so many loopholes in regulations though that we are still eating poison.","contentSimp":"yeah biggest preventive step food. loopholes regulations eating poison."},{"index":43,"timeCode":"April 16, 2013, 12:22:29 PM","reply":-1,"user":"56u29","content":"Yes, these ideals should always be based on what is just. It wouldnt be right if I were a kid from a hardworking yet still living paycheck to paycheck family seeing our food being taken out of our fridge and put into another family's fridge just because they make less money- The Hardworking get punished. I've lived in my truck in the past barely making enough money to survive and living without health insurance. To many people that sounds like a risk but that's the card we have been dealt and you have to learn to live within your means.","contentSimp":"yes, ideals based just. kid hardworking living paycheck paycheck family food fridge put family's fridge make money- hardworking punished. i've lived truck past barely making money survive living health insurance. people sounds risk that's card dealt learn live means."},{"index":44,"timeCode":"April 16, 2013, 12:28:17 PM","reply":-1,"user":"56u29","content":"I honestly believe there is no good answer to this healthcare problem. The way this looks is, no matter what someone has to pay the price for someone else to be healthy or not sick. There doesn't seem to be a good solution.","contentSimp":"honestly good answer healthcare problem. is, matter pay price healthy sick. doesn't good solution."},{"index":45,"timeCode":"April 16, 2013, 12:29:39 PM","reply":-1,"user":"56u29","content":"Maybe the government should look into a way of funding eastern type medicines. There are so many stories of people being healed by going that route.","contentSimp":"government funding eastern type medicines. stories people healed route."},{"index":46,"timeCode":"April 17, 2013, 01:21:39 PM","reply":-1,"user":"42u59","content":"There are plenty of non affluent neighborhoods with hospitals right up the street that have long emergency response times.  I have lost a friend because of it.","contentSimp":"plenty affluent neighborhoods hospitals street long emergency response times.  lost friend it."},{"index":47,"timeCode":"April 17, 2013, 01:28:24 PM","reply":-1,"user":"42u59","content":"That would be nice, but unfortunately there is no money cures.","contentSimp":"nice, money cures."},{"index":48,"timeCode":"April 17, 2013, 01:31:54 PM","reply":-1,"user":"42u59","content":"Healthcare should do a better job at foreign health screenings, there are diseases and parasites that used to be extinct in this country that have come back with full force.  For example, tuberculosis was essentially wiped out but has some how become a threat in the U.S. again.","contentSimp":"healthcare job foreign health screenings, diseases parasites extinct country back full force.  example, tuberculosis essentially wiped threat u.s. again."},{"index":49,"timeCode":"April 17, 2013, 01:33:48 PM","reply":-1,"user":"42u59","content":"Healthcare is nearly impossible to maintain with the high number of individuals in the world today.","contentSimp":"healthcare impossible maintain high number individuals world today."},{"index":50,"timeCode":"April 18, 2013, 12:07:02 PM","reply":41,"user":"39u12","content":"I agree, i too know what home is. A global healthcare system at this time will never work. Our own nation is having a hard time with keeping the post office open, let alone a new healthcare system which has already been passed. Programs such as the UN fail left and right, showing no new signs of progress in making strides in fields such as medicine. In helping these nations the west is falling, the west being the backbone to all of this. If the west falls, everything falls.","contentSimp":"agree, home is. global healthcare system time work. nation hard time keeping post office open, healthcare system passed. programs fail left right, showing signs progress making strides fields medicine. helping nations west falling, west backbone this. west falls, falls."},{"index":51,"timeCode":"April 18, 2013, 12:09:53 PM","reply":48,"user":"39u12","content":"I concur, screenings for anyone who is coming into our nation from foreign zones, or places which do not have the same standards of healthcare as our own. This may seem unfair, but we cannot have our own get sick and die because someone was mad that they had to go through additional screenings before entering. Coming over into the US is not a right, but a privilege unless you are a US citizen. We owe nothing to anyone else, and likewise for others owing anything to us.","contentSimp":"concur, screenings coming nation foreign zones, places standards healthcare own. unfair, sick die mad additional screenings entering. coming right, privilege citizen. owe else, likewise owing us."},{"index":52,"timeCode":"April 18, 2013, 12:20:54 PM","reply":-1,"user":"39u12","content":"Less government short of Anarchy is what our goal should be here. Understandably there should be standards set, education of physicians and medical personnel, medications, so on and so forth. But to the point in which the government wants to compete, and directly effect the healthcare system? This is where it has gone to far. Forcing every American to buy insurance, lying by saying that the penalties of not doing so is a tax. You can read the health care plan after it is passed???? This is terrifying, that the average American will stand for this, and reelect the same individuals responsible, and their excuse, \" Well at least they are trying\". 40% of americans are on some form of government assistance, and the president keeps saying that things are getting better, and more and more americans are out of work, many illegals receive free healthcare, while not paying taxes. Many americans receive benefits while sitting on their -----, and not contributing in their lifetimes while everyone else has to. As said by a famous scholar, every democracy will die, once its people realize that they can elect themselves benefits, or as we may know it \"freebees\". There should be no discussion past regulations.","contentSimp":"government short anarchy goal here. understandably standards set, education physicians medical personnel, medications, forth. point government compete, directly effect healthcare system? far. forcing american buy insurance, lying penalties tax. read health care plan passed???? terrifying, average american stand this, reelect individuals responsible, excuse, \" trying\". 40% americans form government assistance, president things better, americans work, illegals receive free healthcare, paying taxes. americans receive benefits sitting -----, contributing lifetimes to. famous scholar, democracy die, people realize elect benefits, \"freebees\". discussion past regulations."},{"index":53,"timeCode":"April 18, 2013, 12:43:46 PM","reply":-1,"user":"88u75","content":"Mental disabilities are one of the biggest problems in our society. This is also a reason why in Europe are not that much killed people by weapons as in the USA because everytime when in Europe is somebody depressed he goes to the psychologists who takes care of him. This appointment is payed at least until a certain boarder by the health insurence. Here in the US this does not exist because the health insurence is not mandatory for every citizen and when here somebody is depressed he or she is just freaking out and lives his or her worst fantasies","contentSimp":"mental disabilities biggest problems society. reason europe killed people weapons usa everytime europe depressed psychologists takes care him. appointment payed boarder health insurence. exist health insurence mandatory citizen depressed freaking lives worst fantasies"},{"index":54,"timeCode":"April 18, 2013, 12:46:10 PM","reply":-1,"user":"88u75","content":"you never know what can happen and every person who is on this earth deserves help. Also every kind of this people can develop the medicine by trying new things when the patient agrees","contentSimp":"happen person earth deserves help. kind people develop medicine things patient agrees"},{"index":55,"timeCode":"April 18, 2013, 12:48:40 PM","reply":35,"user":"88u75","content":"The euro crisis is something completely different. This is a financial politcal part where Greece cheated and destroyed everthing with the corruption.","contentSimp":"euro crisis completely different. financial politcal part greece cheated destroyed everthing corruption."},{"index":56,"timeCode":"April 19, 2013, 12:18:18 PM","reply":-1,"user":"49s14","content":"The reason why we're in such a bind with our healthcare is because we're a take now think later society. we're spending billions of dollars on research and the use of pharmaceutical drugs. people turn to these drugs because its easy.","contentSimp":"reason we're bind healthcare we're society. we're spending billions dollars research pharmaceutical drugs. people turn drugs easy."},{"index":57,"timeCode":"April 19, 2013, 12:21:50 PM","reply":-1,"user":"49s14","content":"Another big problem is foreigners that are benefiting from free health care that American citizens are paying for. i understand they want to come here for a better life but we have to come up with some plan that forces them to contribute. too many people are looking for handouts now a days or expect someone to help bail them out of their situation","contentSimp":"big problem foreigners benefiting free health care american citizens paying for. understand life plan forces contribute. people handouts days expect bail situation"},{"index":58,"timeCode":"April 19, 2013, 12:26:31 PM","reply":-1,"user":"49s14","content":"Healthcare should be treated like buying a car. you may want a 2013 Camaro but don't have the down payment or the credit score. a car dealership isn't going to give you a handout. You have to settle for something less or what you can afford or account for.","contentSimp":"healthcare treated buying car. 2013 camaro don't payment credit score. car dealership isn't give handout. settle afford account for."},{"index":59,"timeCode":"April 19, 2013, 12:28:50 PM","reply":14,"user":"49s14","content":"the only thing with that is, more money would have to come out of our pockets","contentSimp":"thing is, money pockets"},{"index":60,"timeCode":"April 22, 2013, 11:40:28 AM","reply":-1,"user":"49s14","content":"why should we buy into this new healthcare system if congress is not? Obama was asked the question \"will you and your family adopt this new healthcare plan\"? He danced around the question and did not answer. Other members of congress were asked the same question and they said they will \"think about it\"","contentSimp":"buy healthcare system congress not? obama asked question \"will family adopt healthcare plan\"? danced question answer. members congress asked question \"think it\""},{"index":61,"timeCode":"April 22, 2013, 11:51:35 AM","reply":53,"user":"49s14","content":"This will always be a problem. also Europe has cameras on almost every street corner. That is why crime and violent acts are so uncommon. I personally think that our country should really consider doing the same. Going back to health Insurance. If we dedicate more time to research on new and improved drugs for people with \"mental illness\", we're taking away time and money away from the leading cause of death here in the U.S., which is cardiovascular disease. This disease is one of the main reasons why our healthcare has become such a problem.","contentSimp":"problem. europe cameras street corner. crime violent acts uncommon. personally country same. back health insurance. dedicate time research improved drugs people \"mental illness\", we're taking time money leading death u.s., cardiovascular disease. disease main reasons healthcare problem."},{"index":62,"timeCode":"April 23, 2013, 12:11:36 PM","reply":-1,"user":"56u29","content":"Yes but it is to big of a cost to try and help everyone. Natural selection should be considered here. We cant save everyone, especially when those being saved will not have a high quality of life if kept alive.","contentSimp":"big cost everyone. natural selection considered here. save everyone, saved high quality life alive."},{"index":63,"timeCode":"April 23, 2013, 12:16:47 PM","reply":37,"user":"56u29","content":"Thinking with your heart - won't get you anywhere in business as so with coming up with a financially responsible healthcare plan that is just.","contentSimp":"thinking heart - won't business coming financially responsible healthcare plan just."},{"index":64,"timeCode":"April 23, 2013, 12:21:49 PM","reply":58,"user":"56u29","content":"You're right... I have a bad knee and bad shoulder but I can't afford to go to a doctor. But the last thing I want is to get a hand out. This health care stuff sucks... theres no solution","contentSimp":"you're right... bad knee bad shoulder can't afford doctor. thing hand out. health care stuff sucks... solution"},{"index":65,"timeCode":"April 23, 2013, 12:24:35 PM","reply":62,"user":"88u75","content":"We are not living in the time of Charles Darwin anymore. It is not about who can be saved who not but it is about that every body is created equal. If we would set a boarder where we would not help anymore people with big health problems, a big corruption crisis would occur.","contentSimp":"living time charles darwin anymore. saved body created equal. set boarder anymore people big health problems, big corruption crisis occur."},{"index":66,"timeCode":"April 23, 2013, 12:29:49 PM","reply":-1,"user":"56u29","content":"What if for people to get the health care they wanted but could not afford it they had to pay by community service for a government job. This would allow the govt to cut back on jobs which means less salaries to pay but then allows patients to get better care. Of course this sounds simplistic but the jobs could accomModate based on disability or whatever and is open to any kind of adjustment. At the end of the day spending has to be cut somewhere in order to provide more affordable healthcare or debt ceiling is just raised and the dollar crashes faster.  ","contentSimp":"people health care wanted afford pay community service government job. govt cut back jobs means salaries pay patients care. sounds simplistic jobs accommodate based disability open kind adjustment. end day spending cut order provide affordable healthcare debt ceiling raised dollar crashes faster.  "},{"index":67,"timeCode":"April 23, 2013, 12:30:05 PM","reply":64,"user":"88u75","content":"This is the point we can not be afraid of people or work that people do who actually want to help us. If this opinion would occur at more and more people we would live in a sick society and the doctors would become unemployed.","contentSimp":"point afraid people work people us. opinion occur people live sick society doctors unemployed."},{"index":68,"timeCode":"April 23, 2013, 12:32:26 PM","reply":-1,"user":"88u75","content":"Health insurences should be available for everybody and cover every health disability except body\/beauty makeovers.","contentSimp":"health insurences cover health disability body\/beauty makeovers."},{"index":69,"timeCode":"April 25, 2013, 12:09:47 PM","reply":60,"user":"39u12","content":"This showed the hypocrisy of our current system, do as I say not as i do. This double standard is wrong, that certain individuals because of status can opt out of a mandatory program, while others are forced to stay in, or are fined for not doing so. Why not make everyone participate, it is only fair. ","contentSimp":"showed hypocrisy current system, do. double standard wrong, individuals status opt mandatory program, forced stay in, fined so. make participate, fair. "},{"index":70,"timeCode":"April 25, 2013, 12:12:13 PM","reply":68,"user":"39u12","content":"they are to an extent, but I agree, a separate government program should be in place to take care of such matters. Like welfare for example, it is there for those who need it to use, but is optional, this is the system we should have in place, and we do, Medicaid and Medicare.","contentSimp":"extent, agree, separate government program place care matters. welfare example, use, optional, system place, do, medicaid medicare."},{"index":71,"timeCode":"April 25, 2013, 12:13:58 PM","reply":65,"user":"39u12","content":"Making the playing field level then, don't give one person an advantage that you would not give another. We have health issues here that must be taken care of, and until then, we need to stay focused and help our own.","contentSimp":"making playing field level then, don't give person advantage give another. health issues care of, then, stay focused own."},{"index":72,"timeCode":"April 25, 2013, 12:18:56 PM","reply":63,"user":"39u12","content":"But who should stripe me of this thought, and on what grounds? I feel that a group of people who have paid in, and are our elders, they need to be taken care of, not thrown by the wayside. I think that the bigger issue is that as a nation we are straying away from who we are. Granted I am thinking with my heart, but in the end it is for better not worse. Communism seems to be such a beautiful thing, common sense applied, pure perfection, but the one rule which it does not take into account? We as humans are not perfect. We cannot have a Utopia, it is against our nature.","contentSimp":"stripe thought, grounds? feel group people paid in, elders, care of, thrown wayside. bigger issue nation straying are. granted thinking heart, end worse. communism beautiful thing, common sense applied, pure perfection, rule account? humans perfect. utopia, nature."},{"index":73,"timeCode":"April 25, 2013, 12:30:25 PM","reply":-1,"user":"39u12","content":"I think we should leave our healthcare system intact at the moment, hesitating any major changes. Instead small incremental changes are necessary, something that takes time, nothing drastic and overnight, we cannot rush this. Most people do not realize that it took time to assemble such a system, with much though put into it, why not continue to do the same in regards to changing it?","contentSimp":"leave healthcare system intact moment, hesitating major changes. small incremental necessary, takes time, drastic overnight, rush this. people realize time assemble system, put it, continue changing it?"}]